{"title":"Synthesis of Acetylenes, Allenes and Cumulenes","uid":15383208,"size":2888728,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0048b085356c5e42e2ef3cc8dc76e5c62ece764d&amp;dn=Synthesis+of+Acetylenes%2C+Allenes+and+Cumulenes&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1469253975,"description":"Synthesis of Acetylenes, Allenes and Cumulenes - Methods and Techniques - Lambert Brandsma (Elsevier, 2004).pdf\r\n\r\nThere is a vast and often bewildering array of synthetic methods and reagents available to organic chemists today. The Best Synthetic Methods series allows any scientist who is interested in the chemical transformations of molecules to choose between all the alternatives and assess their real advantages and limitations. With the emphasis on laboratory use, these volumes represent a comprehensive and practical guide to modern synthetic organic chemistry.\r\n\r\nThis book is the product of the author's many years practical experience and reading of the original literature. It contains a valuable distillation and critical evaluation of the Best Synthetic Methods for the formation and reaction of molecules containing carbon-carbon triple bonds or cumulative carbon-carbon double bonds. A brief review of each area is provided, but the emphasis in all cases is on describing efficient practical methods to effect the transformations described. The reader can therefore use this book to rapidly review and select the best methods of performing a synthetic conversion to create or modify a molecule containing an acetylene, allene or cumulene functionality. In addition, the documentation of a large number of experimental recipes enables the user to synthesise an unsaturated molecule without the need to access to the original literature.\r\n\r\n- Reviews and evaluates the various methods for the formation and reaction of acetylenes, cumulenes and allenes.\r\n- Provides detailed practical experimental for many important reactions.\r\n- General tips and analytical data are provided from the author's own extensive research in this area","torrent":{"xt":"urn:btih:0048b085356c5e42e2ef3cc8dc76e5c62ece764d","amp;dn":"Synthesis+of+Acetylenes%2C+Allenes+and+Cumulenes","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0048b085356c5e42e2ef3cc8dc76e5c62ece764d","infoHashBuffer":{"type":"Buffer","data":[0,72,176,133,53,108,94,66,226,239,60,200,220,118,229,198,46,206,118,77]},"announce":[],"urlList":[]}}