{"title":"New York 1776: The Continentals' First Battle","uid":11772581,"size":40721299,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:00e571d50e9984f4105553759d73032f685c4cb0&amp;dn=New+York+1776%3A+The+Continentals%27+First+Battle&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1427132769,"description":"Osprey's examination of the Continentals' first battle of the American Revolutionary War (1775-1783). General Sir William Howe's NewYork campaign gave the British their best chance of destroying the Continental Army and George Washington's resistance to colonial power. Having initially assembled his forces on Staten Island, Howe succeeded in dividing the Continentals, defeated them on Long Island and forced Washington to retreat to Brooklyn Heights. Under siege there Washington successfully extricated his troops and crossed the East River to Manhattan but soon had to fall back on Harlem Heights.\n\nAfter a few weeks Howe forced the Continentals north to White Plains and defeated them again. However, he allowed Washington to withdraw and preserve his army when more aggressive pursuit could have brought the campaign to a decisive conclusion and ended the war. Instead, with the British army rapidly weakening and facing huge manpower shortages, Washington emerged from a succession of defeats to produce what was ultimately a war-winning strategy. The author provides fascinating insights into a unique campaign in which a string of British victories ultimately led to failure and defeat","torrent":{"xt":"urn:btih:00e571d50e9984f4105553759d73032f685c4cb0","amp;dn":"New+York+1776%3A+The+Continentals%27+First+Battle","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00e571d50e9984f4105553759d73032f685c4cb0","infoHashBuffer":{"type":"Buffer","data":[0,229,113,213,14,153,132,244,16,85,83,117,157,115,3,47,104,92,76,176]},"announce":[],"urlList":[]}}