{"title":"Prince - The Vault (Old Friends 4 Sale) 1999 TQMP [FLAC]","uid":4402084,"size":290317030,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:018ef4f556e20d0efe40902a6a45e3c149fd9b77&amp;dn=Prince+-+The+Vault+%28Old+Friends+4+Sale%29+1999+TQMP+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Breezin","files":16,"time":1221754660,"description":"Prince, perhaps the greatest style synthesizer in the history of rock,shows his command of rock, jazz, blues, soul, and funk in this superb collection of previously unreleased cuts recorded for WB.\nIt opens with the rollicking &quot;The Rest of My Life,&quot; loaded with funk and horns so tight you'll be thinking James Brown's Flames! When Prince commands &quot;let's go!&quot; the band swings into full gear, with funky sax and a driving rhythm section. The second song, &quot;It's About That Walk,&quot; is in the same mode (except for Prince's trademark falsetto, very effective here) punctuated by organ, and, again, those fabulous horns. He builds up the drums/guitars into a soul-shaking crescendo (&quot;...have mercy&quot;)- pays tribute to his predecessors (&quot;remember that ending?&quot;), and gets away with a showmanship worthy of you-know-who. How many others can do James Brown this good?\n\nPrince's melodic talent is evident on both &quot;She Spoke 2 Me&quot; and &quot;Extraordinary,&quot; a vintage Prince ballad--smooth and falsettoed--complemented by tasty guitar and piano accents. But the former song (&quot;She Spoke...&quot;) is the revelation here... as jazz-influenced as anything I've heard from him, brimming with excellent guitar work and jazzy comping by the rhythm section. Listen closely and you'll hear shades of John Coltrane, Ornette Coleman and Miles Davis on the breaks. Brilliant! Give credit to the horn players: Michael Nelson, Brian Gallagher, Steve Strand, and Kathy and Jensen, with arrangements by Michael Nelson and Prince.\n\n&quot;5 Women+&quot; is Robert Cray-style blues, with Cray's strong narratives and B.B. King riffs laid down just right, enhanced by muted trumpet for added poignancy. &quot;When the Lights Go Down&quot; masterfully uses percussion and piano for a soft, relaxing groove. The only failure on the CD is &quot;My Little Pill,&quot; which is mercifully short. \n\nThe rest of the songs are outstanding, with special attention due &quot;Sarah&quot; - a total rocker that recalls Little Richard, 70's funk, and (yes) James Brown. Exuberant, it's total head-rocking, danceable joy (and Prince is one of the few who can manage a convincing &quot;watch out!&quot;). I strongly recommend this album to Prince fans, which must now expand to include jazz, funk and R&amp;B followers as well! \n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project me and my fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at:  &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\nYou can find all TQMP uploads at: www.thepiratebay.se  (Simply use the TQMP searchtag :)\n\nContact: &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;1270607777687b7c527e7b64773c7c7e&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\nGreetings to ya'all from the Breezin Dutchman! d:)","torrent":{"xt":"urn:btih:018ef4f556e20d0efe40902a6a45e3c149fd9b77","amp;dn":"Prince+-+The+Vault+%28Old+Friends+4+Sale%29+1999+TQMP+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"018ef4f556e20d0efe40902a6a45e3c149fd9b77","infoHashBuffer":{"type":"Buffer","data":[1,142,244,245,86,226,13,14,254,64,144,42,106,69,227,193,73,253,155,119]},"announce":[],"urlList":[]}}