{"title":"The Matrix 1080P","uid":7611809,"size":28443199488,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:01a1e1d3e4e25b6b0d6f85a5cce41c55575aaa48&amp;dn=The+Matrix+1080P&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"danteX666","files":1,"time":1347087622,"description":"I present to you the Matrix in the form of a untouched MT2S stream stripped right from the BRD its self. everything is untouched except for the removal of unwanted ads and other useless junk. Movie is intact alogn with Audio and SUbs\n\nMatrix Reloaded and Matrix Revelations will follow soon. Have patience for I am uploading from a Home connection straight to my seedbox which will share the movie at blazing speeds\n\n\nThomas A. Anderson is a man living two lives. By day he is an average computer programmer and by night a hacker known as Neo. Neo has always questioned his reality, but the truth is far beyond his imagination. Neo finds himself targeted by the police when he is contacted by Morpheus, a legendary computer hacker branded a terrorist by the government. Morpheus awakens Neo to the real world, a ravaged wasteland where most of humanity have been captured by a race of machines that live off of the humans' body heat and electrochemical energy and who imprison their minds within an artificial reality known as the Matrix. As a rebel against the machines, Neo must return to the Matrix and confront the agents: super-powerful computer programs devoted to snuffing out Neo and the entire human rebellio\n\n\nWritten Introduction to the Commentaries by the Wachowskis\nAudio Commentary by Dr. Cornell West (Professor of Religion and African American Studies at Princeton University) and Author Ken Wilber\n\nAudio Commentary by the the Critics Todd McCarthy (Film Critic for Variety), David Thompson (Author of &quot;The Biographical Dictionary of Film&quot;) and John Powers (from Vogue magazine)\n\nEnglish, French and Spanish Subtitles\n2.35:1 Anamorphic NTSC\nEnglish Dolby Digital 5.1\nFrench Dolby Digital 5.1 ","torrent":{"xt":"urn:btih:01a1e1d3e4e25b6b0d6f85a5cce41c55575aaa48","amp;dn":"The+Matrix+1080P","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01a1e1d3e4e25b6b0d6f85a5cce41c55575aaa48","infoHashBuffer":{"type":"Buffer","data":[1,161,225,211,228,226,91,107,13,111,133,165,204,228,28,85,87,90,170,72]},"announce":[],"urlList":[]}}