{"title":"4 Player Reactor (Multiplayer) v1.94 [PD]","uid":8816545,"size":1678318,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:0227b6e5c17896ec9d232fdeae491c8265d03ce2&amp;dn=4+Player+Reactor+%28Multiplayer%29+v1.94+%5BPD%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Androider","files":-1,"time":1376599860,"description":"\n4 Player Reactor is the original fast, clean and funny reaction game for two to four players on the same device.\n\nChallenge your friends (or enemies) to a multiplayer battle of reflexes, wits and knowledge! Great as a bar game, ice breaker or to decide who has to do the dishes.\n\nOne of 28 (we continuously add more) exciting mini-games is displayed on screen, and if you think the answer is correct, hit your button faster than your opponents to get a point. But be careful - hit it at the wrong time, and you'll lose one.\n\nAfter a few seconds, the next multiplayer challenge starts - and you can make up for lost points or extend your lead against your adversary!\n\nBENEFITS OF 4 PLAYER REACTOR\n28 (and growing) mini-games with four difficulties each ranging from easy to insane -- that means over 100 mini-game combinations! A single-player training mode when you want to hone your skills for the next encounter, no advertisements whatsoever, and lots of extra settings for even more multiplayer fun!\n\nUP TO FOUR PLAYERS ON THE SAME DEVICE\nNobody needs to wait, two, three or four players, one device, at the same time! Frantic multiplayer action is guaranteed for all ages! Some of the included mini-games require pure reaction, so the younger you are the better, while other mini-games require knowledge of countries in the world and puzzle-solving skills. Who can be the best in all of them?\n\nLOTS OF DYNAMIC MINIGAMES \nThere are 28 mini-games included (more soon!), and they span all sorts of areas. For example: Who can find the sad face in a group of smiley faces? Does the shown capital city really belong to the country? Can the mouse navigate the maze to the cheese? Hit when the screen turns white! When is the changing labyrinth completed from corner to corner? Has the Countdown hit Zero? React when the Tic-Tac-Toe game is complete! And there's many more!\n\nOLD-SCHOOL CLEAN GRAPHICS\nSporting super-clean and slick graphics, 4 Player Reactor doesn't try to overwhelm or distract you with fancy effects or big explosions.This also means it runs on even the oldest and crankiest of Android devices! Everything in the game has been tested on all kinds of screens, and it runs beautifully on tablets!\n\nSETTINGS TO SUIT EVERYONE\nThere's a no-brainer &quot;Quick Game&quot; mode that allows you to jump right into the action. But if you hate math, or you only want to play that mode with the smiley faces, or you want a really really long game, you can change everything in the advanced settings menu! And if you're trying to learn a different language, we've got you covered: The game has been translated into 25 mysterious languages such as German, French, Chinese, Persian, Finnish, and many many more.\n\nINDIE GAME DEVELOPER LOVES YOU\nI'm an independent game developer and made the game all by myself - which explains the basic graphics (I like to think of them as clean ;)). I hope you like my game, and I totally crave your feedback, just send me an email at &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;e79588858e89a78488888b848f8295959e9395828294c984888ac9&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\nWHAT OTHERS SAY\n&quot;Best of its Kind&quot; - bestappsmarket.com\n&quot;If you have a spare 10 minutes and you are with someone you love, then 2 Player Reactor may well be the best thing you can do together standing up while holding a phone.&quot; - t3.com\n&quot;Best Software Award 2011&quot; Winner in the Arcade Category - Handster.com\n\nWhat's New:\n\nv1.94:\n* New mode: Fitting Ball\n* New language: Swedish\n* Fixes for Czech language\n* Fixes for Jelly Bean (Flags &amp; Mouse Maze)\n\nMore info:\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=coolcherrytrees.games.reactor4&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=coolcherrytrees.games.reactor4&lt;/a&gt;\n","torrent":{"xt":"urn:btih:0227b6e5c17896ec9d232fdeae491c8265d03ce2","amp;dn":"4+Player+Reactor+%28Multiplayer%29+v1.94+%5BPD%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0227b6e5c17896ec9d232fdeae491c8265d03ce2","infoHashBuffer":{"type":"Buffer","data":[2,39,182,229,193,120,150,236,157,35,47,222,174,73,28,130,101,208,60,226]},"announce":[],"urlList":[]}}