{"title":"Alex Jones interviews Jesse Ventura and Willie Nelson","uid":5938597,"size":280337760,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:02b69e18a3934461a97861ae5d92bd76e0c2373a&amp;dn=Alex+Jones+interviews+Jesse+Ventura+and+Willie+Nelson&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"metamyst","files":1,"time":1289054374,"description":"Alex talks with country music icon Willie Nelson and former Governor of Minnesota Jesse Ventura.\n\nVentura begins by discussing the insanity behind airport security, before Willie and Alex discuss the death of JFK, and the deathbed confession of CIA section chief E. Howard Hunt, who admitted to playing a role in the assassination. The trio then talk about how the media brainwashes the public to make men and women lose confidence in themselves by discriminating against their appearance.\n\nVentura and Alex delve into how the establishment contrives and manufactures smears to try and discredit people politically, with Jesse relating the tale of how he was accused of jumping up on a table in a strip club.\n\nMoving on to 9/11, Ventura talks about the deliberate confiscation of evidence at the World Trade Center site, as well as the hero first responders and firefighters who are now dead or dying as a result of the government's cover-up in claiming that the toxic air was safe to breathe. Ventura highlights how emergency workers found three of the four black boxes from the hijacked planes but were then blown away when the 9/11 Commission announced that no boxes whatsoever were found.\n\nWill the American people ever wake up? We'll wake the mother****ers up, proclaims Willie, but Jesse thinks they'll just go back to sleep again. Ventura points out that his generation, from the Vietnam era, are supposed to be in charge today, but have gone back on every single principle they once embraced. The start of the real revolution will only occur when Americans stop reinforcing the two party dictatorship by voting in Democrats and Republicans, points out Ventura. Ventura talks about potentially running for President himself in the future, and how he continually received death threats as Governor.\n\nThe video ends with footage from Willie's closing event at the Backyard in Texas, along with more interviews with Ventura and country music star Jimmie Vaughan. ","torrent":{"xt":"urn:btih:02b69e18a3934461a97861ae5d92bd76e0c2373a","amp;dn":"Alex+Jones+interviews+Jesse+Ventura+and+Willie+Nelson","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02b69e18a3934461a97861ae5d92bd76e0c2373a","infoHashBuffer":{"type":"Buffer","data":[2,182,158,24,163,147,68,97,169,120,97,174,93,146,189,118,224,194,55,58]},"announce":[],"urlList":[]}}