{"title":"Baby Mama(2008)DVDRip.AC3(ENG)-DROCK","uid":6078624,"size":737427456,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:02d2efbe9072159bbd983169a4dfe0b84b0d34c4&amp;dn=Baby+Mama%282008%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"drock232","files":-1,"time":1294000636,"description":"Former Saturday Night Live &quot;Weekend Update&quot; co-anchors Tina Fey and Amy Poehler co-star in this baby-fever comedy about a single, career-oriented woman who previously put parenthood on hold, and is forced to hire a surrogate mother when she discovers there is only a one-in-a-million chance that she will be able to get pregnant. Kate Holbrook (Fey) is a 37-year-old business executive who has always put her professional life before her personal life, but these days her biological clock is ticking louder than ever before. As with everything else she has accomplished in life, Kate is determined to have a child on her own terms. Unfortunately for Kate, the chance of her ever becoming pregnant is slim to none. Undaunted, a willful Kate drafts South Philly working-class girl Angie Ostrowiski (Poehler) -- a woman who may just be her polar opposite -- to be a surrogate mother. Subsequently informed by the head of the surrogacy center (Sigourney Weaver) that her surrogate is indeed pregnant, the excited mother-to-be soon purchases every child-rearing book she can find and excitedly begins the nesting process. But life hasn't quit throwing Kate curveballs just yet, because when a pregnant Angie shows up on her doorstep with no place to live, the woman who once thrived on order finds her life descending into chaos. Now, as Kate attempts to transform Angie into the ideal expectant mother, this odd couple will discover that families aren't always biological, but occasionally formed through friendship as well. Writer Michael McCullers, who authored the screenplays for Austin Powers: The Spy Who Shagged Me and Undercover Brother in addition to working on Saturday Night Live, makes his feature directorial debut with a self-penned screenplay.\n\nRipped with DVD Decrypter and Autogk.","torrent":{"xt":"urn:btih:02d2efbe9072159bbd983169a4dfe0b84b0d34c4","amp;dn":"Baby+Mama%282008%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02d2efbe9072159bbd983169a4dfe0b84b0d34c4","infoHashBuffer":{"type":"Buffer","data":[2,210,239,190,144,114,21,155,189,152,49,105,164,223,224,184,75,13,52,196]},"announce":[],"urlList":[]}}