{"title":"Lament of the Lamb Manga","uid":6909607,"size":249422325,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:0359aa427864301a387ff5fcad4f2c05e7fa7be0&amp;dn=Lament+of+the+Lamb+Manga&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"}{enShin","files":7,"time":1324735021,"description":"Original Title:Hitsuji no Uta\n\nLanguage:English\n\nSynopsis\nThe members of the Takashiro family share a terrible curse -- they have a thirst that only human blood can slake. Sent away after the death of this mother, Kuzuna Takashiro has long been blissfully unaware of his 'condition.' When Kazuna's teenage hormones begin to rage, his uncontrollable bloodlust suddenly rears its head ... (Source: Tokyopop)\n\nUser Review from myanimelist.net\n\nI was pleasantly surprised at how much I enjoyed this manga. I'm actually not that fond of horror or depressing series, but I picked it up because in a recc it mentioned vampires.\n\nI'm not quite sure how to review this, to be honest. There's just something about the story that draws you in and doesn't let you go until the end. I think the story is fabulous; it keeps a nice steady pace throughout the volumes, never speeding up to the point where you find yourself at a loss as to what's going on, or lagging too much and causing disinterest.\n\nThe art is beautiful. Not your typical shoujo or shounen styles; more like something out of an older horror book. It's absolutely lovely. Chizuna looks almost like a painted doll in some of the frames; like something that doesn't quite belong where she is.\n\nThe character development is also quite good for a seven volume manga. Granted, they start out as pretty interesting characters, but as you read further you end up pulling back even more layers and discovering how complex they really are.\n\nAs for enjoyment value, I was completely enthralled for the entire series. It was positively delightful, keeping you interested and wondering about what was going to happen next. I'll probably re-read the story several times within the next few months or so.\n\nOverall, the story was a delightful ride. In fact, I enjoyed it so much that I am probably going to go and purchase the books now, since I would enjoy having a hard copy of this. If you are a fan of psychological conditions and bittersweet endings, I would totally recommend it to you.\n","torrent":{"xt":"urn:btih:0359aa427864301a387ff5fcad4f2c05e7fa7be0","amp;dn":"Lament+of+the+Lamb+Manga","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0359aa427864301a387ff5fcad4f2c05e7fa7be0","infoHashBuffer":{"type":"Buffer","data":[3,89,170,66,120,100,48,26,56,127,245,252,173,79,44,5,231,250,123,224]},"announce":[],"urlList":[]}}