{"title":"Mahanagar-The Big City (1963)-BDrip-Criterion Collection-AVC.108","uid":8870050,"size":4702430694,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:03af192bca328f28e29a8ab14e8f2a2182f29230&amp;dn=Mahanagar-The+Big+City+%281963%29-BDrip-Criterion+Collection-AVC.108&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"SaM","files":-1,"time":1377994699,"description":"                           \n   Digital Desi Releasers  \n                           \n      Proudly Presents    \n\n\nMahanagar - The Big City (1963) - BDrip - Criterion Collection - AVC.1080p.LPCM - 4.38GB - [DDR] \n\n(A film by Satyajit Ray)\n\n\n\n\n\nTech Specifications: &lt;a href=&quot;\nhttp://imageshack.us/a/img198/5657/2nd7.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imageshack.us/a/img198/5657/2nd7.png&lt;/a&gt;\n\n\n\nScreenshots: &lt;a href=&quot;\nhttp://postimg.org/image/lrwff86a7/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.org/image/lrwff86a7/&lt;/a&gt; &lt;a href=&quot;\nhttp://postimg.org/image/nrd16n0lr/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.org/image/nrd16n0lr/&lt;/a&gt; &lt;a href=&quot;\nhttp://postimg.org/image/cdlwhp0pb/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.org/image/cdlwhp0pb/&lt;/a&gt; &lt;a href=&quot;\nhttp://postimg.org/image/p8yhi75cf/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.org/image/p8yhi75cf/&lt;/a&gt; &lt;a href=&quot;\nhttp://postimg.org/image/hrpa2zftb/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.org/image/hrpa2zftb/&lt;/a&gt; &lt;a href=&quot;\nhttp://postimg.org/image/52uzjb9ov/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.org/image/52uzjb9ov/&lt;/a&gt;\n\n\n\nSynopsis:\nArati (Madhabi) is a traditional housewife in a family consisting of her husband Subrata/Bhombol (Anil Chatterjee), her in-laws Priyogopal (Haren Chatterjee) and Sarojini (Shefalika), her sister-in-law Bani (Jaya Bhaduri) and her son Pintu (Prasenjit Sarkar). Subroto is a clerk in a bank and money is tight. In desperation, she breaks tradition and takes up a job as a salesgirl. As she grows to like her job and starts earning, she also starts facing hostility at home. Then Subrata, who was her great support, loses his job and as the family becomes dependant on her earnings, he too starts developing a complex. Then one day one of her colleagues, Edith, is dismissed. Her boss insinuates that she is of loose moral character. Arati protests and resigns her job. The family is in severe distress, but Arati and Subrata decide that they will face the crisis together.\n\n\n\nComments:\nBased on a novella &quot;Abataranika - Descent, 1949&quot; by Narendranath Mitra, Mahanagar is the story of a woman breaking out of the traditional boundaries of hearth and home. It is the 1950's and an increasing number of middle class housewives had started to go out for work. Yet old prejudices die hard. Ray brings out the dilemma of that period of transition superbly with a level of sensitivity that is marvellous. But Mahanagar is not just a story of change. Its also a brilliant study of humans who are caught in the throes of a society that is changing its mores. If Arati has broken tradition, she is also full of guilt. Her husband may let her work because of economic necessity, but he is also deeply disturbed and it seems to hurt his manhood. The film has a memorable character in Priyogopal, the old man who was once an idealistic teacher but is now living in a world where he is no longer relevant. This theme would recur again in Ray's later films such as &quot;Pikoo&quot; and &quot;Jana Aranya&quot;. Another lesser noticed aspect of this film is Ray's sensitive handling of racism. Edith is stereotyped and discriminated against and only Arati can stand up and protest.\n\nActing is brilliant. It is Madhabi's film and she dominates in a Director backed role. She is at once brave, inteliigent and morally strong but she is also vulnerable and consumed with guilt. She walks away with the film. This and Charulata would make her reputation as the quintessential &quot;Ray Woman&quot;. But spare a though for two actors. Anil Chatterjee is the quintessence bhadralok and his anguish is brought about in a marvelously restrained piece of acting. Haren Chatterjee as Priyogopal is a revelation as he portrays his emotional vulnerability and his inability to face social change. Jaya Bhaduri makes her debut in this film\n\nI have always loved Mahanagar. The film is lyrical but acutely observant. Each character could be someone you know. Each character becomes a symbol of oppression of Arati's fight for freedom and dignity - even her son Pintu, who shamelessly tries to get toys, playing on her sense of guilt. It may be based in the 1950's, but the film still has relevance. Arati's battles are fought even today. Perhaps the milieu has changed, but humans essentially remain the same.\n\n\n\n\nUploader's Notes:\nAs promised, this is the rip of the Criterion Collection Blu-Ray. Its a full 1080p rip and I have preserved the LPCM audio. The size of the rip is 4.38GB (1DVD) of which the audio itself is more than 1.1GB! Subtitles in English are available in SRT format. As requested by many downloaders, they are provided separately.\n\nWhen you see the rip, you will find it just a little bit grainy. The grain was there in the original Blu-Ray print itself. I have reduced the extent of grain, but not eliminated it, so that you get the feel of the original print. Besides I think the grain was kept deliberately. Except for a small amount of sharpening and a bit of highlighting of shadows, I have kept the original feel of the print intact.\n\nI think it is a good rip. The picture quality on your TV should be around 90% of the original Blu-Ray. Obviously, if you are compressing the original 28.2 GB into one seventh its size, there would be some quality loss. I've tried to minimize the degradation. Let me know what you think of the result. \n\n\n\n\n\n","torrent":{"xt":"urn:btih:03af192bca328f28e29a8ab14e8f2a2182f29230","amp;dn":"Mahanagar-The+Big+City+%281963%29-BDrip-Criterion+Collection-AVC.108","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03af192bca328f28e29a8ab14e8f2a2182f29230","infoHashBuffer":{"type":"Buffer","data":[3,175,25,43,202,50,143,40,226,154,138,177,78,143,42,33,130,242,146,48]},"announce":[],"urlList":[]}}