{"title":"Ike Quebec - 1961 - Heavy Soul (1995) FLAC","uid":9126053,"size":289742105,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:04e3fa5023e66e7195c096be79117cd8de6bd149&amp;dn=Ike+Quebec+-+1961+-+Heavy+Soul+%281995%29+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eika256","files":-1,"time":1383228840,"description":"Ike Quebec - 1961 - Heavy Soul (1995)\n\nOn receiving this album for annotation I checked through the principal jazz history books for references to Ike Quebec. I was appalled by what I found--or rather by what I failed to find. This incontestably superior musician has been almost totally ignored in the chronicling of the musical form to which he has contributed so much.\nI was about as guilty as the rest, for in The Book Of Jazz he is referred to only in a footnote, along with a dozen other tenor saxophonists. This inexcusable lapse was at least partly compensated in The New Encyclopedia of Jazz, which includes the following biographical entry:\nQUEBEC, IKE ABRAMS, tenor sax; b. Newark, N.J., 8/17/18. Formerly a dancer and pianist, he started on tenor 1940 with Barons of Rhythm; later worked with Frankie Newton, Hot Lips Page, Roy Eldridge, Trummy Young, Sunset Royals, Ella Fitzgerald, Benny Carter, Coleman Hawkins. Worked for Cab Calloway off and on from 1944 to '51. Only sporadically active during the '50s. Quebec was a superior tenor man of the Hawkins school with a big tone and firm, vigorous style. Favorites: Hawkins, Webster, Getz. Recorded for Blue Note 1959, released on 45 r.p.m.\nThis elliptical summation of Ike's career tells less than the whole story, of course. Like many musicians of his generation, he had frustrations and disappointments. Basically trained as an orchestral musician as well as a featured soloist, he found himself less in demand as the big-band era began to fade. Although the economic problems were considerable toward the end of the Cab Calloway years and afterward, my reference to Ike in the past tense, as if his career had folded up altogether, was out of order. Though he has been in comparative obscurity, he was never forced to turn to house-painting, carpentry or cab-driving as a livelihood. Music was and still is his profession and his life; the 45s cut and released on Blue Note a little while back were a significant reminder.\nIke had always kept in touch with Alfred Lion through the lean years, and Lion had always had in mind the possibility of launching a full-scale comeback for this remarkable artist. As he says, &quot;The 45 singles were a sort of trial baloon, and I was delighted to find not only that many people still remembered Ike, but also that those who didn't know about him were amazed and excited by what they heard. So recently I decided to jump into a full album session with new material, to give Ike a complete new start.&quot;\nThe 45 singles were by no means Ike's first recordings for Blue Note. Back in the 1940s there had been a series of 10-inch 78s (including an album) and a couple of 12-inch 78s, all of them featuring hand-picked swing-style groups with Ike as leader. Loyal Blue Noters from those days will surely recall such sides as &quot;She's Funny That Way,&quot; &quot;Cup Mute Clayton&quot; (for Buck, of course), and &quot;Blue Harlem.&quot; There was even a 78 r.p.m. album of six of the best numbers, such as &quot;If I Had You,&quot; &quot;Dolores,&quot; &quot;Topsy,&quot; etc.\nAlthough these sides belong to a pre-LP era and are unknown to the young record collector of the 1960s, they were among the most warmly received performances of their day and constituted the most important factor in establishing Ike at the time, among the more discerning connoisseurs, as a tenor man with something of his own to say. Though it is true that he is, in a general sense, a member of the Coleman Hawkins school, it is no less evident that the leading students of the pioneer Hawkins style and sound all developed firm personalities of their own. As Hawk himself has pointed out, Chu Berry's sound was easily distinguishable from his own, even though at the time of Chu's emergence his image was virtually that of a Hawkins twin.\nThe same evaluation applies, of course, in the case of Ike and several other major tenor men who came up in the 1930s. This was a period when, unless you happened to be a Bud Freeman man, there was no path to follow but Hawkins'. He set the pace rhythmically, tonally and melodically; he was even responsible for the very concept of playing a ballad on tenor sax, for before Hawk's time ballad jazz was a rarity. Ike's slow-tempo items in this set are a direct outgrowth of that trend.\nThe heavy dues that Ike has paid are reflected poignantly in the heavy soul that gave this album not only its title but its raison d etre. I hope this new perspective of the contribution Ike Quebec has made to jazz will help to bring a little lightness to his soul and much more recognition to his name.\n\nTrack list:\n01 - Acquitted\n02 - Just One More Chance\n03 - Que's Dilemma\n04 - Brother Can You Spare A Dime\n05 - The Man I Love\n06 - Heavy Soul\n07 - I Want A Little Girl\n08 - Nature Boy\n09 - Blues For Ike\n\nPersonnel:\nIke Quebec (tenor saxophone)\nFreddie Roach (organ)\nMilt Hinton (bass)\nAl Harewood (drums)\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:04e3fa5023e66e7195c096be79117cd8de6bd149","amp;dn":"Ike+Quebec+-+1961+-+Heavy+Soul+%281995%29+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04e3fa5023e66e7195c096be79117cd8de6bd149","infoHashBuffer":{"type":"Buffer","data":[4,227,250,80,35,230,110,113,149,192,150,190,121,17,124,216,222,107,209,73]},"announce":[],"urlList":[]}}