{"title":"Men of Wealth: The Story of Twelve Significant Fortunes from the","uid":8650915,"size":3029862,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:057eccee9d0ebfd3c839f30be0efc9a9c744df7c&amp;dn=Men+of+Wealth%3A+The+Story+of+Twelve+Significant+Fortunes+from+the&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Djofullinn","files":1,"time":1373101101,"description":"Men of Wealth; The Story of Twelve Significant Fortunes from the Renaissance to the Present Day [EPUB]\n\nNY: Simon and Schuster, 1941. \n\nThis book reminds us what a remarkable writer and journalist John T. Flynn truly was. It is a first-class business history, by any standard. It is the story of great fortunes made by the most notable men of wealth in history: Jacob Fugger, John Law, Nathan Rothschild, Thomas Gresham, Robert Owen, Cornelius Vanderbilt, and all the way through J.P. Morgan and J.D. Rockefeller.\n\nBut there is a special twist to the story: the author understands economics and the state, so he has a special eye for ferreting out the difference between market means and unjust means of acquiring wealth. The stories are all fascinating and the prose is impeccable.\n\nTruly, one is tempted to say that this book is a masterpiece, and it certainly should be a staple in business economics. The tragedy that this 1941 book was ever out of print is mitigated by this wonderful new edition from the Mises Institute.\n\nWhat gave rise to such an amazing treatise? It was the New Deal itself. As an old-time progressive, Flynn was scandalized by the extent of the involvement of large corporate America in the regimentation of FDR. He knew what so many &quot;liberals&quot; refused to face: the New Deal was really a version of corporate fascism dressed up in the guise of populist economic policy.\n\nThis fact made Flynn curious about the relationship between the state and the rich throughout history. Rather than merely bemoan events, he got to work on this research project. He discovered that it was always complicated: the wealthier classes have been entrepreneurial in both great and evil ways. He illustrates how in these biographical essays, which teach history in light of 20th century economic events.\n\nThis book is also a reminder of what remarkable journalists were once working and writing in this country. Flynn manage to combined scholarship, economic understanding, mature analytics, and a dashing style to create an irresistible package.\n &lt;a href=&quot;\nhttp://www.amazon.com/Significant-Fortunes-Renaissance-Present-Reprint/dp/0836920473/ref=sr_1_2?ie=UTF8&amp;qid=1373093453&amp;sr=8-2&amp;keywords=Men+of+Wealth%3A+The+Story+of+Twelve+Significant+Fortunes+from+the+Renaissance+to+the+Present+Day&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Significant-Fortunes-Renaissance-Present-Reprint/dp/0836920473/ref=sr_1_2?ie=UTF8&amp;qid=1373093453&amp;sr=8-2&amp;keywords=Men+of+Wealth%3A+The+Story+of+Twelve+Significant+Fortunes+from+the+Renaissance+to+the+Present+Day&lt;/a&gt; \n\n","torrent":{"xt":"urn:btih:057eccee9d0ebfd3c839f30be0efc9a9c744df7c","amp;dn":"Men+of+Wealth%3A+The+Story+of+Twelve+Significant+Fortunes+from+the","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"057eccee9d0ebfd3c839f30be0efc9a9c744df7c","infoHashBuffer":{"type":"Buffer","data":[5,126,204,238,157,14,191,211,200,57,243,11,224,239,201,169,199,68,223,124]},"announce":[],"urlList":[]}}