{"title":"An Introduction to Nuclear Materials","uid":12690854,"size":10783404,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:07012290383f91730dddc800a6c6ba356ca2825d&amp;dn=An+Introduction+to+Nuclear+Materials&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1446670506,"description":"An Introduction to Nuclear Materials - Fundamentals and Applications (Wiley-VCH, 2013).pdf\r\n\r\nISBN 9783527412013\r\n\r\nCovering both fundamental and advanced aspects in an accessible way, this textbook begins with an overview of nuclear reactor systems, helping readers to familiarize themselves with the varied designs. Then the readers are introduced to different possibilities for materials applications in the various sections of nuclear energy systems. Materials selection and life prediction methodologies for nuclear reactors are also presented in relation to creep, corrosion and other degradation mechanisms. An appendix compiles useful property data relevant for nuclear reactor applications.\r\n\r\nThroughout the book, there is a thorough coverage of various materials science principles, such as physical and mechanical metallurgy, defects and diffusion and radiation effects on materials, with serious efforts made to establish structure-property correlations wherever possible. With its emphasis on the latest developments and outstanding problems in the field, this is both a valuable introduction and a ready reference for beginners and experienced practitioners alike","torrent":{"xt":"urn:btih:07012290383f91730dddc800a6c6ba356ca2825d","amp;dn":"An+Introduction+to+Nuclear+Materials","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07012290383f91730dddc800a6c6ba356ca2825d","infoHashBuffer":{"type":"Buffer","data":[7,1,34,144,56,63,145,115,13,221,200,0,166,198,186,53,108,162,130,93]},"announce":[],"urlList":[]}}