{"title":"Billi 99","uid":8734115,"size":54904081,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:07545f984ace1162b0271746f7be1011fe746b5e&amp;dn=Billi+99&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1374652389,"description":"In honor of the release of the third Grendel Omnibus, here's something else from the great Tim Sale.\n\n----------------------------------------------------------------------------------------\n\n'Billi 99'\n\nDark Horse Mavericks, 2002, 200 pages\n\nWritten by Sarah Byam\n\nIllustrated by Tim Sale\n\nWorld War III hit, and nobody noticed. Lost amidst the crooked politicians and corrupt corporate practices of the late 20th century, the American Dream became polluted and drowned out, replaced instead with an ever-growing chasm between the &quot;haves&quot; and &quot;have-nots.&quot; No one is more aware of this than Billi Chadam. Daughter of honest industrialist Ray Chadam and heiress to the multi-billion dollar Chadam International empire, Billi finds herself in a whirlpool of murder and corporate espionage, framed for her father's death, and on the run from those who are supposed to be her allies. But Billi has a secret, one she shared with her father before he was taken from her. By night Billi dons the mask of the Sword of Toleado, a sword-wielding vigilante bringing hope to the oppressed and striking fear in the oppressors. There's more to saving her city than sword-waving heroics can accomplish, though, and before the tensions between her company's employees and the city's on-the-take police force reach a boiling point, Billi must set the balance right, no matter what the cost.\n","torrent":{"xt":"urn:btih:07545f984ace1162b0271746f7be1011fe746b5e","amp;dn":"Billi+99","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07545f984ace1162b0271746f7be1011fe746b5e","infoHashBuffer":{"type":"Buffer","data":[7,84,95,152,74,206,17,98,176,39,23,70,247,190,16,17,254,116,107,94]},"announce":[],"urlList":[]}}