{"title":"Amory Wars v2","uid":4747173,"size":55187212,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:08584e7e3a0ea3d86627f2ca056967216214562f&amp;dn=Amory+Wars+v2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gilgamesh07","files":6,"time":1235941970,"description":"Ladies and Gentlemen, this torrent contains Image Comics' The Amory Wars v2 in it's entirety.\n\n\nThe Amory Wars, originally called the Bag.On.Line Adventures, is a series of comic books written by Coheed and Cambria frontman Claudio Sanchez and published by Evil Ink Comics. The storyline used in The Amory Wars is also the focus of the band's music, each album released by the band representing a corresponding chapter in the four part science fiction concept originally narrated by Sanchez's lyrics.\nThe Amory Wars takes place in Heaven's Fence, a collection of 78 planets held in place by interconnecting beams of energy, known as the Keywork. The story revolves around the messianic Claudio Kilgannon, son of Coheed Kilgannon and Cambria Kilgannon. Over the course of the story, Claudio assumes the mantle of The Crowing, foretold savior of the Heaven's Fence universe. In the end, he must face the &quot;Supreme Tri-mage&quot; Wilhelm Ryan, absolute ruler of Heaven's Fence and the one ultimately responsible for the death of Claudio's family.\n\nList of characters in The Amory Wars\n \nCoheed Kilgannon - Husband of Cambria and harbors the Monstar virus, which, when triggered, causes the cooling of the star transformers that hold planets in the Keywork. Previously a member of K.B.I. He possesses blades in his left arm and can transform his right into a gun. \n\nCambria Kilgannon - Wife of Coheed, and possesses some type of psychic or clairvoyant ability. Previously a member of K.B.I. \n\nClaudio Kilgannon - Son of Coheed &amp; Cambria and the only known survivor of his family. He has met his 'uncle' Jesse and together the two plan to destroy Heaven's Fence and kill Wilhelm Ryan. The Prise Ambellina educates Claudio that he is also The Crowing, a messiah who will save the souls of the Keywork by destroying it, however he is not willing to accept this fate until the climax of GAIBS-IV Volume One. \n\nJesse Kilgannon - Although commonly referred to as Coheed's 'brother', Jesse (like Coheed) is an IRO-bot. Created in a visual likeness of Dr. Hohenberger. Jesse is leading the war against Wilhelm Ryan as the leader of the rebels. He was created with the purpose to destroy Wilhelm Ryan, and continues to fight until the day he dies. The third member of K.B.I., he narrates the story of The Amory Wars. \n\nMariah Antillarea - Originally believed to be the Messiah, Mariah is the leader of a rebellion against Wilhelm Ryan. She is also married to Jesse Kilgannon. \n\nAmbellina - A Prise. Ambellina burns her wings off at the order of the other Prise so as to be more Human. She is sent to guide Claudio Kilgannon to his destiny as The Crowing. Like the rest of the Prise, her mission was to watch over the Keywork, and see that God's will was carried out. She is based upon the character Erica Court and represents the good and pure side. \n\nWilhelm Ryan - The Supreme Tri-Mage of the Keywork. He gained control of the Keywork during the Mage Wars, where he claimed dominion over the other Mages. He knew of Mariah and used Coheed and Cambria to destroy her. When his plan failed, he killed her himself. He now fights the rebel army who is being led by Jesse (Inferno). \n\nThe Writer - Also referred to as The Writing Writer, the issues in his own life make him see delusions that cause him to take out his own suffering on the characters in his story. The story gets darker as his own problems grow. He doesn't want The Character (Claudio) to feel the same pain that he has, so he interferes with the story. He sees the visions of Ten Speed who manipulates his thinking. \n\nTen Speed - The manifestation of The Writer's ill will and malice which takes the form of his 10 speed bicycle. Ten Speed convinces the Writer that he needs to kill off Ambellina in order to end the story. If Ambellina is dead, Claudio will believe he is the Crowing and destroy the Keywork. \n\nErica Court - The Writer's former lover, for whom he is writing the story of Heaven's Fence that is causing him to descend into madness. It is also hinted that The Writer once asked Erica Court to marry him (The Suffering). The Writers madness also appears when he has a vision of himself in a grosteque form killing Erica Court (Welcome Home). Erica is represented multiple times within the story, at one point in the guise of Newo Ikkin (The bad, evil side), and at another point as Ambellina (The good, pure side) the fallen Prise. \n\nJosephine Kilgannon - Claudio's sister who is murdered at the hands of her parents \n\nLove it or hate it, this was an interesting comic complete with apparent release delays and a limited but passionate following. \n\nThanks to the scanners and the original sources who wish to remain nameless.\n\nPlease seed. Please enjoy. ","torrent":{"xt":"urn:btih:08584e7e3a0ea3d86627f2ca056967216214562f","amp;dn":"Amory+Wars+v2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08584e7e3a0ea3d86627f2ca056967216214562f","infoHashBuffer":{"type":"Buffer","data":[8,88,78,126,58,14,163,216,102,39,242,202,5,105,103,33,98,20,86,47]},"announce":[],"urlList":[]}}