{"title":"Quran Reader For Black Berry","uid":8110246,"size":846568,"categoryP":"applications","categoryS":"handheld","magnet":"?xt=urn:btih:0943e990512782e7a809a80091bfde55c94e5250&amp;dn=Quran+Reader+For+Black+Berry&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"qraanTV","files":-1,"time":1360173095,"description":"Studying the Quran is an essential part of Muslim life but what about those times when you can't get near a mosque or are on the road?\n\nStep forward Quran Reader, a mobile application that lets you read the sacred texts while you're on the move using your PDA or phone.\nYou'll need the Java Runtime Environment installed on your device, but aside from ensuring this is present, the setup-up process is a pretty straightforward one.\n\nOnce installed, there are all manner of features at your disposal to help you improve your knowledge of the Quran. For instance, you can set and retrieve bookmarks, highlight verses with a subtle green colour, and there's three levels of zoom available in case you're eyesight isn't up to scratch.\nQuran Reader includes all 114 Suren of the Holy Scriptures in Arabic, English, Urdu and Farsi. You don't even need Arabic, Urdu or Farsi support on your handheld to read it, as it works straight out-of-the-box.\nUnfortunately this free version doesn't support other languages like French or German.\n\nIf you travel around a lot and wish you had more time to study the Scriptures then Quran Reader is ideal.","torrent":{"xt":"urn:btih:0943e990512782e7a809a80091bfde55c94e5250","amp;dn":"Quran+Reader+For+Black+Berry","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0943e990512782e7a809a80091bfde55c94e5250","infoHashBuffer":{"type":"Buffer","data":[9,67,233,144,81,39,130,231,168,9,168,0,145,191,222,85,201,78,82,80]},"announce":[],"urlList":[]}}