{"title":"El Imperio de los Dragones - Valerssimo Menfreni [Epub][Spanish]","uid":6916770,"size":473916,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:09689ef99999d2e313a4d2d28748738c5e54f365&amp;dn=El+Imperio+de+los+Dragones+-+Valerssimo+Menfreni+%5BEpub%5D%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"virana","files":-1,"time":1325060863,"description":"El Imperio de los Dragones - Valerio Massimo Manfredi \n\nEsta es la primera novela que leo de Manfredi, y tengo un par de emociones encontradas sobre este libro.\n\nLa historia inicia con la captura del emperador Valeriano por parte del rey persa Sapor quien le tiende una trampa y deja que muera en las minas de Aus Daiwa por el pÃƒÂ©simo trato que reciben los mineros del lugar.\n\nMarco Metelo Aquila, el personaje principal de esta novela es un comandante que acompaÃƒÂ±a, junto con una legiÃƒÂ³n, al emperador a la &quot;negociaciÃƒÂ³n&quot; con Sapor, quien termina igualmente prisionero (al igual que la legiÃƒÂ³n).\n\nLuego de pasar grandes calamidades y de conocer a Uxal, un viejo que hace las veces de ayudante y traductor de los persas, logran escapar y luego de llegar a un Oasis, conocen a Daruma, un comerciante que les ofrece protecciÃƒÂ³n a cambio de ayudarles con una persona con quien se tiene que reunir.\n\nCuando las esperanzas de Daruma se han desvanecido y decide abandonar el lugar a bordo de una embarcaciÃƒÂ³n, el misterioso personaje aparece perseguido por una gran cantidad de soldados persas que no logran atraparlo, ya que logra hacer una serie de proesas casi imposibles de realizar para un ser humano, al menos a los ojos de los legionarios romanos que se han convertido en la escolta de Daruma.\n\nEn fin, el personaje resulta ser Dan Qing, un prÃƒÂ­ncipe chino que habÃƒÂ­a estado en Persia, mÃƒÂ¡s que prisionero, engaÃƒÂ±ado de la situaciÃƒÂ³n de su paÃƒÂ­s, que ha caÃƒÂ­do en manos de un acÃƒÂ©rrimo enemigo de la dinastÃƒÂ­a reinante.\n\nLuego de enormes proezas, llegan a China y los legionarios se maravillan de las vastas zonas de tierra del lugar y de la extraÃƒÂ±a filosofÃƒÂ­a de las personas que habitan ahÃƒÂ­. Sin embargo, eso es sÃƒÂ³lo el comienzo de una gran serie de aventuras que les esperan a los legionarios y sobre todo a Metelo, quien termina siendo un gran amigo del emperador, pero tambiÃƒÂ©n un personaje odiado por el enemigo del principe Dan Qing.\n\nHasta la captira de Valeriano llega la parte histÃƒÂ³rica de la novela, que recupera, lejanamente el toque histÃƒÂ³rico al hablar de la LegiÃƒÂ³n perdida, que se instalÃƒÂ³ en el lugar y defendieron al gobernante chino de ese tiempo (315 aÃƒÂ±os antes de la llegada de Metelo y su legiÃƒÂ³n) y se convirtieron en ciudadanos de aquel maravilloso paÃƒÂ­s.\n\nQuÃƒÂ© decir del libro, es un libro interesante, casi como leer una pelÃƒÂ­cula, lo que me trajo a la memoria el libro Los Pilares de la Tierra por la forma de narrar las partes emocionantes como las batallas o las escenas romÃƒÂ¡nticas.\n\nTal vez sea eso, precisamente, lo que me ha hecho tener esos sentimientos encontrados, ya que disfrutÃƒÂ© de la historia, pero me quedÃƒÂ© con deseos de algo menos fantÃƒÂ¡stico y un tanto mÃƒÂ¡s real.\n\nEn fin, si leen el libro, vayan con la mentalidad de leer algo entretenido, mÃƒÂ¡s no necesariamente histÃƒÂ³rico\n","torrent":{"xt":"urn:btih:09689ef99999d2e313a4d2d28748738c5e54f365","amp;dn":"El+Imperio+de+los+Dragones+-+Valerssimo+Menfreni+%5BEpub%5D%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09689ef99999d2e313a4d2d28748738c5e54f365","infoHashBuffer":{"type":"Buffer","data":[9,104,158,249,153,153,210,227,19,164,210,210,135,72,115,140,94,84,243,101]},"announce":[],"urlList":[]}}