{"title":"Du Cerveau à Dieu (Science.Biologie.Meditation)","uid":14669475,"size":17929326,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:098f746e26b60ebe8815b5b70af9f9260fc55f81&amp;dn=Du+Cerveau+%26agrave%3B+Dieu+%28Science.Biologie.Meditation%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"asperge","files":2,"time":1463854190,"description":"Mario Beauregard - Du cerveau à Dieu : Plaidoyer d'un neuroscientifique pour l'existence de l'âme\r\nGuy Trédaniel | ISBN : 2813208051 | 2015-09 | PDF/DJVU | 437 pages | 10/6 MB\r\n\r\nPour tenter de répondre à cette épineuse question, le neuroscientifique Mario Beauregard a demandé à quinze Soeurs carmélite de prêter leur concours à une expérience scientifique. En examinant l'activité cérébrale de ces religieuses au cours de leur expérience mystique, il a découvert que les pratiques spirituelles ne sont pas reliées à une zone spécifique du cerveau, mais à plusieurs &quot;régions et systèmes cérébraux &quot; habituellement destinés à des fonctions telles que la perception, les émotions ou la conscience de soi. Il n'existe donc pas un unique &quot;point de Dieu &quot; dans notre cerveau, pas plus qu'il n'existe un &quot;gène de Dieu &quot; dans nos cellules. Par ailleurs, l'étroite corrélation des activités spirituelles et neurologiques ne signifie pas qu'il faille réduire l'expérience spirituelle à un simple phénomène cérébral ou à une illusion, voire une hallucination, dont l'unique socle serait de nature neuronale. Loin s'en faut : les expériences mystiques révèlent la capacité des individus à entrer en contact avec une force objectivement réelle, transcendantale, un au-delà d'eux-mêmes, du temps et de l'espace. D'où les nombreux phénomènes psychiques qui demeurent inexpliqués par la science, tels que les guérisons &quot;miraculeuses &quot;, l'effet placebo, les prémonitions, les expériences de mort imminente (EMI ou NDE), le sentiment d'union lors de la prière ou la méditation ... Salutaire, édifiant, ce livre s'écarte de la tendance générale des travaux de neurosciences en remettant en question l'idéologie matérialiste dominante. Il nous montre que si la science est incapable de prouver ou d'infirmer l'existence de l'âme, elle ne saurait pour autant persister à la nier","torrent":{"xt":"urn:btih:098f746e26b60ebe8815b5b70af9f9260fc55f81","amp;dn":"Du+Cerveau+%26agrave%3B+Dieu+%28Science.Biologie.Meditation%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"098f746e26b60ebe8815b5b70af9f9260fc55f81","infoHashBuffer":{"type":"Buffer","data":[9,143,116,110,38,182,14,190,136,21,181,183,10,249,249,38,15,197,95,129]},"announce":[],"urlList":[]}}