{"title":"How by Be Invisible by JJ Luna_2012 Edition","uid":7871906,"size":384055529,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:099621d15ed0f749221bdd126b7e10b5c1d316cf&amp;dn=How+by+Be+Invisible+by+JJ+Luna_2012+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"frobknob","files":2,"time":1354229968,"description":"This is actually a video of me scrolling through the pages of the book.  You can still read it, but you will have to use a video playing program (VLC is excellent and free).\n\nI obtained this book in .azw format--it's a proprietary format by Amazon for files able to be read on a Kindle or &quot;Kindle for PC&quot;, a program that lets you read a Kindle file on a computer.  I couldn't figure out how to crack the DRM to convert it to another format, so the best I could do was take a screen video of me scrolling through the pages.  \n\nI'm sure there's a way to take a screen capture of each page and make those image files into a PDF, but I haven't got the knowledge or time to do it.  Maybe someone will take this torrent, make a PDF, and share it here.\n\nIf you can buy this book, the author more than deserves the money for it.  This is THE bible for living a secure life in the United States.  But I wanted to share this for those who can't afford it.  The website is jjluna.com.\n\nINSTRUCTIONS: Open the video (.avi format) in a video player (I can only vouch for VLC Player) and to turn the page hit play and when you want to stop it to read, hit pause.  I've gone through the pages pretty fast, so anytime you want to turn the page, hit play, then quickly hit pause.\n\nNo malware or nasty stuff. Just the AVI video file of me scrolling through the pages of the book and a text file with this information in it.","torrent":{"xt":"urn:btih:099621d15ed0f749221bdd126b7e10b5c1d316cf","amp;dn":"How+by+Be+Invisible+by+JJ+Luna_2012+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"099621d15ed0f749221bdd126b7e10b5c1d316cf","infoHashBuffer":{"type":"Buffer","data":[9,150,33,209,94,208,247,73,34,27,221,18,107,126,16,181,193,211,22,207]},"announce":[],"urlList":[]}}