{"title":"Sex, Money, Happiness, and Death: The Quest for Authenticity","uid":6580898,"size":1066333,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:099722dea6eb11d9f17c0c4b7292969aadedddd4&amp;dn=Sex%2C+Money%2C+Happiness%2C+and+Death%3A+The+Quest+for+Authenticity&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_F1_","files":-1,"time":1312396410,"description":"Sex, Money, Happiness, and Death: The Quest for Authenticity\nHardcover: 264 pages\nPublisher: Palgrave Macmillan (May 12, 2009)\nLanguage: English\nISBN-10: 023057792X\nISBN-13: 978-0230577923\n\n'This book is the distillation of the life experiences of an internationally renowned guru of management and leadership studies. Combining insight with his signature wit, Kets de Vries cuts to the bone as he reflects on and gently guides executives, and others, through some of the core issues that bedevil our lives. A book that will linger in memory, creating ever-widening ripples, long after the ephemeral offerings of the usual management literature have disappeared.' - Dr. Sudhir Kakar, Psychoanalyst, Anthropologist, Novelist and one of the major thinkers of the world 'The art of understanding oneself is crucial to understanding others. Professor Manfred Kets de Vries' insight into our motivations and levels of emotional intelligence exposes the hidden fact that lies at the heart of business behaviour; namely that we are all human.' - The Viscount Rothermere, Chairman DMGT 'This book made me laugh, it made me feel uncomfortable sometimes, but I learned a lot. It makes the reader think about how much s/he can do - good and bad - to her/himself and to others in family, business and social life. With his free and easy style Kets de Vries lines up the latest findings of human science and gives examples of the highs and lows of real human life reminding us that we are in the driving seat. Seize the opportunity.' - Janos Csak, Economist, Sociologist, Chairman, Constellation Energy Institute","torrent":{"xt":"urn:btih:099722dea6eb11d9f17c0c4b7292969aadedddd4","amp;dn":"Sex%2C+Money%2C+Happiness%2C+and+Death%3A+The+Quest+for+Authenticity","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"099722dea6eb11d9f17c0c4b7292969aadedddd4","infoHashBuffer":{"type":"Buffer","data":[9,151,34,222,166,235,17,217,241,124,12,75,114,146,150,154,173,237,221,212]},"announce":[],"urlList":[]}}