{"title":"Chennai Express (2013) - Official Trailer - Shah Rukh Khan &amp;","uid":8570024,"size":53781546,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:09c60330e83af6b595c330c7fcf892ce9d15d4ed&amp;dn=Chennai+Express+%282013%29+-+Official+Trailer+-+Shah+Rukh+Khan+%26amp%3B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"samun.suman","files":-1,"time":1371128615,"description":"The explosive official trailer of Chennai Express starring Shah Rukh Khan and Deepika Padukone. This Eid, 8th August 2013, come fall in love, Rohit Shetty Shtyle!\n\n\nChennai Express is an upcoming 2013 Indian action comedy film directed by Rohit Shetty and produced by Gauri Khan under her production banner Red Chillies Entertainment.The film features Shahrukh Khan and Deepika Padukone in lead roles. This is the second collaboration between Khan and Padukone after the 2007 blockbuster Om Shanti Om and the first collaboration between Khan and Shetty. Chennai Express is about a man's journey from Mumbai to Rameshwaram and what happens along the way. Principal photography began on 27 September 2012.\n\n\n\nDevelopment - \n\nShah Rukh Khan and Rohit Shetty had originally planned to team up for a remake of the 1982 film Angoor. After Singham,Rohit Shetty had begun writing the script of the film but left it mid-way. Incidentally, he had the script of Chennai Express ready to be narrated to Shah Rukh as a back-up due to the difficulty of obtaining the actor's filming dates.Upon being narrated the script, Shah Rukh was impressed with the idea of Chennai Express and agreed to star in it before the Angoor remake. With this development, the remake of Angoor was pushed back.\n\nWhen Rohit was asked about the story of the film, he said, &quot;It's a hard-core commercial film with a romantic angle. The story is about this man's travel from Mumbai to Rameshwaram and what happens during the journey.\n\n\nCasting - \n\nShah Rukh Khan was the first actor to be approached with the script, and hence the first lead actor to be signed on to the film. Incidentally, Rohit stated that despite the title, Shah Rukh would not play the role of a South Indian in the film. The casting of the lead heroine was speculated for a good deal of time. Names such as Kareena Kapoor, Asin Thottumkal and Deepika Padukone were rumored by the media.In an interview, a visibly angry Shetty denied all rumors surrounding the leading heroine, stating that the cast would be finalized in April 2012 and that he was going to cast an established actress as the leading lady.  However, in August it was officially announced that Deepika Padukone had been signed to play the lead opposite Shah Rukh Khan.This would be her second film with Shah Rukh Khan oposite whom she made her Bollywood debut with in 2007 Blockbuster Om Shanti Om Principal photography began on 27 September 2012 and shooting started soon afterwards. Rohit Shetty wanted Manorama to play Deepika Padukone's aunt. Sathyaraj was later cast to play the role of Deepika's father and the main antagonist of Chennai Express.Actress Priyamani was signed in late January 2013 for an item number in the film.","torrent":{"xt":"urn:btih:09c60330e83af6b595c330c7fcf892ce9d15d4ed","amp;dn":"Chennai+Express+%282013%29+-+Official+Trailer+-+Shah+Rukh+Khan+%26amp%3B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09c60330e83af6b595c330c7fcf892ce9d15d4ed","infoHashBuffer":{"type":"Buffer","data":[9,198,3,48,232,58,246,181,149,195,48,199,252,248,146,206,157,21,212,237]},"announce":[],"urlList":[]}}