{"title":"The Best Ghost Stories by Arthur B Reeve and Joseph Lewis French","uid":7756195,"size":554647,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0a3ae027fcee6eb2d90e7d674bda9aa604cd74f2&amp;dn=The+Best+Ghost+Stories+by+Arthur+B+Reeve+and+Joseph+Lewis+French&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"republicV","files":4,"time":1351107613,"description":"Introduction: &quot;The fascination of the ghost story&quot;, by A. B. Reeve -- The apparition of Mrs. Veal, by D. De Foe -- Canon Alberic's scrap-book, by M. R. James -- The haunted and the haunters, by E. Bulwer-Lytton -- The silent woman, by L. Kompert -- Banshees -- The man who went too far, by E. F. Benson -- The woman's ghost story, by A. Blackwood -- The phantom rickshaw, by R. Kipling -- The rival ghosts, by B. Matthews -- The damned thing, by A. Bierce -- The interval, by V. O'Sullivan -- Dey ain't no ghosts, by E. P. Butler -- Some real American ghosts.\n\nWhat is the fascination we feel for the mystery of the ghost story?\n\nIs it of the same nature as the fascination which we feel for the\nmystery of the detective story?\n\nOf the latter fascination, the late Paul Armstrong used to say that it\nwas because we are all as full of crime as Sing Sing--only we don't\ndare.\n\nThus, may I ask, are we not fascinated by the ghost story because, no\nmatter what may be the scientific or skeptical bent of our minds, in our\ninmost souls, secretly perhaps, we are as full of superstition as an\nobeah man--only we don't let it loose?\n\nWho shall say that he is able to fling off lightly the inheritance of\ncountless ages of superstition? Is there not a streak of superstition in\nus all? We laugh at the voodoo worshiper--then create our own hoodooes,\nour pet obsessions...","torrent":{"xt":"urn:btih:0a3ae027fcee6eb2d90e7d674bda9aa604cd74f2","amp;dn":"The+Best+Ghost+Stories+by+Arthur+B+Reeve+and+Joseph+Lewis+French","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a3ae027fcee6eb2d90e7d674bda9aa604cd74f2","infoHashBuffer":{"type":"Buffer","data":[10,58,224,39,252,238,110,178,217,14,125,103,75,218,154,166,4,205,116,242]},"announce":[],"urlList":[]}}