{"title":"Mark O'Leary - On The Shore (2007)","uid":7185313,"size":387261586,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0b181b8bc0fef34f7905057b98db3ff9a62e0cdc&amp;dn=Mark+O%27Leary+-+On+The+Shore+%282007%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mariorg","files":-1,"time":1334409046,"description":"Clean Feed Records: CF091 &lt;a href=&quot;\nhttp://www.cleanfeed-records.com/disco2.asp?intID=221&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.cleanfeed-records.com/disco2.asp?intID=221&lt;/a&gt;\n\n* Mark O'Leary: electric guitar, 12 string acoustic guitars\n* Alex Cline: drums, percussion, shells, sticks, stones\n* Jeff Kaiser: trumpet\n* John Fumo: trumpet\n &lt;a href=&quot;\nhttp://www.markoleary.eu/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.markoleary.eu/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.jeffkaiser.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.jeffkaiser.com/&lt;/a&gt; &lt;a href=&quot;\nhttp://fumosonic.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://fumosonic.com/&lt;/a&gt;\n\nReview\n~~~~~~\nby Stef\n\nI have already praised Mark O'Leary before for his great sense of music, and he\nproves it again on this record, and how! With Alex Cline on drums and a double\ntrumpet front line consisting of Jeff Kaiser and John Fumo, the line-up is\ndefinitely unusual (apart from Jacek Kochan's &quot;Another Blowfish&quot;, with Eric\nVloeimans and Piotr Wojtasik on trumpet, I'm not aware of any other quartet with\na double trumpet front line). The music on this record is light, spacious,\nelegant, ... I would almost say the musical equivalent of high quality\nchampagne, very tasty, with bubbles, something to savour with every sip. The\nguitar plays a very prominent role on the whole CD, often with a very low tone,\nreminiscent of some of John Abercrombie's albums, but more avant-garde, more\ncreative, with the two trumpets and the drums adding shades of sound that bring\ndepth and sculptural relief to the music, even if they're pushed a little to the\nback in the sound editing, a nice touch which adds to the overall\natmosphere. The whole quartet is absolutely brilliant. Alex Cline's playing is\nprecise, accurate, accentuating loosely, performing the difficult feat of\ndrumming on music that is essentially without explicit rhythm. The two trumpets\nuse every shade and sound their instruments can produce, in various intensities,\nvolume changes and lengths, because there is mostly no melody to hear - texture,\ntonal changes and contrast is all there is, especially exemplified by the long\ntitle track. O'Leary himself gets every possible sound out of his guitar as\nwell, and whether it's plain acoustic, or one of the many effects on his\nelectric guitar, his playing is not focused on the playing itself but on the\nmusical moods he creates, and it's also coherent throughout the album,\nregardless of how he uses his instrument. O'Leary doesn't hesitate to push his\nfoot switches once in a while, bringing sorching fusion-like solos, pushing the\ntrumpets and the drums to high levels of intensity as in &quot;Point Sketch&quot;, but\nmost of the music is subdued, tentative, fragile, creating open-ended\nsoundscapes, composed with skill and feeling, building layers of music to create\na very distinct mood, which is nostalgic, sad, but also reverent, jubilant or\nmysterious at times.You can hear seagulls and whales, or even sirens, the surf\nin the distance","torrent":{"xt":"urn:btih:0b181b8bc0fef34f7905057b98db3ff9a62e0cdc","amp;dn":"Mark+O%27Leary+-+On+The+Shore+%282007%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b181b8bc0fef34f7905057b98db3ff9a62e0cdc","infoHashBuffer":{"type":"Buffer","data":[11,24,27,139,192,254,243,79,121,5,5,123,152,219,63,249,166,46,12,220]},"announce":[],"urlList":[]}}