{"title":"Anonymous - Meditations on the Tarot (pdf)","uid":8622242,"size":6309728,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0b7162d13cb25ef4bf95ad52cc378808048c60c2&amp;dn=Anonymous+-+Meditations+on+the+Tarot+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"pharmakate","files":-1,"time":1372407982,"description":"Anonymous (Valentin Tomberg; translated by Robert Powell; afterword by Cardinal Hans Urs von Balthasar) - Meditations on the Tarot: A Journey into Christian Hermeticism (Jeremy P. Tarcher, 2002). 670 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc. (Note: there's a scan on the internet of an older edition of this book, but this scan is of the newest edition.)\n\n\nA profound, but not easy to read, exploration of &quot;hermetic&quot; Christianity using the major arcana of the tarot as the launching point. Reading a single paragraph of this book makes me feel like I've entered another universe of spiritual truth.\n\n(Balthasar is probably the most important Catholic theologian of the past half century; he's usually regarded as a conservative, so his endorsement of this book is interesting and significant.)\n\ndescription:\n\nPublished for the first time with an index and Cardinal Hans Urs von Balthasar's afterword, this new English publication of Meditations on the Tarot is the landmark edition of one of the most important works of esoteric Christianity. Written anonymously and published posthumously, as was the author's wish, the intention of this work is for the reader to find a relationship with the author in the spiritual dimensions of existence. The author wanted not to be thought of as a personality who lived from 1900 to 1973, but as a friend who is communicating with us from beyond the boundaries of ordinary life.","torrent":{"xt":"urn:btih:0b7162d13cb25ef4bf95ad52cc378808048c60c2","amp;dn":"Anonymous+-+Meditations+on+the+Tarot+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b7162d13cb25ef4bf95ad52cc378808048c60c2","infoHashBuffer":{"type":"Buffer","data":[11,113,98,209,60,178,94,244,191,149,173,82,204,55,136,8,4,140,96,194]},"announce":[],"urlList":[]}}