{"title":"The Science of Mind: A Complete Course of Lessons in the Science","uid":6359974,"size":1169829,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0ca687750a0e3a2ef6a0669428458dc8f956f122&amp;dn=The+Science+of+Mind%3A+A+Complete+Course+of+Lessons+in+the+Science&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MANTESH","files":3,"time":1304301428,"description":" &lt;a href=&quot;http://i1177.photobucket.com/albums/x354/mangrewal1/Mantesh-18.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://i1177.photobucket.com/albums/x354/mangrewal1/Mantesh-18.jpg&lt;/a&gt;\n\n\n\n\n[\n\n\n\nThe Science of Mind: A Complete Course of Lessons in the Science of Mind and Spirit \n\n\nPublisher: BiblioBazaar \nErnest Holmes\nFebruary 11, 2008\nLanguage: English\nISBN-10: 9781437508857\nISBN-13: 978-1437508857\nASIN: 1437508855\n295 pages\n1.06 MB\n\n\n\nThe Science of the Mind was originally published in 1926 by the founder of the worldwide Religious Science movement. It was completely revised in 1938 by Ernest Holmes and Maude Allison Latham; this 1997 edition is the 1938 version with an added introduction by Jean Houston and a one-year study program that breaks the weighty tome into digestible bits. Using creative techniques, Holmes guides the student in easy-to-follow steps toward mastering the powers of the mind to find purpose in life. His explanations of how to pray and meditate, heal oneself spiritually, find self confidence, and express love have helped millions change their lives for the better. The Science of Mind is one of those spiritual classics that belongs on the bookshelf of anyone who wishes a life for themselves free of compulsion and negativity. --P. Randall Cohan --This text refers to an out of print or unavailable edition of this title. ............\n\n\n This is a pre-1923 historical reproduction that was curated for quality. Quality assurance was conducted on each of these books in an attempt to remove books with imperfections introduced by the digitization process. Though we have made best efforts - the books may have occasional errors that do not impede the reading experience. We believe this work is culturally important and have elected to bring the book back into print as part of our continuing commitment to the preservation of printed works worldwide.\n\n[/color][/quote][/b]","torrent":{"xt":"urn:btih:0ca687750a0e3a2ef6a0669428458dc8f956f122","amp;dn":"The+Science+of+Mind%3A+A+Complete+Course+of+Lessons+in+the+Science","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ca687750a0e3a2ef6a0669428458dc8f956f122","infoHashBuffer":{"type":"Buffer","data":[12,166,135,117,10,14,58,46,246,160,102,148,40,69,141,200,249,86,241,34]},"announce":[],"urlList":[]}}