{"title":"BossConstructor - Early Access","uid":12633508,"size":413463896,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0cf322cd3afbb96d2aa8941571ce86ac3900fdc9&amp;dn=BossConstructor+-+Early+Access&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dauphong","files":1,"time":1445886810,"description":"BossConstructor is a game about building and flying your own spaceship!\r\nBuilding your Ship\r\nThe core feature of the game is its ship editor which allows you to freely assemble your own spaceships using a vast variety of modules (currently more than 50). The way you build your ships determines how they behave and what they are capable of doing. Since every module costs money, weight and energy, designing a good ship is a challenging yet rewarding task.\r\nExpedition and Sandbox Mode\r\nThe expedition mode lets you explore a procedurally generated galaxy inhabited by the von-Neumann, an evolving AI species. You begin with a small basic ship and advance as you complete missions, discover new enemy species and scavenge for more powerful components to improve your ship. Alternatively, build any ship you like without constraints in the sandbox mode.\r\nArtificial Intelligence\r\nBeing a single player game, a lot of attention is given to the game's artificial intelligence system. The von-Neumann enemies you encounter in the expedition mode are created using elaborate artificial evolutions, in which a vast number of mutating ships have competed for survival. Several bonus game modes allow you to lean back and watch how different AI species compete with each other for survival","torrent":{"xt":"urn:btih:0cf322cd3afbb96d2aa8941571ce86ac3900fdc9","amp;dn":"BossConstructor+-+Early+Access","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0cf322cd3afbb96d2aa8941571ce86ac3900fdc9","infoHashBuffer":{"type":"Buffer","data":[12,243,34,205,58,251,185,109,42,168,148,21,113,206,134,172,57,0,253,201]},"announce":[],"urlList":[]}}