{"title":"Nine Inch Nails NIN Hammering it Home '94 FLAC","uid":6762151,"size":476555484,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0d69a098537f49ddb0a39cdb3b1b7a58c0d9d656&amp;dn=Nine+Inch+Nails+NIN+Hammering+it+Home+%5C%2794+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ingoshwetrust","files":23,"time":1319242791,"description":"Hammering It Home is a bootleg that was recorded live in London on May 25, 1994\n\nPinion\nTerrible Lie\nSin\nTR: &quot;Hey...fuck you, fuck you, fuck you pigs...[oink oink]!&quot;\nMarch Of The Pigs \nSomething I Can Never Have\nCloser\nReptile\nTR: &quot;You ready? Yeah?&quot;\nWish\nSuck\nThe Only Time \nGet Down Make Love 2:20,after crowd fails to sing lyrics TR: &quot;You don't even know the fucking words.&quot;\nTR: &quot;Does anybody out there got an NME on them. Anybody have an NME they can pass up to the front? You know. You guys understand English? I just took a shit and I need something to wipe my ass with. Anybody have an NME they can pass up to the fucking front? Here's a song about fucking.&quot; \nDown In It \nTR: &quot;Come on! If anybody feels like hurting themselves, you should do it now!&quot; \nBig Man With A Gun \nHead Like A Hole\nTR: &quot;Thank you.&quot;\nDead Souls \nHelp Me I Am In Hell\nHappiness in Slavery (end of song is cut and fades out)\n\nThis soundboard show is available on thee different silver pressed bootlegs. &quot;Hammering It Home&quot; and &quot;Shallow Grave&quot; (Insect Records) are clones. &quot;Pure as Fuck&quot; is the same recording with different track breaks. They are mislabeled as 5/25/94. The correct date for all of them is 5/26/94 Duration 78:30\n\n&quot;Hammering it Home&quot; &quot;Shallow Grave\n\nHammering It Home... Trent is an American last I checked who grew up in Ohio. Although not the worst bootleg title (Industrial Iguanas, Trent's Nasty Babes, and Salenas True Killers take the cake)it makes no sense. Trent Reznor is not British. Probably my favorite bootleg from this time period. Somehow it weaseled its way into legitimate stores in 1995 like Best Buy and (the now defunct) Circuit City. The audio is sub-par. It does not really matter though because Trent sounds DRUNK on this one. He is all over the place asking the crowd if 'anyone has an enema' and if 'they speak english?'. The performance quickly becomes a disaster which is only discernible if you listen to a lot of NIN bootlegs from this time period. The CD is professionally pressed in neon green. The booklet has nothing to offer, other than pictures of Trent. This is the most hilarious NIN bootleg, other than one claiming to be the first NIN concert which features Trent statements in a whinny voice saying, &quot;Thank you were called Nine Inch Nails&quot; at least four times. I sold it on ebay 8 years ago I can't remeber the title (sorry...) If you see this one buy it.","torrent":{"xt":"urn:btih:0d69a098537f49ddb0a39cdb3b1b7a58c0d9d656","amp;dn":"Nine+Inch+Nails+NIN+Hammering+it+Home+%5C%2794+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d69a098537f49ddb0a39cdb3b1b7a58c0d9d656","infoHashBuffer":{"type":"Buffer","data":[13,105,160,152,83,127,73,221,176,163,156,219,59,27,122,88,192,217,214,86]},"announce":[],"urlList":[]}}