{"title":"The Official Ubuntu Book 5th Edition","uid":5943715,"size":13646264,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0ebfa19dbf3da054bb7953ca9f9a84b879212b74&amp;dn=The+Official+Ubuntu+Book+5th+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"thetaLord","files":1,"time":1289276817,"description":"The Official Ubuntu Book, Fifth Edition, will get you up and running quickly.\n\n \n\nWritten by expert, leading Ubuntu community members, this book covers all you need to know to make the most of Ubuntu 10.04, whether youre a home user, small business user, server administrator, or programmer. The authors explain Ubuntu 10.04 from start to finish: installation, configuration, desktop productivity, games, management, support, and much more. Among the many topics covered in this edition: Kubuntu, Ubuntu Netbook Edition, and Ubuntu Server.\n\n \n\nThis complete guide also covers standard desktop applications, from word processing, spreadsheets, Web  browsing, e-mail, instant messaging, music, video, and  games to software development, databases, and server applications. In addition, you will\n\n \n\n* Learn how to customize Ubuntu for home, small business, school, government, and enterprise environments\n* Learn how to quickly update Ubuntu to new release versions and upgraded applications\n* Find up-to-the-minute troubleshooting advice from Ubuntu users worldwide from forums and other means to get the help you need quickly\n* Learn Ubuntu Server installation and administration, including LVM and RAID implementation\n* Learn how to install Ubuntu on a netbook ","torrent":{"xt":"urn:btih:0ebfa19dbf3da054bb7953ca9f9a84b879212b74","amp;dn":"The+Official+Ubuntu+Book+5th+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ebfa19dbf3da054bb7953ca9f9a84b879212b74","infoHashBuffer":{"type":"Buffer","data":[14,191,161,157,191,61,160,84,187,121,83,202,159,154,132,184,121,33,43,116]},"announce":[],"urlList":[]}}