{"title":"The Decemberists - Hazards of Love [wma-2009]","uid":4755878,"size":57146571,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0eed21b06a9dec5b414e5ef6835cf4c5c1b7a6dd&amp;dn=The+Decemberists+-+Hazards+of+Love+%5Bwma-2009%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"trfkad","files":-1,"time":1236451929,"description":"1. Prelude\n2. The Hazards of Love 1 (The Prettiest Whistles Won't Wrestle the Thistles Undone)\n3. A Bower Scene\n4. Won't Want for Love (Margaret in the Taiga)\n5. The Hazards of Love 2 (Wager All)\n6. The Queen's Approach\n7. Isn't it a Lovely Night?\n8. The Wanting Comes in Waves / Repaid\n9. An Interlude\n10. The Rake's Song\n11. The Abduction of Margaret\n12. The Queen's Rebuke / The Crossing\n13. Annan Water\n14. Margaret in Captivity\n15. The Hazards of Love 3 (Revenge!)\n16. The Wanting Comes in Waves (Reprise)\n17. The Hazards of Love 4 (The Drowned) \n\n\n\nTitle: The Hazards of Love\nArtist: The Decemberists\nStore Date: 24 mar 2009\nUpload Date: 7 mar 2009\nLabel: Capitol\nGenre: Indie Rock\nCover: front\nCodec: wma\n\n\nThe Decemberists' The Hazards Of Love, is the follow-up to the group's 2006 breakthrough, The Crane Wife, which NPR listeners voted their favorite album of the year. With their fifth full-length album, the Portland-based quintet of Colin Meloy, Chris Funk, Jenny Conlee, Nate Query and John Moen solidifies its standing as one of the most innovative creative forces in music today.\nIn an age when singles rule and the death of the album has been pronounced by many, The Decemberists have fashioned an anomaly: a record that demands to be listened to from start to finish and reveals more with each subsequent play. The 17-song suite, recorded with the band's longtime producer, Tucker Martine, is rooted in ancient language and imagery, yet entirely modern and accessible.\nThe album began when Meloy - long fascinated by the British folk revival of the 1960s - found a copy of revered vocalist Anne Briggs's 1966 EP, titled The Hazards of Love. Since there was actually no song with the album's title, he set out to write one. Soon he was immersed in something much larger than just a new composition.\nThe Hazards Of Love tells the tale of a woman named Margaret who is ravaged by a shape-shifting animal; her lover, William; a forest queen; and a cold-blooded, lascivious rake, who recounts with spine-tingling ease how he came to be living so easy and free. Lavender Diamond's Becky Stark and My Brightest Diamond's Shara Worden deliver the lead vocals for the female characters, while My Morning Jacket's Jim James, Robyn Hitchcock and the Spinanes' Rebecca Gates appear in supporting roles. The range of sounds reflects the characters' arcs, from the accordion's singsong lilt in Isn't it a Lovely Night? to the heavy metal thunder of The Queen's Rebuke/The Crossing. \n\n","torrent":{"xt":"urn:btih:0eed21b06a9dec5b414e5ef6835cf4c5c1b7a6dd","amp;dn":"The+Decemberists+-+Hazards+of+Love+%5Bwma-2009%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0eed21b06a9dec5b414e5ef6835cf4c5c1b7a6dd","infoHashBuffer":{"type":"Buffer","data":[14,237,33,176,106,157,236,91,65,78,94,246,131,92,244,197,193,183,166,221]},"announce":[],"urlList":[]}}