{"title":"Precious Knowledge (2011 Documentary)","uid":8842405,"size":839178961,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0f1eff2325dd8668463e7a69531237982e36f3b4&amp;dn=Precious+Knowledge+%282011+Documentary%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"loninappleton","files":3,"time":1377282292,"description":"Precious Knowledge (2011)\n\nruntime 70 minutes\n   (original dvd has two versions the other one 53 minutes which was aired on \n    broadcast television.  The dvd also contains many extras.)\n &lt;a href=&quot;\nhttp://www.preciousknowledgefilm.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.preciousknowledgefilm.com/&lt;/a&gt;\n\nSummary:\n\n&quot;While 48 percent of Mexican-American students currently drop out of high school, Tucson (Ariz.) High [School's] Mexican American Studies Program has become a national model of educational success, with 93 percent of enrolled students graduating from high school. However, Arizona lawmakers [state school superintendents Tom Horne and John Huppenthal and Gov. Jan Brewer have] shut the program down because they believe the students are being indoctrinated with dangerous ideology and embracing destructive ethnic hauvinism&quot; --Container.\n\n\nMy notes:\n\n  The summary above is important not just for Arizona, nor for just Mexican Americans.  The lesson to be learned here is that pride of heritage or pride in anything you can call your own works wonders on what one can learn, the confidence gained from that learning and the success which will follow.  This is the story of &quot;Precious Knowledge.&quot;\n\n  I'm reminded of another film that came out not that long ago.  It is called &quot;Walk Out&quot; (from HBO) and it is about the school walkouts that took place in the 60's in California schools by Hispanic kids protesting their second- class educations.\n\n  Then it was repeated when a million Mexican Americans took to the streets in white shirts as a symbol of unity in the fight for citizenship and on that day of leave-taking showed their contributions to our lives.\n\n  Next, Tuscon which is the story told in &quot;Precious Knowledge&quot;  and the banning of Mexican American Studies.\n\n  And then it happened during the so-called Madison (Wisconsin, USA) Uprising.  In my town and in others in the State the students followed the teachers out onto the street.    At that time I mentioned in writing carried by the local paper what Howard Zinn told his history students at Spellman College during the beginning of the Civil Rights movement: \n\n   &quot;You can read about history, or you can make history.&quot;\n\n   It is an apt saying for all ages. \n\n   The torrent is given here coincidentally before school begins in September. &quot;Precious Knowledge&quot; should be in all schools.  The torrent is a way of getting the content to those who will not normally see it.  And it is my request that you suggest your school get it and teach it.\n\n   My video knowledge is rudimentary.  This is the English version of &quot;Precious Knowledge&quot; and only contains the forced subs of the original.  The complete version has much more and well worth getting for schools everwhere.\n\n Notes written August 22, 2013","torrent":{"xt":"urn:btih:0f1eff2325dd8668463e7a69531237982e36f3b4","amp;dn":"Precious+Knowledge+%282011+Documentary%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f1eff2325dd8668463e7a69531237982e36f3b4","infoHashBuffer":{"type":"Buffer","data":[15,30,255,35,37,221,134,104,70,62,122,105,83,18,55,152,46,54,243,180]},"announce":[],"urlList":[]}}