{"title":"Hardware Hacking - Have Fun While Voiding Your Warranty (2004)","uid":7356069,"size":40623526,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0f6d880bcd36192803111cb2a47e78b0a471da2c&amp;dn=Hardware+Hacking+-+Have+Fun+While+Voiding+Your+Warranty+%282004%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1339775558,"description":"&quot;If I had this book 10 years ago, the FBI would never have found me!&quot; -- Kevin Mitnick This book has something for everyone---from the beginner hobbyist with no electronics or coding experience to the self-proclaimed &quot;gadget geek.&quot; Take an ordinary piece of equipment and turn it into a personal work of art. Build upon an existing idea to create something better. Have fun while voiding your warranty! Some of the hardware hacks in this book include:\n* Don't toss your iPod away when the battery dies! Don't pay Apple the $99 to replace it! Install a new iPod battery yourself without Apple's &quot;help&quot;\n* An Apple a day! Modify a standard Apple USB Mouse into a glowing UFO Mouse or build a FireWire terabyte hard drive and custom case\n* Have you played Atari today? Create an arcade-style Atari 5200 paddle controller for your favorite retro videogames or transform the Atari 2600 joystick into one that can be used by left-handed players\n* Modern game systems, too! Hack your PlayStation 2 to boot code from the memory card or modify your PlayStation 2 for homebrew game development\n* Videophiles unite! Design, build, and configure your own Windows- or Linux-based Home Theater PC\n* Ride the airwaves! Modify a wireless PCMCIA NIC to include an external antenna connector or load Linux onto your Access Point\n* Stick it to The Man! Remove the proprietary barcode encoding from your CueCat and turn it into a regular barcode reader\n* Hack your Palm! Upgrade the available RAM on your Palm m505 from 8MB to 16MB\n\nÂ· Includes hacks of today's most popular gaming systems like Xbox and PS/2.\nÂ· Teaches readers to unlock the full entertainment potential of their desktop PC.\nÂ· Frees iMac owners to enhance the features they love and get rid of the ones they hate.\nAmazon http://www.amazon.com/Hardware-Hacking-While-Voiding-Warranty/dp/1932266836\nPicture http://ecx.images-amazon.com/images/I/51amARvwUEL._BO2,204,203,200_PIsitb-sticker-arrow-click,TopRight,35,-76_AA300_SH20_OU01_.jpg","torrent":{"xt":"urn:btih:0f6d880bcd36192803111cb2a47e78b0a471da2c","amp;dn":"Hardware+Hacking+-+Have+Fun+While+Voiding+Your+Warranty+%282004%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f6d880bcd36192803111cb2a47e78b0a471da2c","infoHashBuffer":{"type":"Buffer","data":[15,109,136,11,205,54,25,40,3,17,28,178,164,126,120,176,164,113,218,44]},"announce":[],"urlList":[]}}