{"title":"Arguments that Count (2013).pdf Gooner","uid":13269930,"size":5130451,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0fd5ae4226a36c025c5691c8ea0197cca6e567e0&amp;dn=Arguments+that+Count+%282013%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1453388566,"description":"Arguments that Count - Physics, Computing and Missile Defense, 1949-2012 (2013).pdf Gooner\r\n\r\nPublisher: The MIT Press; 1 edition (August 16, 2013)\r\nLanguage: English\r\nISBN-10: 0262019442\r\nISBN-13: 978-0262019446\r\n\r\nIn a rapidly changing world, we rely upon experts to assess the promise and risks of new technology. But how do these experts make sense of a highly uncertain future? In Arguments that Count, Rebecca Slayton offers an important new perspective. Drawing on new historical documents and interviews as well as perspectives in science and technology studies, she provides an original account of how scientists came to terms with the unprecedented threat of nuclear-armed intercontinental ballistic missiles (ICBMs). She compares how two different professional communities -- physicists and computer scientists -- constructed arguments about the risks of missile defense, and how these arguments changed over time. Slayton shows that our understanding of technological risks is shaped by disciplinary repertoires -- the codified knowledge and mathematical rules that experts use to frame new challenges. And, significantly, a new repertoire can bring long-neglected risks into clear view.\r\n\r\nIn the 1950s, scientists recognized that high-speed computers would be needed to cope with the unprecedented speed of ICBMs. But the nation's elite science advisors had no way to analyze the risks of computers so used physics to assess what they could: radar and missile performance. Only decades later, after establishing computing as a science, were advisors able to analyze authoritatively the risks associated with complex software -- most notably, the risk of a catastrophic failure. As we continue to confront new threats, including that of cyber attack, Slayton offers valuable insight into how different kinds of expertise can limit or expand our capacity to address novel technological risks","torrent":{"xt":"urn:btih:0fd5ae4226a36c025c5691c8ea0197cca6e567e0","amp;dn":"Arguments+that+Count+%282013%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0fd5ae4226a36c025c5691c8ea0197cca6e567e0","infoHashBuffer":{"type":"Buffer","data":[15,213,174,66,38,163,108,2,92,86,145,200,234,1,151,204,166,229,103,224]},"announce":[],"urlList":[]}}