{"title":"Blue Devil v1 (00 - 31) (1984 - 1986)","uid":10269347,"size":967443183,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:0fea534cda5a02eae6065be90b385bec39b4ecb6&amp;dn=Blue+Devil+v1+%2800+-+31%29+%281984+-+1986%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nemesis43","files":32,"time":1401558329,"description":"Blue Devil v1 (00 - 31) (1984 - 1986) \n\nThe book starts out on a island wear they are filming the Blue Devil movie. Dan shows off the exo-suit he built by throwing a boulder. It then pans to Sharon and Wayne going into a temple, Sharon finds a stone totem and puts it into a key hole opening a door way to hell. Nebiros emerges from the portal and starts attacking the film crew. Marla ask Dan to fight it due to his exo-suit. Dan engages Nebiros in a battle were he uses a bunch of his gadgets that are integrated into his suit. He then gets hit by Nebiros mystical blast. Believed to be dead the rest of the crew gets brave and starts to attack, except for Wayne who tries to run for the chopper or boat. Dan gets up and jumps back into action. Seeing that Dan is fighting with all he has, Wayne decides to fight by making a lasso and throwing it around Nebiros, and has everyone pull. This gives Dan the breather he needs to keep fighting. the crew comes up with the idea to push Nebiros back through the portal. Dan grabs Nebiros and uses the rockets in his trident to push Nebiros, luckily right before they closed the portal some of the crew pulled Dan out. When back in his trailer he realizes that when he got hit by mystical blast the suit formed to his body.","torrent":{"xt":"urn:btih:0fea534cda5a02eae6065be90b385bec39b4ecb6","amp;dn":"Blue+Devil+v1+%2800+-+31%29+%281984+-+1986%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0fea534cda5a02eae6065be90b385bec39b4ecb6","infoHashBuffer":{"type":"Buffer","data":[15,234,83,76,218,90,2,234,230,6,91,233,11,56,91,236,57,180,236,182]},"announce":[],"urlList":[]}}