{"title":"Big Daddy Wilson Thumb a Ride(2011)(blues)(mp3@320)[rogercc]","uid":6575527,"size":127653888,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:10125cb145d2db4463765b9d8d781c4ea5ad432d&amp;dn=Big+Daddy+Wilson+Thumb+a+Ride%282011%29%28blues%29%28mp3%40320%29%5Brogercc%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rogercc1","files":13,"time":1312188209,"description":"Big Daddy Wilson Thumb A Ride\nReleased: June 2011\nLabel: Ruf Records\nFormat: Mp3@320\n\n\n\nRelease Notes\nAfter the positive responds and success of the &quot;Love Is The Key&quot; CD and the &quot;Love Is The Key Tour&quot; the mission was simple and clear to me, to use this platform to spread love everywhere I go. The goal was to produce a fully acoustic CD, using the guys that I am on the road with &quot;The Big Daddy Wilson Trio&quot;. Singing and playing the songs that my forefathers played. Using this special gift that &quot;The Almighty&quot; gave me.\n\nThat is why this new album is so special to me, it is really the second leg of the &quot;Love Is The Key Tour&quot;. The journey &quot;Thumb A Ride&quot;. It is not about where you have been or where you are going, it is all about the journey. It is about what you have learned along the way, and who you may have touched and those who have touched you. On this journey I have been blessed and touched by so many beautiful people. \n\nI just cannot name them all. But right now, I am thinking about two great musicians, that I have the chance to ride with, who have inspired and influenced me and the songs of this CD in a great way. I am talking about my right and left hand: Mr. Jochen &quot;Skinny Joe&quot; Bens and Mr. Michael &quot;Big Chief&quot; van Merwyk. \n\nI am very proud and happy to say that all songs on this CD are composed by the &quot;Big Daddy Wilson Trio&quot;. And that is why I call this one &quot;Thumb A Ride&quot;, cause it is all about the journey. Now, &quot;After all is said and done, more is always said than done&quot; let us do this. Feel me!\n\nPersonnel:\nThe Big Daddy Wilson Trio\nBig Daddy Wilson vocals,percussion\nJochen Bens acoustic guitar, resonator guitar, banjo, mandolin,backing vocals\nMicheal Van Merwyk  acoustic guitar, resonator guitar, weissenborn,backing vocals\nAdditional Musicians\nAndreas Muller upright bass\nMartin Esser percussion\n\nTracklist:\n01. Thumb A Ride [02:53]\n02. Baby Don't Like [02:56]\n03. This Is How I Live [03:40]\n04. Anna Mae [04:59]\n05. Sweet Tooth [03:44]\n06. It Don't Get No Better [03:59]\n07. Who's Dat Knocking [04:29]\n08. Four Daughters And A Strong Loving Wife [03:33]\n09. Cold Is The Wind [04:20]\n10. Drop Down Here [04:22]\n11. Way Back Yonder [04:18]\n12. Brother Blood [06:12]\n13. If You Were Mine [03:50.]\n\nRecorded at Skinny Joe Roof Oldenburg Germany  January 2011\n\nChampion Jack Dupree, Louisiana Red, Eddie Boyd... many musicians who made Europe their home and brought the blues with them succeeded here better than in the U.S. Even Luther Allison lived in Europe for 14 years before his big break.\nAnd now thereÃ‚Â´s Big Daddy Wilson, an American singer and songwriter who found his home in northern Germany. But something is different regarding Big Daddy Wilson. When he came over from the U.S. there was no blues in his baggage. He initially discovered the blues here in Germany which is where he will begin his international career.\n","torrent":{"xt":"urn:btih:10125cb145d2db4463765b9d8d781c4ea5ad432d","amp;dn":"Big+Daddy+Wilson+Thumb+a+Ride%282011%29%28blues%29%28mp3%40320%29%5Brogercc%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10125cb145d2db4463765b9d8d781c4ea5ad432d","infoHashBuffer":{"type":"Buffer","data":[16,18,92,177,69,210,219,68,99,118,91,157,141,120,28,78,165,173,67,45]},"announce":[],"urlList":[]}}