{"title":"Multilingual Dictionary of Fish &amp; Fish Products [PDF] [TPB-ZDadd","uid":5993382,"size":5369119,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:108aa5fea68e79b0487987dcdf44e7402886dff6&amp;dn=Multilingual+Dictionary+of+Fish+%26+Fish+Products+%5BPDF%5D+%5BTPB-ZDadd&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"ZDaddy","files":-1,"time":1290965168,"description":"Multilingual Dictionary of Fish and Fish Products\nOECD: Organisation for Economic Co-operation and Development\nISBN: 978-1-4051-5760-5\nHardcover\n368 pages\nMarch 2009, Wiley-Blackwell\n\n\nThe Multilingual Dictionary of Fish and Fish Products is a world standard guide to the names of fish and fish products traded internationally. This fifth edition comprises 1187 items, with descriptions in English and French and the equivalents for the main headings in 18 other languages: Danish, Dutch, Finnish, German, Greek, Icelandic, Italian, Japanese, Korean, Norwegian, Polish, Portuguese, Russian, Serbian, Croatian, Spanish, Swedish and Turkish. Indexes are provided for each language, including an index of scientific names for species of fish, shellfish, etc.\n\nThis is an essential reference for all those working in the arena of fisheries, aquaculture, seafood processing and the world trade in aquatic products. The information included is of great commercial use and importance, and copies of this expanded and enhanced new edition should be available in all seafood companies, libraries of research establishments, government departments and universities where aquaculture, fisheries, food science and technology, fish biology and aquatic sciences are studied and taught, throughout the world.\n\n","torrent":{"xt":"urn:btih:108aa5fea68e79b0487987dcdf44e7402886dff6","amp;dn":"Multilingual+Dictionary+of+Fish+%26+Fish+Products+%5BPDF%5D+%5BTPB-ZDadd","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"108aa5fea68e79b0487987dcdf44e7402886dff6","infoHashBuffer":{"type":"Buffer","data":[16,138,165,254,166,142,121,176,72,121,135,220,223,68,231,64,40,134,223,246]},"announce":[],"urlList":[]}}