{"title":"The Sound Of Siam Volume 2","uid":11513512,"size":161998519,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:10c3ca0b94707d384e5e5e8c5f4b03765fdf2d1f&amp;dn=The+Sound+Of+Siam+Volume+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1416420409,"description":"Soundway presents the The Sound of Siam 2 - Molam &amp; Luk Thung Isan from North-East Thailand 1970 - 1982 features 19 tracks, many appearing outside of Thailand for the first time. Both CD and double LP &amp; is accompanied with detailed liner notes written by compilers Chris Menist and Maft Sai. Soundway's second foray into South East Asia is focused on North-East Thailand, the epicentre of Molam and Luk Thung Isan music. Hypnotic phin &amp; khaen riffs, pulsing, electrified country rhythms and heartfelt vocals punctuate another journey into the lesser known reaches of 1970s Thai music. The first volume of The Sound of Siam, released in 2011, was the first introduction for many to the artistry and innovations of modern Thai music. One of the most popular compilations on Soundway Records the music even made it onto the big screen with 'Mae Jom Ka Lon' by Dao Bandon featured on the soundtrack of 'The Hangover Part II'. In an interview with LA Times Mick Jagger spoke of discovering the collection that &quot;some nutter put together&quot; after hearing the riff from Jumpin' Jack Flash on one of the tracks from the compilation. In this second volume of The Sound of Siam the focus is firmly on the music the sounds of north-east Thailand, or Isan and attempts to show how a genre evolved and developed from essentially an acoustic tradition with specific geographic roots, to one that started to incorporate other instruments and influences that reached out to the Isan diaspora around the country. The term molam is actually two separate words pushed together: Mo meaning 'expert' or 'doctor' and lam meaning 'to sing'. Hence the literal translation means 'singing expert'. Many molam records have extended intros that allow a vocalist to establish the theme of the song, as well as flex their improvisational muscles. Luk thung (literally 'song of the countryside') is a much broader, rural style that had a bigger impact nationally. Artists like Saksiam Petchompu began fusing this style with molam, a move which propelled him to national fame. You can hear the influence of western funk, as well as Thai arrangements, on the luk thung Isan (as the hybrid became known) smash Jeb Jin Jeb Jai included here.\n\n1. Angkanang Kunchai - Kid Hod Chu - Angkanang Kunchai\n2. Panom Promma - Mainaa Tam Pom Loey - Panom Promma\n3. The Petch Phin Thong Band - Bump Lam Plearn - The Petch Phin Thong Band\n4. Angkanang Kunchai - Teoy Salap Pamaa - Angkanang Kunchai\n5. Saksiam Petchchompu &amp; Pornsurapon Petchseethong - Jeb Jing Jeb Jai - Saksiam Petchchompu &amp; Pornsurapon Petchseethong\n6. Montien Tienthong - Kor Kai - Montien Tienthong\n7. Onuma Singsiri - Lam Plearn Toe Lhong Tong - Onuma Singsiri\n8. Petch Asia Band - Lam Plearn Tua Yaang - Petch Asia Band\n9. Banyen Sriwongsa - Ramwong Saraphan - Banyen Sriwongsa\n10. Thepporn Petchubon - Pa Gun Tor - Thepporn Petchubon\n11. Thonghuad Faited - Eua Aree See Sor - Thonghuad Faited\n12. Angkanang Kunchai - Lam Plearn Mee Mia Laew Pai - Angkanang Kunchai\n13. Banyen Sriwongsa - Lam Plearn Kon Baa Huay - Banyen Sriwongsa\n14. Thepporn Petchubon - Saam Gler Tiew Krung - Thepporn Petchubon\n15. Angkanang Kunchai - Yak Si Glap Isan - Angkanang Kunchai\n16. Chanpen Sirithep - Lam Plearn Kiew Bao - Chanpen Sirithep\n17. Thepporn Petchubon - Fang Jai Viangjan - Thepporn Petchubon\n18. Yenjit Porntawi - Lam Plearn Gok Kaa Kao - Yenjit Porntawi\n19. Rome Sithammarat - Sao New Look - Rome Sithammarat","torrent":{"xt":"urn:btih:10c3ca0b94707d384e5e5e8c5f4b03765fdf2d1f","amp;dn":"The+Sound+Of+Siam+Volume+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10c3ca0b94707d384e5e5e8c5f4b03765fdf2d1f","infoHashBuffer":{"type":"Buffer","data":[16,195,202,11,148,112,125,56,78,94,94,140,95,75,3,118,95,223,45,31]},"announce":[],"urlList":[]}}