{"title":"Temple Run- Run for Your Life! 01- Jungle Trek by Chase Wilder (","uid":11207078,"size":13226929,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:10ce6b2fdd736dccc3f8f18ebe65469f017103e5&amp;dn=Temple+Run-+Run+for+Your+Life%21+01-+Jungle+Trek+by+Chase+Wilder+%28&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gratefuldawg77","files":4,"time":1413234155,"description":"Temple Run, the fastest-growing mobile game app, is taking its biggest leap yet, jumping into children's books with a series of adventure books just right for middle-graders. Watch out, Indiana Jones, a new hero is in town: you the reader!\n\nSynopsis: Temple Run #1: Jungle Trek is a wilderness survival story. You're a lucky kid--you've had advantages all your life. For your birthday, you're having a destination party: a campout and scavenger hunt in an exotic locale with just a young party planner, the beautiful Scarlett Fox, and a handsome outdoorsman, Guy Dangerous, who will act as your guide. The two of them will chaperone--no parents! \n\nBut on the way there, your plane crash-lands in the mountains. Scarlett Fox and Guy Dangerous may or may not be on your side, depending on how you navigate the story. Or they may be there for their own purposes, having engineered the crash to take place in a remote location to steal a valuable artifact that they plan to sell. Depending on the choices you make, you will reach safety in time to enjoy your party, or you will be kidnapped and held for ransom, buying Guy and Scarlett time to make off with the treasure. You decide!","torrent":{"xt":"urn:btih:10ce6b2fdd736dccc3f8f18ebe65469f017103e5","amp;dn":"Temple+Run-+Run+for+Your+Life%21+01-+Jungle+Trek+by+Chase+Wilder+%28","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10ce6b2fdd736dccc3f8f18ebe65469f017103e5","infoHashBuffer":{"type":"Buffer","data":[16,206,107,47,221,115,109,204,195,248,241,142,190,101,70,159,1,113,3,229]},"announce":[],"urlList":[]}}