{"title":"Steve Roach &amp; Jorge Reyes - The Ancestor Circle (2014) FLAC","uid":11533991,"size":396597509,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:118e0137ec79cd5a45da729eb5ac1eff6648e558&amp;dn=Steve+Roach+%26amp%3B+Jorge+Reyes+-+The+Ancestor+Circle+%282014%29+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"shambu69","files":-1,"time":1416606723,"description":"Ambient / Tribal / Trance\n\nTracklist:\n01. The Circle Opens [9:04]\n02. Memories Unsuspended [24:49]\n03. Espacio Escultorico [9:36]\n04. Spirit, Stone And Bone [4:19]\n05. Procession Of Ancestors [10:20]\n06. Temple Of Dust [15:12]\n\nAbout:\nCountry: US\nLabel: Projekt\nCatalog: PROJEKT310\nYear of publication: 2014\nAudio codec: FLAC\nDuration: 1:13:25\n\nConjuring images of a primal futurism, this alchemical blending-of-sound is a ceremonial offering to the forgotten gods. THE ANCESTOR CIRCLE is a new tribal-ambient-electronic collaboration, the first recording from Roach and Reyes since VINE ~ BARK &amp; SPORE. This is the lost chapter of a long soulful journey that has taken twists and turns in its unfoldment. The music feels steeped in a frothy mind-altering blend, waiting for years as the potency increased. Roach and Reyes combined their instinctual nature -- developed over almost a decade of worldwide live and studio adventures -- leading up to the core of what became THE ANCESTOR CIRCLE. It is in this circle that their sound is unearthed from deep within their primordial soundworld, where prehistory meets future-tech creating a sound impossible to carbon date. Like the audio artifacts of a lost tribe, the studio source recordings that form this album's foundation were uncovered in 2013 on a cryptically-marked set of tapes. Created the week before Roach and Reyes' May 2000 concert at Tucson's Temple of Music and Art, this is their last joint studio project, as Reyes passed on to the ancestor circle in 2009.\n\nRoach comments, &quot;Jorge is still very much alive here in the circle where we always met with an unspoken language of sound constantly moving through us. As I completed this music now, adding new elements and evolving the arrangement, I could feel Jorge's spirit listening and interacting with me in the studio, offering feedback or sometimes making his guttural sounds of agreement like he would do in the past when we were deep in the process of carving on a mix. Just as in previous magical studio and stage experiences, we are in the circle once again.&quot;\n\nFor thousands of years, music was created to assist entrance to expanded states of consciousness, support a passage of life, birth and death and invoke the gods, spirits, and allies. While the abundance of today's entertainment-music has lost this powerful inner core, on THE ANCESTOR CIRCLE it is fully reinstated. This is a new &quot;medicine music&quot; as it should be: a probing visceral experience with the power to illuminate and shroud in mystery, digging deep into zones hidden within the psyche. It offers a potent realm of renewal for those seeking an unfiltered, cathartic rinse-down of today's technological, modern world; it helps hit the reset button of perception.\n\nRising up from a dark shroud of night to embrace life, an ancient voice chants in serpentine ecstasy only to subside and hover next to a slow realm of eternal time drawn from electronics, percussion, prehispanic flutes, ocarinas, other acoustic instruments and silence. When the sound dissolves beyond recognition, a subconscious landscape arises, whispering of faded visions painted on stone, echoing on studio walls, of times gone by and times to come. Roach and Reyes are still here bringing us messages from the infinite.\n\nArtist Bios\nJorge Reyes took an ethno-musicological approach to music-making on 20 solo albums; released throughout the late 80's, 90's, and 00's, these albums all have a special emphasis on indigenous and shamanic traditions from Reyes' native Mexico. After years of tirelessly performing across Europe, he met Roach in the early 90's at a festival on the Canary Island of Lanzarote. Along with the VINE ~ BARK &amp; SPORE collaboration with Roach, Reyes and Roach teamed with Spanish electric guitarist Suso Saiz for two mid-90's albums from their group project, Suspended Memories. Reyes passed away on February 7, 2009.\n\nSteve Roach is a pioneering cornerstone of ambient-atmospheric-electronic music with over 100 albums to his name. Since the early 80's, Roach has approached music like a medicine man approaching the void: engaging the challenge, uncovering new mysteries, and bringing them back to share with the world. From the expansive, time-suspending spaces reflecting his spiritual home in Arizona to the fire breathing, ethno-ambient expressions woven from all things electric and organic, Roach's long list of groundbreaking recordings are fueled by his prolific nature and uncompromising approach.\n\nSupport the artists you like by buying their music!  &lt;a href=&quot;\nhttp://steveroach.com/Music/discography.php?albumID=523&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://steveroach.com/Music/discography.php?albumID=523&lt;/a&gt;","torrent":{"xt":"urn:btih:118e0137ec79cd5a45da729eb5ac1eff6648e558","amp;dn":"Steve+Roach+%26amp%3B+Jorge+Reyes+-+The+Ancestor+Circle+%282014%29+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"118e0137ec79cd5a45da729eb5ac1eff6648e558","infoHashBuffer":{"type":"Buffer","data":[17,142,1,55,236,121,205,90,69,218,114,158,181,172,30,255,102,72,229,88]},"announce":[],"urlList":[]}}