{"title":"The Encyclopedia of Ancient Egyptian Architecture (Art).pdf","uid":14620837,"size":46431400,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:120d83635f42b79f2c1b11c3152ff22596d78a76&amp;dn=The+Encyclopedia+of+Ancient+Egyptian+Architecture+%28Art%29.pdf&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":1,"time":1463268770,"description":"Princeton University Press | 2003 | 0691114889 | English | 296 pages | PDF | 44.3 MB\r\n\r\nThe ancient Egyptians' massive stone monuments, ranging from Abu Simbel in the south of Cleopatra's palaces in Alexandria, were built over a period of three millennia, and yet a common architectural tradition links them all.&quot; &quot;The Encyclopedia of Ancient Egyptian Architecture documents that tradition and provides a single-volume reference on one of the most remarkable architectures of the ancient world. Separate entries are provided for each of the most important sites, covering monuments such as the Step Pyramid of Djoser (the world's first significant stone building), the tombs of the Valley of the Kings, Hatshepsut's mortuary temple at Deir el-Bhari, and the great Ptolemaic temples that line the Upper Nile. Every aspect of building design and construction is also considered in separate entries, covering technical aspects such as building materials (from reed and mud brick to sandstone and granite) and construction techniques (including pyramid building and the erection of obelisks).&quot; &quot;With more than 600 entries and 300 illustrations, this encyclopedia provides a comprehensive perspective on ancient Egyptian architecture and is destined to become the standard reference on the subject for many years to come","torrent":{"xt":"urn:btih:120d83635f42b79f2c1b11c3152ff22596d78a76","amp;dn":"The+Encyclopedia+of+Ancient+Egyptian+Architecture+%28Art%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"120d83635f42b79f2c1b11c3152ff22596d78a76","infoHashBuffer":{"type":"Buffer","data":[18,13,131,99,95,66,183,159,44,27,17,195,21,47,242,37,150,215,138,118]},"announce":[],"urlList":[]}}