{"title":"Mind, Memory, Time - Carl Gunther (2012) 501 pags","uid":9523620,"size":460528,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:12149b30fdaadf6f2d0805c66451c765a7e13f91&amp;dn=Mind%2C+Memory%2C+Time+-+Carl+Gunther+%282012%29+501+pags&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1390695962,"description":"\nWhere are our memories of today or yesteryear stored? How does a baby spider know how to build its web? What directs the astronomical series of molecular motions that causes an tiny egg cell grow into the enormous physiology that is you and me? What is consciousness? The answer to these seemingly disparate questions might be surprising.\n\nToday much is known about the structures of the brain. But still almost nothing is known about how the details of memory are actually stored and recalled. Might memory stream into our minds from a vast, expanded dimension of time? The possibility might seem absurd. However, when one turns to the instinctive memory of animals, the mystery of memory becomes that much more perplexing. Exactly how does an orb weaver construct its web? Scientists assert that its instinctive memory must be carried in its genes. But when one carefully scrutinizes this explanation, one finds that it relies on truly insurmountable improbabilities.\n\n&quot;Mind, Memory, Time&quot; examines the holes in the conventional scientific theory. The inquiry relies on the dissident views of eminent scientist such as the Nobel Prize winners Erwin Schrodinger, Werner Heisenberg, and Sir John Eccles. It offers a new theory of life, mind, and memory based on the modern physicists' weird world of quantum mechanics and block time. It places the material world squarely in a vast dimension of conscious intelligence.\n\nThe material basis of scientific reality has not changed in four hundred years. Since it was first proposed by Rene Descartes, it has been a powerful tool for understanding the nature of life and the mind. But it is reaching its limit. It is time to examine its foundation and look deep into the abyss of the unknown. Focusing on the great mysteries, one finds glaring evidence that the modern, material view of reality is on the verge of a profound revolution. We face a new reality that is far stranger than most of us would guess.","torrent":{"xt":"urn:btih:12149b30fdaadf6f2d0805c66451c765a7e13f91","amp;dn":"Mind%2C+Memory%2C+Time+-+Carl+Gunther+%282012%29+501+pags","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12149b30fdaadf6f2d0805c66451c765a7e13f91","infoHashBuffer":{"type":"Buffer","data":[18,20,155,48,253,170,223,111,45,8,5,198,100,81,199,101,167,225,63,145]},"announce":[],"urlList":[]}}