{"title":"Heroes S01E03 HDTV.XviD NLsubs DutchReleaseTeam","uid":5962147,"size":366125552,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:12de3f02257df8448a1ac8ce48f01833c38b7b42&amp;dn=Heroes+S01E03+HDTV.XviD+NLsubs+DutchReleaseTeam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"DutchReleaseTeam","files":6,"time":1289989866,"description":"Heroes (Engels voor helden) is een Amerikaanse sciencefiction-dramaserie, bedacht door Tim Kring. Heroes ging in Amerika op 25 september 2006 op NBC in premiÃƒÂ¨re. De serie vertelt het verhaal van verschillende personen die \\&quot;dachten dat ze net als iedereen waren... tot ze wakker werden met buitengewone gaven\\&quot; zoals telepathie, het kunnen tijdreizen en kunnen vliegen. Deze personen komen er snel achter dat ze een rol spelen in het voorkomen van een catastrofe en het redden van de mensheid.\n\nSeizoen 1, aflevering 3.\n\nDe eerste vier afleveringen van het eerste seizoen draaiden rond de personages, het ontdekken van hun gaven en hun omgang met deze gaven.\nAan het einde van de vierde aflevering gebeurde er iets dat de aftrap was voor de tweede verhaallijn, die draaide om het bericht ontvangen door Peter Petrelli, \\&quot;Save the cheerleader, save the world\\&quot; (Red de cheerleader, red de wereld) wat is verbonden aan de reeds voorziene explosie. Aan het einde van deze verhaallijn hebben de personages langzamerhand hun gaven en het bestaan van anderen zoals hen ontdekt. Sommigen begonnen zich te realiseren dat ze samen moeten werken om een catastrofe te voorkomen.","torrent":{"xt":"urn:btih:12de3f02257df8448a1ac8ce48f01833c38b7b42","amp;dn":"Heroes+S01E03+HDTV.XviD+NLsubs+DutchReleaseTeam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12de3f02257df8448a1ac8ce48f01833c38b7b42","infoHashBuffer":{"type":"Buffer","data":[18,222,63,2,37,125,248,68,138,26,200,206,72,240,24,51,195,139,123,66]},"announce":[],"urlList":[]}}