{"title":"American_Top_40_1974_June_29th","uid":10508456,"size":363755377,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:136436081fad66154c64e1032cb6ce0d9325d045&amp;dn=American_Top_40_1974_June_29th&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"RocketMan999","files":-1,"time":1404815987,"description":"&quot;And here we go with more of the most popular records in the USA. I'm Casey Kasem, this is AT40, and the countdown rolls on.&quot;\n\n\nAmerican Top 40 with Casey Kasem aired on radio from July 4, 1970 until August 6, 1988. This recording is a rebroadcast from internet radio.\n\nIn this countdown the AT40 staff guessed the top 40 because Casey had an acting role that required him being gone from the microphone for a lengthy period of time. Shortly after production of the June 22nd show, this show was recorded without using a Billboard chart, because no chart had been issued yet. The July 6th special, &quot;Top 40 Acts of the 70's So Far&quot; was already recorded, and Guest Host &quot;Humble&quot; Harv Miller was set to do the July 13th broadcast, and that's how Casey Kasem got to go on summer vacation.\n\nA listener asks, &quot;What year in the rock era holds the record for the most number one instrumentals?&quot; Casey says the question is very appropriate in 1974 because the year 1962 holds the record with three number one instrumentals (which Casey lists), and 1974 being only half over had already seen two.\n\nElvis Presley debuts at number 34 with his hit, &quot;If You Talk In Your Sleep.&quot; Casey says that for the last six years he has held the record for most top 40 hits (this is his 96th). Casey likens Elvis to Hank Aaron; with every new hit, he just breaks his own record.\n\nCasey answers what he says is the most difficult question the AT40 staff ever received (they had gotten it two-and-a-half years earlier). &quot;Who stayed on the chart the most weeks in a row, and how many songs did he need to set that record?&quot; Casey reports this artist started his streak in 1955 and it last over four years (and it wasn't Elvis).\n\nThe Righteous Brothers have their hit &quot;Rock And Roll Heaven&quot; at number 14. Casey says they split up and were apart longer than any other group or duo that eventually got back together, six years.\n\nFinally, Gordon Lightfoot has his first number one hit, &quot;Sundown.&quot;\n\n40: Keep On Smilin' - Wet Willie\n39: The Locomotion - Grand Funk\n38: Come Monday - Jimmy Buffett\n37: Finally Got Myself Together - Impressions\n36: Workin' At The Carwash Blues - Jim Croce\n35: Takin' Care Of Business - Bachman Turner Overdrive\n34: If You Talk In Your Sleep - Elvis Presley\n33: La Grange - ZZ Top\n32: Help Me - Joni Mitchell\n31: My Girl Bill - Jim Stafford\n30: Already Gone - Eagles\n29: Waterloo - ABBA\n28: Radar Love - Golden Earring\n27: If You Want To Get To Heaven - Ozark Mountain Daredevils\n26: Side Show - Blue Magic\n25: The Entertainer - Marvin Hamlisch\n24: Train Of Thought - Cher\n23: You Won't See Me - Anne Murray\n22: Midnight At The Oasis - Maria Muldaur\n21: Save The Last Dance For Me - The DeFranco Family\n20: Rikki Don't Lose That Number - Steely Dan\n19: I'm Coming Home - Spinners\n18: One Helluva Woman - Mac Davis\n17: Haven't Got Time For The Pain - Carly Simon\n16: Annie's Song - John Denver\n15: For The Love Of Money - OJ's\n14: Rock And Roll Heaven - The Righteous Brothers\n13: The Air That I Breathe - Hollies\n12: Dancing Machine - Jackson Five\n11: On And On - Gladys Knight &amp; The Pips\n10: Band On The Run - Wings\n9: The Streak - Ray Stevens\n8: Hollywood Swingin' - Kool &amp; The Gang\n7: If You Love Me Let Me Know - Olivia Newton-John\n6: Rock Me Baby - George McCrae\n5: Rock The Boat - Hues Corporation\n4: You Make Me Feel Brand New - Stylistics\n3: Be Thankful For What You Got - William Devaughn\n2: Billy Don't Be A Hero - Bo Donaldson &amp; The Haywoods\n1: Sundown - Gordon Lightfoot\n","torrent":{"xt":"urn:btih:136436081fad66154c64e1032cb6ce0d9325d045","amp;dn":"American_Top_40_1974_June_29th","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"136436081fad66154c64e1032cb6ce0d9325d045","infoHashBuffer":{"type":"Buffer","data":[19,100,54,8,31,173,102,21,76,100,225,3,44,182,206,13,147,37,208,69]},"announce":[],"urlList":[]}}