{"title":"PrettyDirty - India Summer (The Hitchhiker) NEW 13 July 2016","uid":15289511,"size":455283712,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:13a44ec6fd9382b4dd7d25bc2bba44d0aeb14ebe&amp;dn=PrettyDirty+-+India+Summer+%28The+Hitchhiker%29+NEW+13+July+2016&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xxxlavalxxx","files":2,"time":1468407417,"description":"Markus Dupree is in the country and his rental car broke down. He's trying to figure out what to do since he's in a foreign country, when India Summer rolls up in her fancy sports car to lure him back to her place. He says he only needs a lift back to the city, but India has other plans for him. At her house, she knocks him out on the way into the mansion, and moments later we see him waking up with her standing over him in some slinky black lacy lingerie. She explains how this is going to work, He must let her use him as her sex slave for the day, and in return she'll take him to the garage to get a tow. He protests until she starts rubbing his hardening cock with her hand. Soon he shuts up and she has free reign to whip out his big European cock and suck it really good for him. She gets to work getting what she wanted, and Markus changes his tune quickly, using his captor's horny pussy like she begged for. He fucks her wet pussy really good, to the accompaniment of her ecstatic screams of pleasure in doggy style, cowgirl and many other tantalizing positions until she cums, taking his huge load of sticky cum all over her face. Will she take him back to the rental place... or keep him around a little longer?\r\nCategories Brunette, Hardcore, Natural Tits, Fingering, MILF &amp; Mature, Blowjob, Deepthroat, Open Mouth Facial, Big Dick, Femdom, Lingerie\r\n \nhttp://imgdone.com/viewer.php?file=27126240119771044650.jpg\r\n \nhttp://imgdone.com/viewer.php?file=93022479985765118857.jpg","torrent":{"xt":"urn:btih:13a44ec6fd9382b4dd7d25bc2bba44d0aeb14ebe","amp;dn":"PrettyDirty+-+India+Summer+%28The+Hitchhiker%29+NEW+13+July+2016","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13a44ec6fd9382b4dd7d25bc2bba44d0aeb14ebe","infoHashBuffer":{"type":"Buffer","data":[19,164,78,198,253,147,130,180,221,125,37,188,43,186,68,208,174,177,78,190]},"announce":[],"urlList":[]}}