{"title":"Romano Guardini - Catholic thinker (9 books)","uid":8906918,"size":13481650,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:166b88b37df42eb909616cfdcfc5c230e472acc4&amp;dn=Romano+Guardini+-+Catholic+thinker+%289+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pharmakate","files":35,"time":1378930134,"description":"Nine books by Romano Guardini. Seven are epub/mobi format, from retail sources; two are improved scans in pdf, sourced from\n\n1. Power and Responsibility: A Course of Action for the New Age (pdf)\n2. The Death of Socrates (pdf)\n\n3. Prayer in Practice\n4. The Lord\n5. The Spirit of the Liturgy\n6. Letters From Lake Como: Explorations in Technology and the Human Race\n7. Learning the Virtues That Lead You to God\n8. Preparing Yourself for Mass\n9. Jesus Christus\n\nNote: Letters from Lake Como, though from a retail source, lost a lot of formatting in the conversion.\n\nA pdf version of The Lord is here: &lt;a href=&quot;\nhttps://thepiratebay.se/torrent/8061513&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.se/torrent/8061513&lt;/a&gt;\n\nabout the author:\n\nRomano Guardini (17 February 1885, Verona - 1 October 1968, Munich) was a Catholic priest, author, and academic. He was one of the most important figures in Catholic intellectual life in 20th-century.\n\nGuardini's books were often powerful studies of traditional themes in the light of present-day challenges, or conversely examinations of current problems as approached from the Christian, and especially Catholic, tradition. He was able to get inside such different worldviews as those of Socrates, Plato, Augustine, Dante, Pascal, Kierkegaard and Nietzsche, and make sense of them for modern readers.\n\nHis first major work, Vom Geist der Liturgie (The Spirit of the Liturgy), published during the First World War, was a major influence on the Liturgical Movement in Germany, and so ultimately on the liturgical reforms of the Second Vatican Council. Pope Paul VI offered to make him a cardinal in 1965, but he respectfully declined.\n\nAs a philosopher he founded no &quot;school&quot;, but his intellectual disciples could in some sense be said to include Josef Pieper, Luigi Giussani, Felix Messerschmid, Heinrich Getzeny, Rudolf Schwarz, Jean Gebser, and Joseph Ratzinger (later Pope Benedict XVI). Even Hannah Arendt and Iring Fetscher were favourably impressed by his work.\n\n\n\n","torrent":{"xt":"urn:btih:166b88b37df42eb909616cfdcfc5c230e472acc4","amp;dn":"Romano+Guardini+-+Catholic+thinker+%289+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"166b88b37df42eb909616cfdcfc5c230e472acc4","infoHashBuffer":{"type":"Buffer","data":[22,107,136,179,125,244,46,185,9,97,108,253,207,197,194,48,228,114,172,196]},"announce":[],"urlList":[]}}