{"title":"Multiculturalism and the Politics of Guilt by Paul Gottfried","uid":10132898,"size":2567622,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:16aaa64f76906a3aaff2bb64dcf89a4e7ea56b94&amp;dn=Multiculturalism+and+the+Politics+of+Guilt+by+Paul+Gottfried&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1399904252,"description":"Multiculturalism and the Politics of Guilt - Towards a Secular Theocracy (2002) by Paul Edward Gottfried.pdf\n\nMulticulturalism and the Politics of Guilt extends Paul Gottfried's examination of Western managerial government's growth in the last third of the twentieth century. Linking multiculturalism to a distinctive political and religious context, the book argues that welfare-state democracy, unlike bourgeois liberalism, has rejected the once conventional distinction between government and civil society. Gottfried argues that the West's relentless celebrations of diversity have resulted in the downgrading of the once dominant Western culture. The moral rationale of government has become the consciousness-raising of a presumed majority population. While welfare states continue to provide entitlements and fulfill the other material programs of older welfare regimes, they have ceased to make qualitative leaps in the direction of social democracy. For the new political elite, nationalization and income redistributions have become less significant than controlling the speech and thought of democratic citizens. An escalating hostility toward the bourgeois Christian past, explicit or at least implicit in the policies undertaken by the West and urged by the media, is characteristic of what Gottfried labels an emerging &quot;therapeutic&quot; state. For Gottfried, acceptance of an intrusive political correctness has transformed the religious consciousness of Western, particularly Protestant, society. The casting of &quot;true&quot; Christianity as a religion of sensitivity only toward victims has created a precondition for extensive social engineering. Gottfried examines late-twentieth-century liberal Christianity as the promoter of the politics of guilt. Metaphysical guilt has been transformed into self-abasernent in relation to the &quot;suffering just&quot; identified with racial, cultural, and lifestyle minorities, Unlike earlier proponents of religious liberalism, the therapeutic statists oppose anything, including empirical knowledge, that impedes the expression of social and cultural guilt in an effort to raise the self-esteem of designated victims. Equally troubling to Gottfried is the growth of an American empire that is influencing European values and fashions. Europeans have begun, he says, to embrace the multicultural movement that originated with American liberal Protestantism's emphasis on diversity as essential for democracy. He sees Europeans bringing authoritarian zeal to enforcing ideas and behavior imported from the United States. Multiculturalism and the Politics of Guilt extends the arguments of the author's earlier After Liberalism. Whether one challenges or supports Gottfried's conclusions, all will profit from a careful reading of this latest diagnosis of the American condition.\n\n158 pages\nPublisher: University of Missouri Press; First Edition edition (October 2002)\nLanguage: English\nISBN-10: 0826214177\nISBN-13: 978-0826214171","torrent":{"xt":"urn:btih:16aaa64f76906a3aaff2bb64dcf89a4e7ea56b94","amp;dn":"Multiculturalism+and+the+Politics+of+Guilt+by+Paul+Gottfried","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16aaa64f76906a3aaff2bb64dcf89a4e7ea56b94","infoHashBuffer":{"type":"Buffer","data":[22,170,166,79,118,144,106,58,175,242,187,100,220,248,154,78,126,165,107,148]},"announce":[],"urlList":[]}}