{"title":"World Conqueror 1945 v1.03 [PD]","uid":8890529,"size":22317070,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:17abf70aeae84d1c1c09bf8879a98998d1aafb75&amp;dn=World+Conqueror+1945+v1.03+%5BPD%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Androider","files":-1,"time":1378573536,"description":"\nWorld Conqueror 1945 is a new style strategy game on the background of WW II(Super Risk). In the game depending on troops you can compete for territories such as lands, cities and oceans, further for resources, develop economy and military, conquer enemies' capitals and destroy the enemies.\n \nDuring the game you need to operate and distribute the three basic troops reasonably which include soldiers, tanks and artillery.(Soldier troop with high yields but general attack, tank troop with high attack and continue action when complete destroying the enemies, artillery troop attacks soldier troop and tank troop while they cannot strike back),judge on the current situation correctly at any time for the AI is outstanding. \n\nThe attributes of arms are different from each country. For example, the tank of Germany is most powerful but with high price, the cannon of the Soviet Union is excellent, the navy of Britain is best.\nThe troop will gain experience by combat, and get the medal with enough experience. The troop owning the medal is with higher combat effectiveness than the normal troops and will become a Troop Ace.\n\nIn the game you need to use military cards to cooperate to the battle.\n\n- Soldier Card (produce soldier troops) \n- Tank Card (produce tank troops) \n- Artillery Card (produce artillery troops) \n- Battleship Card (take actions on the sea ) \n- Fortress Card (cannot move and attack during 3 rounds but improve defending) \n- Construction Card (construct territories, improve taxes, highest level can draft army troop ) \n- Airstrike Card (Air attack the enemy of adjacent territory) \n- General Card(equip a general to the troop for enhancing the attacking power) \n- Marshal Card(equip a marshal to the troop for enhancing the defending power) \n- Special Card (only owned by U.S.A, Germany, Soviet Union, Japan, Britain, France, Italy and used once every 7 rounds.)\n\nInclude two modes: conquest mode and battle mode \nConquest mode: choose one country from the 11 Axis and Allies which may change the fate of the world to dominate the world. \n\nThe others will be your allies, enemies and neutral. There are 3 periods to choose from: 1940 the beginning WWâ…¡,1942 the middle WWâ…¡, 1944 the end WWâ…¡.\nBattle mode: 10 great battles which may change the fate of the world are waiting for your challenge!\n\n1942 Pacific War \n1943 China Burma India Theater \n1942 The Battle of Kursk \n1944 D-Day in Normandy \n1941 North African Campaign \n1942 Kokoda Campaign \n1945 The Fate of Reich \n1945 August Storm \n1942 Compete for Indian Ocean \n1940 Sea Road\n\nMagnificent fighting music and sound can make you feel involvement.\n\nFeatures:\n\n- battle mode and conquest mode \n- 243 territories \n- 11 belligerent states \n- 40 military troops \n- 17 military cards \n- 5 difficulty levels \n- 3 periods and 10 battles \n- auto save\n\nWhat's New:\n\n- map zoom\n\nMore info:\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.easytech.wc1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.easytech.wc1&lt;/a&gt;\n\n\nGIVE LIFE TO THIS TORRENT! AFTER YOUR DOWNLOAD, DON'T FORGET TO SEED!","torrent":{"xt":"urn:btih:17abf70aeae84d1c1c09bf8879a98998d1aafb75","amp;dn":"World+Conqueror+1945+v1.03+%5BPD%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17abf70aeae84d1c1c09bf8879a98998d1aafb75","infoHashBuffer":{"type":"Buffer","data":[23,171,247,10,234,232,77,28,28,9,191,136,121,169,137,152,209,170,251,117]},"announce":[],"urlList":[]}}