{"title":"Cellulose and Cellulose Composites","uid":15139746,"size":16850544,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:18fe9f3bc0d170bffe8707ce25d023bc660b97bf&amp;dn=Cellulose+and+Cellulose+Composites&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1467194657,"description":"Cellulose and Cellulose Composites - Modification, Characterization and Applications - Md. Ibrahim H. Mondal (Nova, 2015).pdf\r\n\r\nCellulose is the most abundant natural biopolymer. Recently, modified cellulose has been used as a reinforcement for various composites. Cellulose composite and modified cellulose are attractive because of their excellent mechanical and thermal performance. Furthermore, these are fully biodegradable in a wide variety of environmental conditions. Researchers all over the world are working on reinforcing cellulosic materials, with a goal to increase the number of uses of cellulose composites and modified cellulose. This book reviews some vital issues and topics on the latest scientific and technological advances in cellulose composites and modified cellulose. There are few books available on these topics. This book contains 20 invited contributions, written by renowned experts from many countries. Each chapter focuses on issues related to the use of cellulose composites and modified celluloses. This book thus demonstrates the real potential of these materials to be useful in different products and industries. Highlights of the book include the cellulose modification for smart material and medical applications, functional finishing of textiles, new cellulose-derivative plastic films, cellulose-based composites (such as thermoplastic composites, smart cellulose composites, composites for building and household materials), smart applications of cellulose-based materials in tissue engineering, digital dyeing and wrapping materials. There are also special sections on Bayesian statistics in interpreting wood pyrolysis and techniques in developing value-added products from cellulosic biomass. Thus, this book, covering the vital issues and topics of cellulose, its modifications and uses, should be attractive and supportive to scientists, product designers, polymer engineers and other academic processionals","torrent":{"xt":"urn:btih:18fe9f3bc0d170bffe8707ce25d023bc660b97bf","amp;dn":"Cellulose+and+Cellulose+Composites","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"18fe9f3bc0d170bffe8707ce25d023bc660b97bf","infoHashBuffer":{"type":"Buffer","data":[24,254,159,59,192,209,112,191,254,135,7,206,37,208,35,188,102,11,151,191]},"announce":[],"urlList":[]}}