{"title":"Temple- Structures in Chaos (2012)","uid":8684451,"size":71824351,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1ac04ca38d4f597da2e5569e9db0b2b8583406ca&amp;dn=Temple-+Structures+in+Chaos+%282012%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"JS128old","files":9,"time":1373764387,"description":"&quot;The crazy solo that opens up Higher Perfection should be enough to persuade the listener that they are in for one hell of a ride with Holland's death metal band Temple's 2012 debut, Structures In Chaos. And even from there, it neither gets any less brutal nor has any less an effect on the listeners senses. This album is highly obscure, and it really is not surprising, given how brutal and in your face it truly is. This is one of the few modern brutal death metal acts that actually feels like a band from the glory days of death metal.\n\nNot surprisingly, this proves to be one of the finest songs on the album, containing a beautiful atmospheric section at about 2.45, over which the vocalist growls his lungs out, before it dives back into another very heavy riff, and then a second solo, that is every bit as good as the opening one. Throughout this song, the listener is gifted to completely manic drumming that never seems to cease, being played with speeds that would make Cryptopsy shake in their boots.\n\nThe Algol Planet and Rituals Of Marduk are two of the other highlights found throughout, with some crazily fast blast beats and ridiculously low growls. However, the remarkable thing about this is that it does not sound like anything the listener has heard before, being completely unique throughout. Every song on this album feels fresh, with songs such as Dead Sun Festival being equal parts beautiful writing and brutal death metal, all of which will pound the listener's skull in. The raw sound captured by this album is really what makes it succeed, however.\n\nThis is an album that is nearly unparalleled in its field on every single level, being shockingly heavy, and thoroughly enjoyable right across the board. Every instrument is written with a large amount of technical prowess, making for one of the most enjoyable death metal releases of all time.&quot;\n\nTaken from http://www.metal-archives.com/reviews/Temple/Structures_in_Chaos/332296/psychosisholocausto\n\nPlease seed!","torrent":{"xt":"urn:btih:1ac04ca38d4f597da2e5569e9db0b2b8583406ca","amp;dn":"Temple-+Structures+in+Chaos+%282012%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ac04ca38d4f597da2e5569e9db0b2b8583406ca","infoHashBuffer":{"type":"Buffer","data":[26,192,76,163,141,79,89,125,162,229,86,158,157,176,178,184,88,52,6,202]},"announce":[],"urlList":[]}}