{"title":"Practical Household Uses of Honey ","uid":8204195,"size":1227540,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1b44805a65cff273f7117a99c2f0c4247f0ff785&amp;dn=Practical+Household+Uses+of+Honey+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"DaRule762","files":-1,"time":1362084562,"description":"From earliest times, people have used honey to nourish, heal, purify and protect. The ancient Babylonians and Assyrians poured honey on the foundations of their temples, and the Greeks, Hindus and Persians used it in their religious services. Honey is as popular today as it was in ancient times, and is still held in great respect due to its proven antibacterial properties, as well as its delicious and unique taste. This accessible handbook offers an introduction to all aspects of honey, its history and many applications. The book opens with a guide to the honey bee, as well as an overview of how to keep hives and bees as a productive hobby. There follows a glossary of the different types of honey and their properties, distinct tastes, and suggested uses. Next, there are practical recipes for health and beauty, with all kinds of honey scrubs, masks, toners, cleansers and nourishers for skin and hair. Last but not least, the unique taste and benefits of honey can be enjoyed in the kitchen, and there are recipes here for a wealth of exciting dishes and drinks.","torrent":{"xt":"urn:btih:1b44805a65cff273f7117a99c2f0c4247f0ff785","amp;dn":"Practical+Household+Uses+of+Honey+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b44805a65cff273f7117a99c2f0c4247f0ff785","infoHashBuffer":{"type":"Buffer","data":[27,68,128,90,101,207,242,115,247,17,122,153,194,240,196,36,127,15,247,133]},"announce":[],"urlList":[]}}