{"title":"China's Quest - John Garver","uid":12928673,"size":6072014,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1c7639b8ba14ef67fc1ec60a92f68362d7f13a5b&amp;dn=China%27s+Quest+-+John+Garver&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1449497526,"description":"From its founding 65 years ago, the People's Republic of China has evolved from an important yet chaotic and impoverished state whose power was more latent than real into a great power on the cusp of possessing the largest economy in the world. Its path from the 1949 revolution to the present has been filled with twists and turns, including internal upheavals, a dramatic break with the Soviet Union, the 1989 revolution wave, and various wars and quasi-wars against India, the USSR, Vietnam, and South Korea. Throughout it all, international pressures have been omnipresent, forcing the regime to periodically shift course. In short, the evolution of the PROC in world politics is an epic story and one of the most important developments in modern world history. Yet to date, there has been no authoritative history of China's foreign relations.\r\n\r\nJohn Garver's monumental China's Quest not only addresses this gap; it will almost certainly serve as the definitive work on the topic for years to come. Garver, one of the world's leading scholars of Chinese foreign policy, covers a vast amount of ground and threads a core argument through the entirety of his account: domestic political concerns-regime survival in particular-have been the primary force driving the People's Republic's foreign policy agenda. The objective of communist regime survival, he argues, transcends the more rudimentary pursuit of national interests that realists focus on. Indeed, from 1949 onward, domestic politics has been integral to the PROC's foreign policy choices. Over the decades, the regime's decisions in the realm of international politics have been dictated concerns about internal stability. In the early days of the regime, Mao and other part leaders were concerned with surviving in the face of American aggression. Later, they came to see the post-Stalinist Soviet model as a threat to their revolutionary program and initiated a stunning break with Khrushchev regime. Finally, the collapse of other communist regimes in and after 1989 radically altered their relationships with capitalist powers, and again preserving regime stability in a world where communism has been largely abandoned became paramount.\r\n\r\nChina's Quest, the result of over a decade of research, writing, and analysis, is both sweeping in breadth and encyclopedic in detail. Quite simply, it will be essential for any student or scholar with a strong interest in China's foreign policy","torrent":{"xt":"urn:btih:1c7639b8ba14ef67fc1ec60a92f68362d7f13a5b","amp;dn":"China%27s+Quest+-+John+Garver","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c7639b8ba14ef67fc1ec60a92f68362d7f13a5b","infoHashBuffer":{"type":"Buffer","data":[28,118,57,184,186,20,239,103,252,30,198,10,146,246,131,98,215,241,58,91]},"announce":[],"urlList":[]}}