{"title":"Playing to the Edge by Michael V. Hayden (ePub)","uid":13692834,"size":652946,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1ccf3122cb24ebb2d5d1ed00b64c3975cc4678b8&amp;dn=Playing+to+the+Edge+by+Michael+V.+Hayden+%28ePub%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Bookz-BB","files":2,"time":1456632707,"description":"Playing to the Edge: American Intelligence in the Age of Terror by Michael V. Hayden\r\n\r\n-----------------\r\n\r\nAn unprecedented high-level master narrative of America's intelligence wars, from the only person ever to helm both CIA and NSA, at a time of heinous new threats and wrenching change\r\n\r\nFor General Michael Hayden, playing to the edge means playing so close to the line that you get chalk dust on your cleats. Otherwise, by playing back, you may protect yourself, but you will be less successful in protecting America. &quot;Play to the edge&quot; was Hayden's guiding principle when he ran the National Security Agency, and it remained so when he ran CIA. In his view, many shortsighted and uninformed people are quick to criticize, and this book will give them much to chew on but little easy comfort; it is an unapologetic insider's look told from the perspective of the people who faced awesome responsibilities head on, in the moment. \r\n\r\nHow did American intelligence respond to terrorism, a major war and the most sweeping technological revolution in the last 500 years? What was NSA before 9/11 and how did it change in its aftermath? Why did NSA begin the controversial terrorist surveillance program that included the acquisition of domestic phone records? What else was set in motion during this period that formed the backdrop for the infamous Snowden revelations in 2013? \r\n\r\nAs Director of CIA in the last three years of the Bush administration, Hayden had to deal with the rendition, detention and interrogation program as bequeathed to him by his predecessors. He also had to ramp up the agency to support its role in the targeted killing program that began to dramatically increase in July 2008. This was a time of great crisis at CIA, and some agency veterans have credited Hayden with actually saving the agency. He himself won't go that far, but he freely acknowledges that CIA helped turn the American security establishment into the most effective killing machine in the history of armed conflict.\r\n\r\nFor 10 years, then, General Michael Hayden was a participant in some of the most telling events in the annals of American national security. General Hayden's goals are in writing this book are simple and unwavering: No apologies. No excuses. Just what happened. And why. As he writes, &quot;There is a story here that deserves to be told, without varnish and without spin. My view is my view, and others will certainly have different perspectives, but this view deserves to be told to create as complete a history as possible of these turbulent times. I bear no grudges, or at least not many, but I do want this to be a straightforward and readable history for that slice of the American population who depend on and appreciate intelligence, but who do not have the time to master its many obscure characteristics.&quot;","torrent":{"xt":"urn:btih:1ccf3122cb24ebb2d5d1ed00b64c3975cc4678b8","amp;dn":"Playing+to+the+Edge+by+Michael+V.+Hayden+%28ePub%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ccf3122cb24ebb2d5d1ed00b64c3975cc4678b8","infoHashBuffer":{"type":"Buffer","data":[28,207,49,34,203,36,235,178,213,209,237,0,182,76,57,117,204,70,120,184]},"announce":[],"urlList":[]}}