{"title":"Loreena McKennitt - 1999 Live In Paris And Toronto (Disc 2) (Cel","uid":3236264,"size":61567332,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1e43b95b6ea8a406788d479776d071ab68ff7fb0&amp;dn=Loreena+McKennitt+-+1999+Live+In+Paris+And+Toronto+%28Disc+2%29+%28Cel&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tyler_durden","files":10,"time":1094248936,"description":"From AMG: &quot;Loreena McKennitt is in her element in front of an audience, telling interesting stories about the songs and assembling a topnotch backing band. This is her first live release available to the public, and uses material from three concerts (one from Paris and two from Toronto) to put together a complete show. As with The Book of Secrets tour, the first half is The Book of Secrets in its entirety, arranged in the same order as the studio CD. This material is covered on the first CD, and it has never sounded better. The live performance seems to breathe new life into the tracks and some songs, such as &quot;Dante's Prayer&quot; and &quot;Skellig,&quot; sound better than the studio recordings. The second CD is more of an overview of her career, featuring songs from her back catalog. Again, the tracks seem to benefit when played in front of an audience; in particular, &quot;The Lady of Shalott&quot; and &quot;All Souls Night&quot; are brilliant. The musicianship on this live CD is excellent, and her band is very tight, as though they had been playing together for years. The sound of the CD is amazing; while maintaining the warmth of a live performance, McKennitt is still able to present a crisp, clean recording -- a remarkable feat. Also worth noting is the packaging, which includes notes by McKennitt, wonderful photos, and details of how the whole package was put together. This CD is ideal for fans and is actually a good place for newcomers to start.&quot;","torrent":{"xt":"urn:btih:1e43b95b6ea8a406788d479776d071ab68ff7fb0","amp;dn":"Loreena+McKennitt+-+1999+Live+In+Paris+And+Toronto+%28Disc+2%29+%28Cel","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e43b95b6ea8a406788d479776d071ab68ff7fb0","infoHashBuffer":{"type":"Buffer","data":[30,67,185,91,110,168,164,6,120,141,71,151,118,208,113,171,104,255,127,176]},"announce":[],"urlList":[]}}