{"title":"Suicide in Nazi Germany","uid":11822501,"size":1362571,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1efb67f66934cd54c09266d1a2a65effa9f43d4e&amp;dn=Suicide+in+Nazi+Germany&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1429325444,"description":"The Third Reich met its end in the spring of 1945 in an unparalleled wave of suicides. Hitler, Goebbels, Bormann, Himmler and later Goering all killed themselves. These deaths represent only the tip of an iceberg of a massive wave of suicides that also touched upon ordinary lives. As this suicide epidemic has no historical precedent or parallel, it can tell us much about the Third Reich's peculiar self-destructiveness and the depths of Nazi fanaticism.\n\nChristian Goeschel looks at the suicides of both Nazis and ordinary people in Germany between 1918 and 1945, from the end of World War I until the end of World War II, including the mass suicides of German Jews during the Holocaust. He shows how suicides among different population groups, including supporters, opponents, and victims of the regime, responded to the social, cultural, economic and, political context of the time. He also analyses changes and continuities in individual and societal responses to suicide over time, especially with regard to the Weimar Republic and the post-1945 era.\n\nRichly grounded in gripping and previously unpublished source material such as suicide notes and police investigations, the book offers a new perspective on the central social and political crises of the era, from revolution, economic collapse, and the rise of the Nazis, to Germany's total defeat in 1945","torrent":{"xt":"urn:btih:1efb67f66934cd54c09266d1a2a65effa9f43d4e","amp;dn":"Suicide+in+Nazi+Germany","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1efb67f66934cd54c09266d1a2a65effa9f43d4e","infoHashBuffer":{"type":"Buffer","data":[30,251,103,246,105,52,205,84,192,146,102,209,162,166,94,255,169,244,61,78]},"announce":[],"urlList":[]}}