{"title":"ABBA.Bang.a.Boomerang.PDTV.x264-W4F.mp4","uid":8093862,"size":420092645,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1efcb82cfd9af0b7762ca1c673ad143007793ad1&amp;dn=ABBA.Bang.a.Boomerang.PDTV.x264-W4F.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tonyisaac","files":1,"time":1359784703,"description":"ABBA.Bang.a.Boomerang.PDTV.x264-W4F\n\n   ABBA: Bang a Boomerang tells the inside story of Australia's\n colossal 70s crush on the Swedish supergroup ABBA and \n their music, and how this unequalled and enduring fan-worship\n changed them and us forever.ABC's innovative music\n program Countdown and its host Molly Meldrum were\n instrumental in bringing ABBA to a burgeoning mid-70s\n television audience looking for something different. It was \n due to Countdown that Mamma Mia was released as a single,\n first in Australia and then the world, and the ABBA phenomenon\n was born. Viewers were going into record shops wanting to \n buy the single. Molly rang RCA records asking about the \n release of Mamma Mia and was told there were no plans to\n do so.&quot;We then played it again in defiance and they had no\n option but to release it... it was lucky, it went to number one,&quot;\n Meldrum said.ABBA: Bang a Boomerang digs deep into \n heartfelt memories, cardboard cartons of memorabilia, \n face-to-face encounters, local pop icon recounts, lavish \n personal and public ABBA museums and Australia's rich \n media archives to relive a moment of collective national \n 'craziness', when we did literally go ABBA mad. The result\n is a warm, bright, captivating engagement with ABBA's \n time Down Under that will remind us all of the band's \n impact and how our open-hearted embrace of all things \n ABBA would eventually define us. One in three Australian\n households owned an ABBA record - from Prime \n Minister Fraser to eight year olds around the nation, \n we were hooked even if some of us didn't want to admit\n it back then and we didn't realise the crush would be \n for keeps.","torrent":{"xt":"urn:btih:1efcb82cfd9af0b7762ca1c673ad143007793ad1","amp;dn":"ABBA.Bang.a.Boomerang.PDTV.x264-W4F.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1efcb82cfd9af0b7762ca1c673ad143007793ad1","infoHashBuffer":{"type":"Buffer","data":[30,252,184,44,253,154,240,183,118,44,161,198,115,173,20,48,7,121,58,209]},"announce":[],"urlList":[]}}