{"title":"BROUSKO 136","uid":9896870,"size":1095063764,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1f5508017e3277b5ea54bc0548325e18031d43a0&amp;dn=BROUSKO+136&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GioXara","files":-1,"time":1396721975,"description":"BROUSKO EPISODIO 136 DVD RIP\n\nPerilipsi:\n\nSto akousma tou neou oti o Shfhs de tha kanei to xeirourgeio kai oti pleon h epembash exei anablhthei h Melina tha fygei kai tha treksei na brei ton Shfh sta Xania,to kalo se olh thn istoria einai oti o Axilleas den tha antidrasei kai tha thn afhsei na paei.\nO Shfhs einai eksorgismenos me thn aderfh tou thn Anastasia giati anakateuthke se olh thn katastash kai tha parei mia megalh apofash wste na mhn kanei thn epembash,par' oles tis ypodeikseis tou giatrou tou oti einai o monos tropos na ksanaperpathsei.\nTo neo auth th fora erxetai apo th Dafnh afou tha parei mia apofash wste na grapsei ena biblio sxetika me ton polypo8hto kai megalo erwta Axillea kai  Melinas,sto akousma autou tou bibliou olo to periballon gyrw ths tha antidrasei perierga.\nO Mat8aios tha kanei ena taksidi ekspres gia thn Austria prokeimenou na sylleksei perissotera stoixeia sxetika me thn yiothesia tou Nektariou,en tw metaksy enas neos kai agnwstos antras ston orizonta arxizei na syllegei oso perissotera stoixeia mporei gia thn oikogeneia Mat8aiou.\nTon ntetektib kanei pleon kai o Diamanths afou tha psaxnei na brei osa perissotera stoixeia mporei gia thn Xelgka Linemagier.O Nektarios tha ksafniastei otan tha akousei ena periergo neo apo th Xristina oti exei enan didymo aderfo.","torrent":{"xt":"urn:btih:1f5508017e3277b5ea54bc0548325e18031d43a0","amp;dn":"BROUSKO+136","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f5508017e3277b5ea54bc0548325e18031d43a0","infoHashBuffer":{"type":"Buffer","data":[31,85,8,1,126,50,119,181,234,84,188,5,72,50,94,24,3,29,67,160]},"announce":[],"urlList":[]}}