{"title":"HISTORY OF POP AND ROCK MUSIC - part 372","uid":7143328,"size":1100483679,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:1fc7cbc0dc50f974bd80986111f4d7d06fd651c0&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+372&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pupovaczlatko","files":-1,"time":1333066941,"description":"\nPART  372\n\n\n\nPAUL McCARTNEY &amp; WINGS - Uncle Albert ( Admiral Halsey) (1971)\nPAUL McCARTNEY &amp; WINGS - Mary Had A Little Lamb (1972)\nPAUL &amp; LINDA McCARTNEY - Bluebird (1973)\nPAUL McCARTNEY &amp; WINGS - Band on the Run - promo (1974)\nPAUL McCARTNEY &amp; WINGS - Band On The Run (Seattle, WA - June 10th) (1976) \nPAUL McCARTNEY &amp; WINGS - Band on the run (1989) \n\n\n&quot;Uncle Albert/Admiral Halsey&quot; is a song by Paul and Linda McCartney from the album &quot;Ram&quot;. Released in the United States as a single on 2 August 1971, it reached number one on the Billboard Hot 100 in September 1971, making it the first of a string of post-Beatles, McCartney-penned singles to top the US pop chart through the 1970s and 1980s. Paul McCartney won the Grammy Award for Best Arrangement Accompanying Vocalists in 1971 for the song. The single was certified Gold by the Recording Industry Association of America for sales of over one million copies.McCartney said &quot;Uncle Albert&quot; was based on his uncle. &quot;He's someone I recall fondly, and when the song was coming it was like a nostalgia thing.&quot; McCartney also said, &quot;As for Admiral Halsey, he's one of yours, an American admiral&quot;, referring to Admiral William &quot;Bull&quot; Halsey.\n&quot;Mary Had a Little Lamb&quot; is Wings' version of the traditional nursery rhyme.The song was released as a single on 12 May 1972. It was included as a bonus track on the remastered version of &quot;Wild Life&quot; released in 1993. The song was virulently attacked by rock critics at the time, although a few critics thought it to be deliberately ironic. It reached the top 10 in the UK, peaking at #9. However, many US radio stations chose instead to play the pop/rock B-side, &quot;Little Woman Love&quot;. Apple Records in the US even revised the picture sleeve for the single to credit both sides by name, but the single still failed to rise above #28 in the U.S.\n&quot;Live and Let Die&quot; is the main theme song of the 1973 James Bond film Live and Let Die and was performed by Paul McCartney &amp; Wings for the movie soundtrack and appears on the soundtrack album. The song was one of Wings' most successful singles, and the most successful Bond theme to that point, charting at number two on the US Billboard Hot 100, and number nine on the UK Singles Chart.It has been covered by several bands, with Guns N' Roses' version being the most popular. Both McCartney's and Guns N' Roses' versions were nominated for Grammys.\n&quot;Band on the Run&quot; is the title song from Paul McCartney &amp; Wings' acclaimed &quot;Band on the Run&quot; album. The single sold one million copies in 1974 in the United States, where it reached number 1, and it went to number 3 in the United Kingdom.The single was certified Gold by the Recording Industry Association of America for sales of over one million copies. The song features prominently on every McCartney/Wings best-of compilation and in McCartney's live shows. It was the second of five number-one singles for the band on the Billboard Hot 100.\n\n","torrent":{"xt":"urn:btih:1fc7cbc0dc50f974bd80986111f4d7d06fd651c0","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+372","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1fc7cbc0dc50f974bd80986111f4d7d06fd651c0","infoHashBuffer":{"type":"Buffer","data":[31,199,203,192,220,80,249,116,189,128,152,97,17,244,215,208,111,214,81,192]},"announce":[],"urlList":[]}}