{"title":"Adguard for Android (v2.1.177) [Multi] (2015)","uid":12570275,"size":5257534,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:217401cbb4ce0bf11b515451aac1c19bc0e3e96d&amp;dn=Adguard+for+Android+%28v2.1.177%29+%5BMulti%5D+%282015%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Woitler","files":1,"time":1444842940,"description":"Application Name: Adguard\r\nPlatform: Android\r\nApplication Type: Web Filter, Anti-Banner, Anti-Phishing, Firewall and etc.\r\nRelease Date: October 14, 2015\r\nApplication Version: 2.1.177\r\nLanguage: English, German, Chinese, Japanese, Russian and etc.\r\nSystem requirements: Android 4.0.3 and higher\r\nType Installer: APK\r\nFile size: 5.01 MB\r\n----------------------------------------------------\r\nDescription\r\nAdguard - is a unique internet filter that protects you from the ubiquitous advertising, malware, and phishing sites, online tracking and more.\r\nAdguard is really cope with all kinds of completely blocking Internet advertising, pages load faster with it, it saves bandwidth and increase the protection of your device against possible threats. Adguard uses a unique technology that allows you to filter the traffic of your device, which does not require ROOT-law. The speed of the filter will not be affected by the work VPN-server, because it is located right on your device.\r\n----------------------------------------------------\r\nFunctionality\r\n1. The application does not require ROOT rights, which means that it can be used perfectly on any device;\r\n2. Adguard - the first application for Android with high quality filtration;\r\n3. Adguard able to block all kinds of advertising. Seriously, everything;\r\n4. The application is really simple, usable and intuitive;\r\n5. Protection against malware and phishing sites. Adguard prohibit downloading potentially dangerous applications and files, and will not allow you to become a victim of fraud;\r\n6. Blocking is not only in the browser, but also in games and applications!;\r\n7. The application speeds up the loading of web pages. Without further elements they open faster;\r\n8. Protection of personal data. Adguard ban tracking your online activities;\r\n9. Adguard - program, widely recognized in the world. More than 6 million people from different countries use version for Windows. And Adguard application for Android works perfectly well.\r\n----------------------------------------------------\r\nWhat's new in version 2.1.177?\r\n1. Firewall section added to settings, with an ability to disable it comletely.\r\n2. Firewall: Added an ability to temporary pause blocking for foreground application.\r\n3. Added low-level settings that can help with the work in non-standard networks and custom firmware.\r\n4. An option has been added to low-level configuration, which prohibits VPN pause when changing the network or disconnecting from it.\r\n5. Reworked the DNS-filtering - now it should work even where external DNS are blocked.\r\n6. Reworked the application life cycle: now the protection can be turned off/on without any issues.\r\n7. Fixed application restart after deep sleep.\r\n8. Fixed critical error that led to Adguard restart.\r\n9. Fixed a mechanism for identifying modem and access point mode and showing a warning.\r\n10. Fixed authorization problem in the Moscow Subway.\r\n11. Fixed problem sending SMS/MMS in the AT&amp;T network.\r\n12. Fixed an issue with collecting traffic statistics.\r\n13. Fixed rare problem with automatic filter updates.\r\n14. Fixed an issue with firewall interface on small screens.\r\n15. Added support for new browsers: Dolphin Zero, Ghostery, CM Private Browsing, Jbak Browser and more.\r\n16. Exceptions added: Handcent Next SMS, Chomp SMS, FarmVille 2.\r\n17. Updated German and Polish localizations.\r\n18. Fixed several issues in the interface","torrent":{"xt":"urn:btih:217401cbb4ce0bf11b515451aac1c19bc0e3e96d","amp;dn":"Adguard+for+Android+%28v2.1.177%29+%5BMulti%5D+%282015%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"217401cbb4ce0bf11b515451aac1c19bc0e3e96d","infoHashBuffer":{"type":"Buffer","data":[33,116,1,203,180,206,11,241,27,81,84,81,170,193,193,155,192,227,233,109]},"announce":[],"urlList":[]}}