{"title":"Schrodinger Suite 2009 Update 1 SPYRAL Windows and Linux","uid":5426337,"size":3167785239,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:2186364b9a807c20bcd07d6da1299a097a128e81&amp;dn=Schrodinger+Suite+2009+Update+1+SPYRAL+Windows+and+Linux&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"uisgdlyast","files":4,"time":1268262965,"description":"Schrodinger is a suite of molecular modeling packages that take advantage of the latest technological advances in computational chemistry. Jaguar, the high-performance ab-initio quantum mechanics application, and MacroModel, the most trusted name in molecular modeling, have been widely applied to address the full range of chemical research from materials to life sciences. Strike is a chemically aware statistical package for examining structure-property relationships. QSite is a powerful QM/MM application for studying reaction mechanisms in a variety of systems,such as protein active sites.\nAlso, Schrodinger provides a complete suite of software that addresses the challenges in pharmaceutical research. For structure-based drug design, Prime is an accurate protein structure prediction package; Glide performs accurate, rapid ligand-receptor docking; and Liaison predicts binding affinity. Schrodinger also provides Phase for ligand-based pharmacophore modeling, and QikProp for ADME properties prediction of drugcandidates. In addition, LigPrep is a rapid 2D to 3D conversion program that can prepare ligand libraries for further computational analyses.\nAnd most recently, Schrodinger introduced CombiGlide for focused library design, and Epik for accurate enumeration of ligand protonation states in biological conditions. Finally, Maestro is the graphical user interface for all of Schrodinger's computational programs and provides a powerful, fully-integrated molecular visualization and analysis environment.\n\nThanks Spyral!","torrent":{"xt":"urn:btih:2186364b9a807c20bcd07d6da1299a097a128e81","amp;dn":"Schrodinger+Suite+2009+Update+1+SPYRAL+Windows+and+Linux","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2186364b9a807c20bcd07d6da1299a097a128e81","infoHashBuffer":{"type":"Buffer","data":[33,134,54,75,154,128,124,32,188,208,125,109,161,41,154,9,122,18,142,129]},"announce":[],"urlList":[]}}