{"title":"Chess Times 1988 - 5 Issues (gnv64)","uid":8269993,"size":12226733,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:21941673e2954fd32612301fa7b6df3f518769de&amp;dn=Chess+Times+1988+-+5+Issues+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gnv65","files":-1,"time":1363596847,"description":"Chess Times was an old Indian monthly chess magazine that is no longer in publication. I have scanned my old issues &amp; am sharing them with you in this torrent:\n\nDecember 1987 issue deals with IV Bhilwara International Grandmasters Chess Tournament held at New Delhi in Nov/Dec 1987. It was a Cat VIII tournament won by Hungarian GM Istvan Csiom. Runner up &amp; reigning World Junior Champion IM Vishwanathan Anad made his 2nd GM norm here.\nJanuary 1988 issue deals with SAKTHI FINANCE International Grandmasters Chess Tournament held at Coimbatore in Dec1987. It was a Cat VII tournament won jointly by Anand &amp; Russian GM Zaitchik. Anand made his final GM norm here to become India's first Grandmaster!\nFeb/March 1988 issue deals with 14th National Women's Chess Championship won by Bhagyashree Thipsay &amp; the 25th National Men's Championship held at Neyveli in Jan/Feb 1988. This Cat IV tournament was won by GM-elect V.Anand\nApril 1988 issue deals with KOYENCO International Grandmasters Chess Tournament held at Calicut in Feb/March 1988. This Cat VII tournament was won by Bangladesh GM Niaz Murshed.\nMay 1988 issue deals with 2nd Tata Steel &amp; Alekhine Chess Club International Grandmasters Chess Tournament held at Calcutta in April 1988. This Cat VIII tournament was won by Australian GM Ian Rogers.\n\nThe issues with large A4 size pages are akin to tournament bulletins &amp; give complete games from all the tournaments they cover.","torrent":{"xt":"urn:btih:21941673e2954fd32612301fa7b6df3f518769de","amp;dn":"Chess+Times+1988+-+5+Issues+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21941673e2954fd32612301fa7b6df3f518769de","infoHashBuffer":{"type":"Buffer","data":[33,148,22,115,226,149,79,211,38,18,48,31,167,182,223,63,81,135,105,222]},"announce":[],"urlList":[]}}