{"title":"Tomas Ross - Havank - Caribisch complot (E-Book)NLT-Release","uid":5354403,"size":435749,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:21d6d0831dfbf8a0cf1fb25c35423c16044b05ac&amp;dn=Tomas+Ross+-+Havank+-+Caribisch+complot+%28E-Book%29NLT-Release&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"soap22","files":6,"time":1265888690,"description":"Tomas Ross - Havank - Caribisch complot\n\nBeschrijving\nCommissaris Charles C.M. Carlier, alias de Schaduw, en zijn oude vriend Bruno SilvÃƒÂ¨re raken onverwacht betrokken bij de spraakmakende rechtszaak tegen de Nederlandse topcrimineel Willem H. wanneer de Nederlandse politie hun hulp inroept bij de zoektocht naar ene Marie Dufour. Dufour is de weduwe van Enno Flem, bijgenaamd 'De Bankier van de Onderwereld', die op klaarlichte dag in Amsterdam werd geliquideerd. De waarschijnlijke opdrachtgever van de moord was Willem H. Omdat ook Flems juridisch adviseur Zeeger Braam, kroongetuige tegen Willem H., onder mysterieuze omstandigheden om het leven komt, is de politie bijzonder geÃƒÂ¯nteresseerd in wat Flems weduwe te vertellen heeft. De speurtocht naar Marie brengt de Schaduw via duistere krochten, een afgesneden vingerkootje en een monsterachtige krokodil op het spoor van Peerke Diamant alias 'PAF', een oude bekende die jaren geleden met Willem H. de spectaculaire ontvoering van een Amsterdamse biermagnaat op touw zette. De jacht op PAF leidt via de Dordogne en Amsterdam naar Sint Maarten waar de Schaduw in een merkwaardig, om niet te zeggen hÃƒÂ³ÃƒÂ³gst merkwaardig avontuur raakt verwikkeld dat hij aanvankelijk als Het Geheim van het Afgesneden Vingerkootje betitelde maar alsnog als Caribisch Complot in de Schaduwiaanse analen bij liet zetten.","torrent":{"xt":"urn:btih:21d6d0831dfbf8a0cf1fb25c35423c16044b05ac","amp;dn":"Tomas+Ross+-+Havank+-+Caribisch+complot+%28E-Book%29NLT-Release","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21d6d0831dfbf8a0cf1fb25c35423c16044b05ac","infoHashBuffer":{"type":"Buffer","data":[33,214,208,131,29,251,248,160,207,31,178,92,53,66,60,22,4,75,5,172]},"announce":[],"urlList":[]}}