{"title":"Capsized 2011 [GoG]","uid":8393380,"size":912608375,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2267884bb78d1df4bb1b1d413017f7c1614157ae&amp;dn=Capsized+2011+%5BGoG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GOG-Upp","files":3,"time":1366496018,"description":" &lt;a href=&quot;http://www.gog.com/gamecard/capsized&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.gog.com/gamecard/capsized&lt;/a&gt;\n\nWhat's cool about it:\nHighly detailed alien environments and creatures, lovingly rendered with high resolution hand-drawn artwork.\n12 mission campaigns featuring massive non-linear environments, diverse objectives and enemies, and exciting comic book style cutscenes.\n4 extra arcade modes to unlock, including local deathmatch and co-op, Survival mode, Time Trials, and even Armless fighting.\nOverview:\nCapsized is a fast paced 2D platformer focused on intense action and exploration. As a intrepid space traveler, your ship has crash landed on a mysterious alien planet. You must navigate through the perilous environment and fight off blood-thirsty creatures to save your crewmates and escape with your lives!\n\nUse your jetpack to fly through the alien jungle, and tools such as the Gravity Hook to manipulate your environment to skilfully dodge and defeat attacking enemies. You will be challenged - with platforming, puzzle solving, and deadly skirmishing, often all at the same time!\n\nArtist Jesse McGibney and programmer Lee Vermeulen create an immersive alien world teeming with bizarre life-forms and strange landscapes presented in a unique hand-drawn art style. Combining control elements of first person shooters and innovative physics based combat, Capsized emphasizes action without giving up the smart problem solving of classic platform games.\n\nBonus content included for FREE with purchase: 2 wallpapers 6 artworks","torrent":{"xt":"urn:btih:2267884bb78d1df4bb1b1d413017f7c1614157ae","amp;dn":"Capsized+2011+%5BGoG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2267884bb78d1df4bb1b1d413017f7c1614157ae","infoHashBuffer":{"type":"Buffer","data":[34,103,136,75,183,141,29,244,187,27,29,65,48,23,247,193,97,65,87,174]},"announce":[],"urlList":[]}}