{"title":"Alcohol 120% 2.0.2.4713 Retail Multilang - DeLtASn1p3r","uid":8971427,"size":10666462,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:23dc8d7c24f5df2b00a93848e64068848b402e4c&amp;dn=Alcohol+120%25+2.0.2.4713+Retail+Multilang+-+DeLtASn1p3r&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"DeLtA_Sn1p3r","files":3,"time":1380338114,"description":"I Need Some Help I Have My Ps3 Firmware At 4.46 And I Need To Down Grade It To 3.55 If Any1 Can Help Me Email Me AtId Appreciate it Much..\n\n\nENJOY YOU CAN ALSO COPY PC PS3 XBOX AND ECT WITH THIS SOFTWARE BUT WOULD NEED A BLU - RAY READER / BURNER I HAVE EVERYTHING I COULD NEED BUT MIGHT HAVE TO BUY A NEW PS3 :( \n\nI MADE THE INSTRUCTIONS EASY \n\n\nAlcohol 120%, is a powerful Windows CD and DVD burning software that makes it easy to create backups of DVDs* and CDs. Additionaly, the program lets you store your most used CDs as images on your computer, and you can mount them on 1 of the 31 virtual drives with a click of a button.\n\n Our burning software includes a Pre-Mastering function which lets you burn files directly from your hard drive, and supports Blu-ray format and HD DVD.Compatible with all Windows 32 and 64 bit operating systems up to Windows 8. \n\n\nHome users make backup copies of their game CDs and movie DVDs*, allowing the kids to treat multimedia disks roughly, without destroying their value.\n\n\nLibrarians and school administrators use Alcohol 120% burning software to archive their institutions' collections of recordable media, protecting themselves against the daily wear and tear that damages discs.\n\n\nBusiness users use Alcohol 120% burning software to make duplicate backup copies of software titles, ensuring that they will continue to have access to their licensed software, even if their physical CDs become damaged and unusable.\n\n\n\nAlcohol 120% supports a wide range of CD/DVD image files including .mds, .iso, .bwt, .b5t, .b6t, .ccd, .isz, .cue, .cdi, .pdi and .nrg formats.\n\n","torrent":{"xt":"urn:btih:23dc8d7c24f5df2b00a93848e64068848b402e4c","amp;dn":"Alcohol+120%25+2.0.2.4713+Retail+Multilang+-+DeLtASn1p3r","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23dc8d7c24f5df2b00a93848e64068848b402e4c","infoHashBuffer":{"type":"Buffer","data":[35,220,141,124,36,245,223,43,0,169,56,72,230,64,104,132,139,64,46,76]},"announce":[],"urlList":[]}}