{"title":"Nanci Griffith - Ruby's Torch [2006][EAC/FLAC]","uid":10742693,"size":252261164,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:246aae0059eb4f696f94a85d6058ca380b2fe5e7&amp;dn=Nanci+Griffith+-+Ruby%27s+Torch+%5B2006%5D%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"dickspic","files":-1,"time":1407779743,"description":"FLAC / Lossless / Log (100%) / Cue\nLabel/Cat#: Rounder #3265\nCountry: USA\nYear: November 14, 2006\nGenre: americana,folk\nFormat: CD\n\n\n\n\n\n\n(01). When I Dream\n(02). If These Walls Could Speak\n(03). Rubys Arms\n(04). Never Be The Sun\n(05). Bluer Than Blue\n(06). Brave Companion Of The Road\n(07). Grapefruit Moon\n(08). Please Call Me Baby\n(09). Late Night Grande Hotel\n(10). In The Wee Small Hours Of The Morning\n(11). Drops From The Faucet\n\n\n\n\n\nIn her brief liner essay, Nanci Griffith claims that Ruby's Torch -- a collection of torch songs, what else? -- is a &quot;dream come true&quot; and something her listeners have requested over the years. Fair enough, but in typical fashion Griffith has put a spin on these nuggets, only two of which are her own compositions (old ones at that). In addition to &quot;Brave Companion of the Road&quot; and &quot;Late Night Grande Hotel,&quot; there are three songs by Tom Waits (including his classic &quot;Ruby's Arms,&quot; which the album title is adapted from), Jimmy Webb's &quot;If These Walls Could Talk,&quot; Sandy Mason's &quot;When I Dream&quot; (the best-known version is by Willie Nelson, but Crystal Gayle's is better), &quot;Bluer Than Blue&quot; by Randy Goodrum (and a hit by Michael Johnson in the '70s), and &quot;Never Be the Sun&quot; by Donagh Long. In other words, what this amounts to is a recontextualizing of songs not normally in the torch repertoire. There's a great argument for Waits, given his songs' now common treatment by singers in this way. To show the juxtaposition, there is one honest-to-goodness tune from the canon in the David Mann/Bob Hilliard number &quot;In the Wee Small Hours of the Morning,&quot; which headed a concept album in the 1950s by Frank Sinatra after his breakup with Ava Gardner (and was the closer on Griffith's own Clock Without Hands in 2001). Griffith uses her backing band, the Blue Moon Orchestra, as well as full-on string, horn, and woodwind sections. She's recorded in front of an orchestra before -- and not only once. Still, this feels both familiar and ambitious. But this time out she really and truly concentrates on being a singer. Her voice has more discipline, more refinement, and she has made her Texas drawl work for her in the most elegant and intimate way. While is in some ways another of her &quot;heroes&quot; records, it's a singer's record first and foremost. When covering songs in the past, she was highlighting the song first and her ability as a vocalist second. Ruby's Torch places equal significance on singer and song, and given her stylized readings of these tunes through a classic &quot;Texas&quot; sensibility, one can hear some of these songs as a soundtrack heard through the characters of Larry McMurtry's novel The Last Picture Show. While it's true that &quot;Ruby's Arms&quot; is the winner pulling away here -- because while Waits' version is very sad, Griffith's plaintive take is more reportorial and therefore devastating -- everything here works in context, and provides as seamless a record as she's given listeners this century thus far. In its way, this is a renaissance album for both the singer and these songs, though neither were ever hidden anywhere at all. This is the sound of passion, albeit one related by intimacy expressing itself in a dusty mirror. Recommended","torrent":{"xt":"urn:btih:246aae0059eb4f696f94a85d6058ca380b2fe5e7","amp;dn":"Nanci+Griffith+-+Ruby%27s+Torch+%5B2006%5D%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"246aae0059eb4f696f94a85d6058ca380b2fe5e7","infoHashBuffer":{"type":"Buffer","data":[36,106,174,0,89,235,79,105,111,148,168,93,96,88,202,56,11,47,229,231]},"announce":[],"urlList":[]}}