{"title":"Elvis Costello - Everyday I Write The Book","uid":4679589,"size":140115972,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:2532a2e8d255fe19480caf51f6ebc9be69c25711&amp;dn=Elvis+Costello+-+Everyday+I+Write+The+Book&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"2nafish","files":-1,"time":1233023518,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Everyday I Write the Book&quot; is a song from Punch the Clock, an album released in 1983 by Elvis Costello and the Attractions. It was written by Elvis Costello and was a Billboard Top 40 hit in the United Kingdom and the United States. It was Elvis Costello's first hit single in the United States, as well as his biggest. According to one reviewer, Elvis Costello himself is consistently dismissive of the composition despite its success and refers to it as &quot;a bad Smokey Robinson song.&quot;\n\nThe music video for &quot;Everyday I Write the Book&quot; has been called a &quot;classic MTV hit&quot; and features footage of Elvis Costello and the Attractions performing in a studio with backup singers dressed in African clothing and kente cloth headwraps. Footage of Costello and his bandmates performing is mingled with footage showing celebrity lookalikes of Prince Charles and Princess Diana incongruously doing household chores and watching television and in a middle class domicile. Clips of the silent adventure film being watched by Princess Diana are also included in the montage.\n\nWhen Prince Charles appears wielding a rapier and wearing a swashbuckler costume like that of the actors in the silent film, Princess Diana rolls her eyes and returns her attention to the television. Further attempts by Prince Charles to impress his spouse -- including presenting her with a red rose and jumping through a flaming hoop -- are similarly rebuffed as she is more interested in the romances depicted on her television. At one point, Elvis Costello drops two stone tablets similar to those in the classic film The Ten Commandments.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:2532a2e8d255fe19480caf51f6ebc9be69c25711","amp;dn":"Elvis+Costello+-+Everyday+I+Write+The+Book","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2532a2e8d255fe19480caf51f6ebc9be69c25711","infoHashBuffer":{"type":"Buffer","data":[37,50,162,232,210,85,254,25,72,12,175,81,246,235,201,190,105,194,87,17]},"announce":[],"urlList":[]}}