{"title":"[ExploitedCollegeGirls] Lila (11.21.2013)","uid":9366438,"size":481245284,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:25484cf8af1a5b30a0a8c8452a2714112ca70492&amp;dn=%5BExploitedCollegeGirls%5D+Lila+%2811.21.2013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"chkm8te","files":1,"time":1387424337,"description":"[ExploitedCollegeGirls] Lila (11.21.2013)\n\nFrom her long legs and short hair to her small tits and huge sexual appetite, Lila is the perfect ECG girl. She's also in college and broke, which both help. But best of all is her boundless enthusiasm to get fucked on camera. From the moment I fire up the camera she's into it and she doesn't slow down until I blow a huge load inside her.\nLila is a very, very sexual girl and has tried everything from BDSM to public humiliation. After telling me this, she explains that today's shoot will be pretty vanilla by her standards but she'll still do her best. Although, I'm a little suspicious of Lila's perceptive abilities when I ask her what the biggest cock she's ever had is. She holds her hands about 14 inches apart and declares that an 8 inch cock is her biggest. She explains that she knows how to measure things because she's in college. No judgement, but she's clearly lying about one of these things. Of course on her scale I've got a foot long dick, maybe I should go along with this.\nWe wrap up the small talk, because, let's face it even the world's most fascinating 19 year old chick is still a 19 year old chick. Lila strips and reveals a leggy, sexy, athletic bod that gets me hard in no time flat. Before I stick her, however, I should see if I can get a few orgasms out of her. Turns out she's not as hard to figure out as possible, I get her off easily with my fingers and then again with a vibrator.\nYou can tell how sexual Lila is when she starts blowing me. She sits herself down, folds her legs up indian style and works my dick like there's a prize involved. She starts off slow, licking and sucking and by the time I'm fully hard she's letting me face fuck her until her eyes water. If this girl decided to go into porn full time she'd def be a star in short order.\nAfter and EXTENSIVE blowjob, I have Lila ride my cock and this is where her inner nympho really comes out. As soon as she sits her self on my dick she practically starts speaking in tongues. I mean...a 12 inch cock will do that, amirite, heh? Lila has a great pussy and I end up fucking her until I cum. Even though Lila explicitly told me that she's not on the pill, her vagina has some kind of memory loss properties and I bust a huge nut inside her. Thankfully, she must do about 3000 Kegels a day because she manages to push my entire load out, turning an accidental insemination into an awesome creampie.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=fblkfxekfejzs04d8132.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=fblkfxekfejzs04d8132.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=29zlztg06n8232pnvr9e.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=29zlztg06n8232pnvr9e.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:25484cf8af1a5b30a0a8c8452a2714112ca70492","amp;dn":"%5BExploitedCollegeGirls%5D+Lila+%2811.21.2013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25484cf8af1a5b30a0a8c8452a2714112ca70492","infoHashBuffer":{"type":"Buffer","data":[37,72,76,248,175,26,91,48,160,168,200,69,42,39,20,17,44,167,4,146]},"announce":[],"urlList":[]}}