{"title":"Seth Tobocman - War in the Neighborhood (2000)","uid":13092772,"size":1606177853,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:257a942dab31c8b3a611a678d95ccd5f1b234bd7&amp;dn=Seth+Tobocman+-+War+in+the+Neighborhood+%282000%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"warintheneighborhood","files":1,"time":1451072615,"description":"A 328 page graphic novel about the struggles over homelessness, gentrification, police brutality and human rights that raged in the area surrounding New York's Tompkins Square park in the 1980s and 90s. It is a first hand account of the Squatters movement during which abandoned buildings were seized to make low income housing, and then had to be defended within a divided community.\r\n\r\nA squatter, former anarchist punk, social activist and cartoonist, Seth Tobocman lived on Manhattan's Lower East Side and participated in grassroots efforts to take over abandoned tenements in the late '80s and early '90s. Along with a ragtag neighborhood collection of working-class blacks, Puerto Ricans and whites, as well as artists and homeless people from all backgrounds, Tobocman secured affordable housing. As the neighborhood gentrified in the late 1980s, the squats became the center of a housing movement that collapsed under the weight of its diverse membership and unrelenting opposition of real estate developers, police and city government. Tobocman revisits the violent battles with the police, the local characters who organized and rehabbed the squats and the slow disintegration of the movement. He presents the complex infighting among the squatters, who not only were fighting a prevaricating city hall but confronting poverty, paranoia, drug addiction and class conflicts within their own membership. The combination of the stark black-and-white woodcut-style of his drawings and the passion and the brutal honesty of his narration ultimately produces an amazingly compelling story of urban housing","torrent":{"xt":"urn:btih:257a942dab31c8b3a611a678d95ccd5f1b234bd7","amp;dn":"Seth+Tobocman+-+War+in+the+Neighborhood+%282000%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"257a942dab31c8b3a611a678d95ccd5f1b234bd7","infoHashBuffer":{"type":"Buffer","data":[37,122,148,45,171,49,200,179,166,17,166,120,217,92,205,95,27,35,75,215]},"announce":[],"urlList":[]}}