{"title":"Japanese Lit, Study Books, Round 2","uid":3994274,"size":615016647,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:25e9051a38a331e0ac43010d7c533f49d14c8887&amp;dn=Japanese+Lit%2C+Study+Books%2C+Round+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"phalos","files":7,"time":1201222279,"description":"Japanese Lit, Study Books, Round 2\n\n2008-01-24\n\nHere is a followup scan of more Japanese Books for the student.\nNOTE: I apologize for the large sizes. I am not skilled in pdf conversion. If someone can produce a smaller version with same quality, please let me know. This will benefit us all. :)\n\n===\nExploring Japanese Literature: Read Mishima, Tanizaki, and Kawabata in the Original \nBook Description\nYasunari Kawabata, Yukio Mishima and Junichiro Tanizaki are all giants of world literature. It stands to reason that students of Japanese would long to read them in their original language. Exploring Japanese Literature enables them to do just that. Featuring one each of these writers most\ncharacteristic stories - plus linguistic support in the form of a built-in dictionary - the book picks up where the authors previous bestselling text, Breaking into Japanese Literature, left off.\nThe poignancy of romance between a wealthy Tokyoite and a provincial geisha in Yasunari Kawabata&amp;#039;s Snow Country; the ecstatic frenzy of a couple committing ritual suicide in Mishima&amp;#039;s Patriotism; the amoral antics of a playboy aesthete trying to fire up his flagging zest for life in Tanizaki&amp;#039;s The\nSecret-Exploring Japanese Literature is a reader&amp;#039;s entree into the uniquely rich and exotic world of modern Japanese fiction.\nOn each two-page spread, the original Japanese is printed in large type on the left-hand page, with the corresponding English translation on the right and the dictionary running along the bottoms of both. Everything the student needs to read the stories and understand them is right there.\nTo enrich students experience even further, Exploring Japanese Literature also features biographies of the three novelists, mini-prefaces that set the scene for the individual stories, and evocative illustrations. In addition, there is a dedicated website at www.speaking-japanese.com where learners\nhave the chance to put forward their own interpretations of the Japanese and engage in debate with the author, the editor and, of course, other readers of the book.\nExploring Japanese Literature is recommended for upper-intermediate and advanced level students. \n\n===\nKanji in MangaLand: Volume 1\nBook Description\nThe Japanese in MangaLand series from JPT introduced language learners to an innovative, entertaining and educationally-sound way of learning Japanese through the use of manga. Now, this same approach is applied to the often-daunting task of mastering kanji -- the Chinese ideograms in Kanji\nin MangaLand, the first of a 3-volume course covering the 1,006 basic kanji characters.\nAimed at Western students aged 12 25, the Kanji in MangaLand program differs from traditional methods in that it uses distinct drawings for the parts that form each kanji character; then it shows a manga-style illustration to help the student connect the shapes and the meaning. In addition, the\nbooks present information on compound words, stroke order, meaning and such unique features as identifying similar-looking kanji and alternative or older shapes for the same character.\nKanji in MangaLand: Levels 1 &amp; 2 includes 21 lessons. The first seven of these cover all 80 kanji characters learnt by Japanese children in their first primary school year. Lessons 8-21 cover the 160 kanji studied in the next year. In every lesson, the student will learn 8 to 12 kanji and then\nmove on to the exercise section, which features one page of manga using all the characters learnt in that lesson; a page of different types of exercises; and a page with the correct answers, translations and a summary of the new drawing-compounds that will appear in the next lesson. The book also\nhas two special exercise parts one at the end of each level as well as indexes of kanji and reading.\nWith manga sales booming in 2006, they approached $200 million and interest in learning Japanese skyrocketing as well, the Kanji in MangaLand series is the perfect blend of entertainment and solid language instruction to make learning fun and effective.\n\n===\nRead Real Japanese: All You Need to Enjoy Eight Contemporary Writers \nBook Description\nThere is a world of difference between reading Japanese that has been especially concocted for students and reading real Japanese-that is, Japanese written for native speakers. The concocted variety might be called schoolmarm Japanese: standard to the point of insipidity, controlled to the\npoint of domestication, restricted to the point of impoverishment. Read Real Japanese provides the real thing-essays written by lively authors, meant to be enjoyed or pondered over.\nHere are essays informed by the writer&amp;#039;s personality, transformed by the message, moving with the flow of the whole, and shifting with the rhythm of paragraph and sentence. For students needing help, this has been provided in vocabulary lists and notes on usage. The vocabulary contains the English\nequivalents of the Japanese text. The notes deal with subtler matters: with grammar, nuance, idiomatic usage, and the tricky little things that particles do. Whether for pleasure or for serious study, you are sure to find something of interest and value as you read real Japanese.\nThe featured writers are Yoko Mori, Ryuichi Sakamoto, Machi Tawara, Shoichi Nejime, Momoko Sakura, Seiko Ito, Banana Yoshimoto, and Haruki Murakami.\n===\n\nIf you wish to read more Japanese Literature, I may suggest Aozora Bunko, at www.aozora.gr.jp\n\n---\nREQUEST\n---\nI would like to request the full (Japanese) text of &quot;Snow Country&quot; by Yasunari Kawabata.\n","torrent":{"xt":"urn:btih:25e9051a38a331e0ac43010d7c533f49d14c8887","amp;dn":"Japanese+Lit%2C+Study+Books%2C+Round+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25e9051a38a331e0ac43010d7c533f49d14c8887","infoHashBuffer":{"type":"Buffer","data":[37,233,5,26,56,163,49,224,172,67,1,13,124,83,63,73,209,76,136,135]},"announce":[],"urlList":[]}}