{"title":"The Transporter 2(2005)DVDRip.AC3(ENG)-DROCK","uid":6796707,"size":733964180,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:25f672f3d5ec9e6ff531d362b1c144901a6b1aaf&amp;dn=The+Transporter+2%282005%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"drock232","files":-1,"time":1320482124,"description":"Driver and muscle for hire Frank Martin returns in this sequel to the 2002 box-office hit. Frank Martin (Jason Statham) is a former special-forces officer who will transport anything anywhere for a price, and his latest assignment is acting as chauffeur for Jack Billings (Hunter Clary), the young son of politician Jefferson Billings (Matthew Modine), who has garnered no small amount of controversy for his aggressive efforts to stamp out the trade in illegal drugs. One day, Frank is to take Jack to the doctor for a checkup while his mother, Audrey (Amber Valletta), sets up a birthday party for the tyke. However, Jack's doctor is not who he appears to be -- he's actually Dimitri (Jason Flemyng), a Russian agent well versed in viruses who works with criminal kingpin Gianni (Alessandro Gassman). After a long and hard-fought chase with Frank, the bad guys get ahold of little Jack and hold him for ransom. The parents comply with their monetary demands and soon have their son back at home -- but little do they know that the boy has secretly been injected with a deadly and easily spread virus, which the terrorists hope to spread to the boy's powerful father and other politicians whom Jefferson will soon be addressing at a public event. When Frank learns what has happened to young Jack, he sets out to find the culprits -- and the antidote that will save the boy and all others who have been exposed to the virus from dying a painful death -- though his foes have stacked the deck so that it looks as if Frank has been complicit in the crime.\n\nRipped with Hanrbrake.\n\nLength: 1 Hour 27 Minutes\n\nFile Type: MP4","torrent":{"xt":"urn:btih:25f672f3d5ec9e6ff531d362b1c144901a6b1aaf","amp;dn":"The+Transporter+2%282005%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25f672f3d5ec9e6ff531d362b1c144901a6b1aaf","infoHashBuffer":{"type":"Buffer","data":[37,246,114,243,213,236,158,111,245,49,211,98,177,193,68,144,26,107,26,175]},"announce":[],"urlList":[]}}