{"title":"Cory Morrow-Live From Austin, TX (2007-VBR-Country)","uid":4093865,"size":65904243,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:260297ef0c71d00828a92dd1c94251562914ed7d&amp;dn=Cory+Morrow-Live+From+Austin%2C+TX+%282007-VBR-Country%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Cheng","files":15,"time":1206208209,"description":" &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/41RyqIE6UdL._SS300_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/41RyqIE6UdL._SS300_.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/415gXi%2B3OML._SS300_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/415gXi%2B3OML._SS300_.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/51c3C0uXbdL._SS500_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/51c3C0uXbdL._SS500_.jpg&lt;/a&gt;\n\n-=AMG Review=- by Mark Deming\n\nIt&amp;#039;s not an especially good sign when a singer/songwriter releases a live album and the two best songs (by a considerable margin) are the two covers. Cory Morrow is a popular draw in his home state of Texas, enough so to merit an appearance on the long-running PBS roots music showcase Austin City Limits, and this 11-song set was recorded during a 2002 taping for that series. Morrow is often cited as a rising member of the Texas singer/songwriter community, and on his song &quot;Nashville Blues&quot; he name-checks Willie Nelson, Townes Van Zandt, and Kris Kristofferson as influences, but significantly he frequently gigs with Pat Green, and as a songwriter he most closely resembles Green ? which is to say that where his supposed influences are thoughtful and literate, Morrow is often thuddingly obvious. (No matter how much Morrow thinks he&amp;#039;s learned from Townes Van Zandt, Townes would never have written a song like &quot;Texas Time Travelin&amp;#039;&quot; or &quot;Drinkin&amp;#039; Alone.&quot;) Morrow is a good enough singer, he clearly knows how to work a crowd, and his band sounds sharp and enthusiastic on this date (especially Glenn Shankle on Dobro and pedal steel); the audience is with Morrow all the way on Live from Austin, TX, and everyone involved seems to be having a fine time. But the truth is, Morrow sounds best here when he&amp;#039;s singing the Grateful Dead&amp;#039;s &quot;Friend of the Devil&quot; and Waylon Jennings&amp;#039; &quot;Are You Sure Hank Done It This Way?,&quot; largely because on those two songs the material is as good as Morrow&amp;#039;s big-league aspirations for a change. \n\n\n\nCory Morrow - Live From Austin, TX\n\n\nRip Info\n--------\n\nArtist: Cory Morrow\nAlbum Title: Live From Austin, TX\nRecord Label: New West Records\nRip Date: 2008-03-20\nCatalog Number:\nGenre: Country\nYear: 2007\nSource: CD\nEncoder: LAME 3.97 -V2 --vbr-new\nQuality: 170 kbps avg / 44.1KHz / Joint Stereo\n\n\nTrack List\n----------\n\n01 Just Along For The Ride                        9:37\n02 Friend Of The Devil                            3:38\n03 Always And Forever                             4:09\n04 Nashville Blues                                4:30\n05 (Love Me) Like You Used To Do                  3:45\n06 Twenty One Days                                3:55\n07 Drinkin&amp;#039; Alone                                 5:27\n08 Highway                                        3:45\n09 Preacher                                       5:16\n10 Texas Time Travelin&amp;#039;                           4:30\n11 Are You Sure Hank Dont It This Way? (With Pat  3:40\n   Green)\n                                                --------\n                                                00:52:12\n                                                65.74 megs\n\nRip Notes\n---------\n\nFrom the vaults of the award-winning PBS Austin City Limits TV show, this is the\nlatest release in the acclaimed Live From Austin, TX series.\n\nWillie Nelson, Guy Clark, Townes Van Zandt, Lyle Lovett, Cindy Walker, Nanci\nGriffith, Jerry Jeff Walker, Robert Earl Keen, Pat Green... the list of Texas\nsongwriting giants goes on. Joining the club is Cory Morrow, who, like many\nothers before him got his start in Lubbock. This performance from November 22,\n2002, captures Cory shortly after the release of his fourth album, Outside the\nLines. He and Green had earlier recorded an album of cover songs called Songs We\nWish We d Written, which paid tribute to the masters while demonstrating their\nrespect for the past with an eye to what s going on in the present.\n\nMany see Morrow and Green at the forefront of a new youth-oriented Texas country\nscene, but continuing the combination of insightful lyrics and plenty of hooks.\nAs Cory says, To anyone who honors me by listening to my music, I encourage them\nto go out and listen to the artists who are our heroes. When I was growing up, I\nheard the Highwaymen and Robert Earl Keen and really listened to their words and\nmusic. Hopefully a new generation of fans look upon us to carry on this\ntradition and it s something we take seriously.\n","torrent":{"xt":"urn:btih:260297ef0c71d00828a92dd1c94251562914ed7d","amp;dn":"Cory+Morrow-Live+From+Austin%2C+TX+%282007-VBR-Country%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"260297ef0c71d00828a92dd1c94251562914ed7d","infoHashBuffer":{"type":"Buffer","data":[38,2,151,239,12,113,208,8,40,169,45,209,201,66,81,86,41,20,237,125]},"announce":[],"urlList":[]}}