{"title":"Democracy Now - 15 feb 2012","uid":7034277,"size":456884288,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:26b608cfed17db3b7c441a009aea12e69f0cdd3e&amp;dn=Democracy+Now+-+15+feb+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1329325542,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Feb 15, 2012\n\n- NATO Admits to Killing of 8 Afghan Children in Air Strike\n- Eurozone Finance Chiefs Delay Greek Bailout Following Protests\n- Syria: Crackdown Widens as Referendum Date Set\n- Bahraini Forces Target Anniversary Protests, Detain U.S. Human Rights Monitors\n- Hundreds Protest Chinese Abuses Outside White House\n- Prison Fire Kills 272 in Honduras\n- Congress Reaches Tentative Deal on Payroll Tax Cut\n- Hundreds Protest Alabama Anti-Immigrant Law\n- Report: U.S. Voter Rolls Include Names of 1.8 Million Dead\n- Florida Blocks Massive Corporate Prison Plan\n\n\nSpecial reports\n\n- Army Whistleblower Lt. Col. Daniel Davis Says Pentagon Deceiving Public on Afghan War\n\n&quot;Senior ranking U.S. military leaders have so distorted the truth when communicating with the U.S. Congress and American people in regards to conditions on the ground in Afghanistan that the truth has become unrecognizable.&quot; That's the assessment of a damning new report by Army Lt. Col. Daniel Davis who returned in October from his second year-long deployment in Afghanistan and says military officials have misled the American public about how poorly the the decade-long war is going. He argues that local Afghan governments are unable to provide the basic needs of the people and that insurgents control virtually all parts of Afghanistan beyond eyeshot of a U.S. base. We speak with Michael Hastings of Rolling Stone, who obtained a copy of the full report and published it last week. &quot;Lieutenant-Colonel Davis is on the right side of history and the fact [is] that he believes in this and is willing to risk [his career],&quot; Hastings says.\n\n\n- New York Hospitals Saddle Uninsured Patients With Massive Debt Despite Millions in Gov't Aid\n\nAs the ranks of the uninsured continue to rise, a major new study has found that most New York medical centers are violating rules intended to help patients who are uninsured and cannot afford health care. Two-thirds of hospitals studied either violated the law, failed to comply with state guidelines or created additional barriers to financial assistance, despite receiving a combined total of more than $463 million from the state's Indigent Care Pool. We're joined by three guests: Elisabeth Benjamin of the Community Service Society of New York, which conducted the two-year study; Jessica Curtis, the Hospital Accountability Project director at Community Catalyst, who says the problem is not unique to New York; and Hope Rubel, an uninsured patient who was sued some $88,000 in hospital bills by a hospital that took in more than $50 million in aid that same year. &quot;[It] infuriated me that all this money is sitting in these hospitals' bank accounts,&quot; Rubel says.\n\n\n- On 1-Year Anniversary of Wisconsin Uprising, Gov. Walker Fights Recall Effort by Energized Movement\n\nToday marks the first anniversary of the Wisconsin uprising that erupted after Republican Gov. Scott Walker announced plans to eliminate almost all collective bargaining rights for most public workers, as well as slash their pay and benefits. Now, one year later, Walker is in the midst of a recall effort and faces an investigation for campaign corruption. &quot;People have begun to recognize that they shouldn't just wait for elections,&quot; says John Nichols, who covered the protests for The Nation magazine. &quot;They should go to the streets and challenge political power at the point where that power is taking away their rights, or threatening them in some fundamental way.&quot; Nichols is the author of the new book, &quot;Uprising: How Wisconsin Renewed the Politics of Protest, from Madison to Wall Street.&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:26b608cfed17db3b7c441a009aea12e69f0cdd3e","amp;dn":"Democracy+Now+-+15+feb+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26b608cfed17db3b7c441a009aea12e69f0cdd3e","infoHashBuffer":{"type":"Buffer","data":[38,182,8,207,237,23,219,59,124,68,26,0,154,234,18,230,159,12,221,62]},"announce":[],"urlList":[]}}