{"title":"Chamberlain - Fate's Got a Driver (1996) [FLAC]","uid":9262759,"size":208612834,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:272283cb73688bf01034ad397c8fa5c3a2bdf2c1&amp;dn=Chamberlain+-+Fate%27s+Got+a+Driver+%281996%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1385649746,"description":"\n  Chamberlain - Fate's Got a Driver (1996) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Emo, Indie Rock, Alternative\n  Source: CD\n  Codec: FLAC\n  Bit Rate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 Her Side of Sundown\n  02 Street Singer\n  03 Yellow Like Gold\n  04 Five Year Diary\n  05 Uniontown\n  06 Surrendering the Ghost\n  07 Drums and Shotguns\n  08 The Simple Life\n\n  Very much a transitional work from a band that helped pioneer the Midwestern emo craze, Chamberlain's Fate's Got a Driver delivers more emotion in its 30 minutes than most bands do over the course of a career. The record is thought provoking and musically adventurous, a rare feat for a band whose members were barely past twenty when it was recorded. With nods to the Everyman side of Sunny Day Real Estate and the insistent melodicism of Fugazi, Fate's Got a Driver consistently impresses. It's all the product of lead guitarist Adam Rubenstein's thick, Fugazi-style progressions and David Moore's highly poetic lyrics. Rubenstein leads the way on standout tracks like the lockstepping &quot;Yellow Like Gold,&quot; the instantly thumping &quot;Her Side of Sundown&quot; and the gorgeous, acoustic &quot;The Simple Life,&quot; connecting the line between the Police's proto-pop-punk and the D.C. hardcore scene. \n\n  Although he has to strain his voice at times to keep up with the constantly moving melodies, Moore proves to be well-versed in both Dylan Thomas and Bob Dylan, alternating between oblique metaphors (&quot;chance is in her glass house, I know/But I know I'm throwing stones,&quot; he proudly proclaims in &quot;Her Side of Sundown&quot;) and energetic summations of what may lie ahead (&quot;Cause there's a world that I've gotta see/And it quietly waits for me,&quot; later in the same song). The rhythm section provides the cathartic underpinning so crucial to music of this nature. Especially on the incendiary &quot;Drums and Shotguns,&quot; drummer Charles &quot;Wigg&quot; Walker transcends standard-issue hardcore stick work with perfectly placed fills and seamless dynamic shifts. An amazing achievement by such a relatively young band. [The CD was also released with bonus tracks.]","torrent":{"xt":"urn:btih:272283cb73688bf01034ad397c8fa5c3a2bdf2c1","amp;dn":"Chamberlain+-+Fate%27s+Got+a+Driver+%281996%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"272283cb73688bf01034ad397c8fa5c3a2bdf2c1","infoHashBuffer":{"type":"Buffer","data":[39,34,131,203,115,104,139,240,16,52,173,57,124,143,165,195,162,189,242,193]},"announce":[],"urlList":[]}}