{"title":"Coast to Coast AM February 06 2013","uid":8115362,"size":55607205,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:2862ceef3644c5915f3e4de36bf1d9fa22a48bd1&amp;dn=Coast+to+Coast+AM+February+06+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"runcdfirst","files":5,"time":1360281797,"description":"#we.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t02-06-13\nHost: \tGeorge Noory\nGuests: \tAingeal Rose O'Grady, Whitley Strieber\n\nIn the first half, authority on the Akashic records, Aingeal Rose O'Grady, \n\ndiscussed her remarkable ability to access these records which are \n\nreported to contain all knowledge of human experience and the history of \n\nthe cosmos. &quot;I find it interesting that there is this intelligence that \n\ndoes record every minute,&quot; every little detail of life, she said. Further, \n\neach person has their own 'library book,' as it's called, as well as a \n\n'database' which is the record of all the lifetimes a person has led, and \n\ntheir track record for successes and failures during them, she explained. \n\nShe views the records as spiritual in nature, though some have said there \n\nare &quot;holographic crystal discs&quot; that hold this information.\n\nWhen a person dies, they have a life review in which they see and \n\nexperience their affect on others, which helps their spirit achieve \n\nmastery, she said. According to the information she received from &quot;source&quot; \n\n(i.e. the Akashic records), Earth was originally a paradise planet, but \n\nexperienced a fall and moved into denser and denser vibrations. Many of \n\nthe early spirit beings came here a mission to get the planet back on \n\ntrack, and a lot of them are reincarnated now in this lifetime, she \n\nreported. Our old world is dying as a new energy is in the process of \n\nmanifesting on Earth, but we have to go through a kind of birth canal to \n\nget there, which causes a lot of unresolved issues to surface, she pointed \n\nout.\n\n-------------------------------------------------\n\nIn the latter half, author Whitley Strieber talked about a high level of \n\nrecent UFO activity, as well as the potential danger from solar flares. In \n\nhis new ebook, Solar Flares, he explores what could happen to our society \n\nif we were suddenly knocked off the grid by a powerful solar storm. \n\nIncidents back in 1923 and 1859 would have knocked out our power grids, he \n\nnoted. Yet it's not so much that our sun has changed in recent years, it's \n\nthat we have, as a society, become so highly dependent on electricity and \n\nour devices, that a major grid collapse could have catastrophic \n\nconsequences, he commented. While Europe and Canada have made some efforts \n\nto protect their grids, the United States has yet to pass legislation to \n\nmandate this.\n\nStrieber discussed a curious geologic feature in North America dating back \n\n15,000 years called the Black Mat, a layer of material composed of ash and \n\nplankton skeletons. &quot;Something happened that set this continent on \n\nfire...melted the glaciers...and was followed by a flood that stretched \n\nall the way from Colorado to the Atlantic Ocean,&quot; he said, pondering \n\nwhether this kind of extinction event was related to solar flares or \n\nplasma hitting the planet. He also spoke about, how since the middle of \n\n2011, there have been waves of not only UFO sightings, but high \n\nstrangeness events like unexplained sounds and booms heard in multiple \n\nlocations. He shared details of an anomalous aerial object photographed in \n\nWashington DC, as well as UFO incidents in South Texas.\n\nNews segment guests: Stan Deyo, Catherine Austin Fitts\nWebsite(s):\n\n    aingealrose.com\n    unknowncountry.com\n\nBook(s):\n\n    A Time of Change\n    Solar Flares: What You Need to Know\n    The Key\n    The Secret of Orenda\n\n","torrent":{"xt":"urn:btih:2862ceef3644c5915f3e4de36bf1d9fa22a48bd1","amp;dn":"Coast+to+Coast+AM+February+06+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2862ceef3644c5915f3e4de36bf1d9fa22a48bd1","infoHashBuffer":{"type":"Buffer","data":[40,98,206,239,54,68,197,145,95,62,77,227,107,241,217,250,34,164,139,209]},"announce":[],"urlList":[]}}