{"title":"Prison Architect - Alpha 11 (Mac)","uid":8625573,"size":114805022,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:2a1208052837cdadb34955fd0d760f9d0c1e5005&amp;dn=Prison+Architect+-+Alpha+11+%28Mac%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Dwarth","files":1,"time":1372500411,"description":"= Performance improvements &amp; memory leaks\n- Fixed numerous large memory leaks\n- Water simulation significantly optimised\n- Fixed performance bug in object rendering (calling profiler from within inner loop)\n- Rendering soft material edges has been improved and optimised (eg grass growing onto pathway)\n- Rendering garbage bags was sometimes very slow, is now quicker. Weight caption removed\n- Nameplates now fade out as you zoom out (less clutter + quicker to render)\n- Fixed performance bug when ordering large areas of construction\n\n= Land expansion\n- You can now purchase neighbouring plots of land, and thereby expand the area of your prison\n- Must be unlocked by the accountant in the beauracracy screen\n- Expanding to the right of the road is experimental, and is likely to break everything\n\n= TimeLapse recording\nYou can now record a timelapse video of your prison during construction\nUse the Options -&gt; Timelapse menu to set the frame interval and the playback rate of the video\nStart and Stop recording from the main menu\nWhilst recording you will see a red circle icon in the top right of your screen\nNOTE: Timelapse videos will be saved to your PA saves folder, subfolder 'Videos'\nNOTE: We export the videos as OGV (ogg video) format \n\n- Intelligent toolbar highlights\nIcons in the main build toolbar will now highlight when appropriate, based on the rooms visible on screen\nEg if you are looking at a Workshop, the Saw/Press/Table will all highlight.\nEg if you are looking at a row of jail cells, the Bed/Toilet/JailDoor icons will all highlight\n\n- Prisoners now count down their remaining sentence whilst in your jail. \nOnce they have served their full jail term they are automatically released. \nThey will walk to the exit and be allowed to leave by your guards.\nTheir nameplate will flash &quot;RELEASED&quot;\nNOTE: We count down sentences at an accelerated rate - otherwise nobody would ever be released\nNOTE: We do not yet support early release due to Parole \n\n- Guards assigned to a sector will no longer group together at the very centre of the sector. \nInstead they will walk randomly around the sector.\nSimilarly, prisoners assigned to work within a room will now wander around the room if there is \nnothing to do, instead of grouping together at the centre like chumps\n\n- Hearses will now come to your prison to take away your dead bodies (four at a time)\n\n- Dirty clothes will no longer lead to riots\nNot all needs will push prisoners to physical violence\nCurrently Exempt: Clothing, Comfort\nThese needs still prevent those prisoners from feeling &quot;well treated&quot;, but will not push them to anger\n\n- Doctors/Paramedics will now prioritise Guards and Riot Police, and will not heal fighting/rioting prisoners\n\n- Running the game in SAFE MODE now automatically scales the game spritebank down to 2048x2048\nThis should fix the missing/corrupted sprites bugs on some graphics chips (eg Intel HD 3000, Macbook Air etc)\n\n- Prisoners now walk a bit faster when pushing laundry baskets\n\n- Fixed: The clone tool was broken in alpha 10\n\n- Fixed: The doctor/paramedic healing sound was looping forever\n\n- Fixed: The Lockdown claxon would loop forever, annoying everyone who heard it\n\n- Fixed: Prisoners will no longer attempt cleaning jobs in staff only areas (they became stuck when trying)\n\n- Fixed: Prisoners will immediately stop doing a job if their room is set to Staff Only\n\n- Fixed: Prisoners will no longer drop their dirty uniforms in the wall where they can't be retrieved\n\n- Fixed: You no longer need to hire a Doctor before you can create an Infirmary\t","torrent":{"xt":"urn:btih:2a1208052837cdadb34955fd0d760f9d0c1e5005","amp;dn":"Prison+Architect+-+Alpha+11+%28Mac%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a1208052837cdadb34955fd0d760f9d0c1e5005","infoHashBuffer":{"type":"Buffer","data":[42,18,8,5,40,55,205,173,179,73,85,253,13,118,15,157,12,30,80,5]},"announce":[],"urlList":[]}}