{"title":"Imogene Duckworthy Mystery Series - Kaye George","uid":9224616,"size":1887098,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2ace0d869aeac96be9065c1d7d1c84f48d4b54c0&amp;dn=Imogene+Duckworthy+Mystery+Series+-+Kaye+George&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1384988500,"description":"Kaye George, an Agatha nominated short story writer, is the author of the Imogene Duckworthy Mystery series, EINE KLEINE MURDER by Barking Rain Press (Silver Falchion Award finalist 2013), DEATH IN THE TIME OF ICE (A Neanderthal Mystery) ebook only (June 2013), and the Fat Cat Mystery series by Berkley Prime Crime (Fall of 2014) as well as A PATCHWORK OF STORIES, a collection of her previously published stories, several publications available at Untreed Reads. Other short stories appears in various magazines and anthologies.\n\nChoke #1\nTwenty-two-year-old Imogene Duckworthy has been waiting tables at Huey's Hash in tiny Saltlick, TX, itching to jump out of her rut and become a detective. When Uncle Huey is found murdered in his own diner, a half-frozen package of mesquite-smoked sausage stuffed down his throat, Immy, an unwed mother who has always longed to be a PI, gets her chance to solve a real crime.\n\nSmoke #2\nImogene Duckworthy, who yearns to be a PI, has landed a job assisting Mike Mallett in Wymee Falls, Texas. Bringing home a pot-bellied pig as a birthday gift for her daughter, Nancy Drew Duckworthy, Immy discovers the body of the owner of Jerry's Jerky hanging in the smokeroom. Now she has her chance to prove her skills.\n\nBroke #3\nImogene Duckworthy, eager PI assistant, wants to be on her own. She finds a rental house where her four-year-old daughter, Nancy Drew Duckworthy, and Drew's pet pig, Marshmallow, are allowed. The rumors are that the house is haunted. It's no rumor there's a dead man in the bathtub when she inspects the house, though. A long-lost relative is the logical suspect, but can Immy let her Uncle Dewey be railroaded for a crime he, possibly, didn't commit?","torrent":{"xt":"urn:btih:2ace0d869aeac96be9065c1d7d1c84f48d4b54c0","amp;dn":"Imogene+Duckworthy+Mystery+Series+-+Kaye+George","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ace0d869aeac96be9065c1d7d1c84f48d4b54c0","infoHashBuffer":{"type":"Buffer","data":[42,206,13,134,154,234,201,107,233,6,92,29,125,28,132,244,141,75,84,192]},"announce":[],"urlList":[]}}