{"title":"NCRV Dokument - Slapend rijk (deel 1).avi","uid":4699046,"size":265847228,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2c1bddca2101cd457ff77ce3da5593bc1b093c35&amp;dn=NCRV+Dokument+-+Slapend+rijk+%28deel+1%29.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"brief4niels","files":1,"time":1233656719,"description":"Rijk worden door de crisis. Frans Bromet portretteert beleggers voor en tijdens de kredietcrisis.\n\nUitzending:\nMaandag 2 februari 2009, 22:50 uur, Nederland 2\n\n\nKelderende beurskoersen, banken die over de kop gaan en dreigende massaontslagen. Het dagelijkse nieuws wordt beheerst door de gevolgen van de crisis op de financiÃƒÂ«le markten. Veel particuliere beleggers hebben een flink deel van hun vermogen in rook op zien gaan. Een jaar geleden was alles nog rustig en leek het soms wel of je op de beurs slapend rijk kon worden.\n\nIn Slapend rijk volgt Frans Bromet, zelf principieel niet-belegger, een bont gezelschap particuliere beleggers en gaat op zoek naar hun motieven. Terwijl de financiÃƒÂ«le crisis inslaat als een bom, peilt Bromet de emoties. Terwijl de ÃƒÂ©ÃƒÂ©n fors moet inleveren, zorgen de kelderende koersen voor de ander juist voor enorme winsten.\n\nDe Rotterdamse belegger Erik (35), die Bromet niet in zijn flat laat filmen omdat de pizzadozen tot het plafond reiken, leeft van het beleggen en voorspelde de financiÃƒÂ«le crisis ruim voordat deze zich aandient. Hij vreest dat het niet bij een recessie blijft en vertelt dat Nederland in een langdurige economische depressie terecht zal komen. Bromet volgt hoe Erik een miljoen bij elkaar probeert te verdienen zodat hij en zijn familie de crisisjaren kunnen doorstaan.\n\nZakenman AndrÃƒÂ© (59) uit Hoofddorp komt er op een dure manier achter dat zijn vermogensbeheerder niet zorgvuldig omgaat met het geld waar hij zijn hele leven voor heeft gewerkt. Hij zit nu op beleggingsles omdat hij het zelf wil gaan doen.\n\nIrma (51), een vermogende dame uit 't Gooi, stelt dat vrouwen beter beleggen dan mannen. Zij probeert Frans ervan te overtuigen dat beleggen niets met gokken te maken heeft. Frans komt erachter dat haar scherpe analyses haar niet behoeden voor financiÃƒÂ«le debacles.\n\nNCRV Dokument Slapend rijk is een productie van Bromet &amp; Dochters. \n &lt;a href=&quot;\nhttp://info.omroep.nl/ncrv?nav=xpgwGsHtGLLWGkQ&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://info.omroep.nl/ncrv?nav=xpgwGsHtGLLWGkQ&lt;/a&gt;","torrent":{"xt":"urn:btih:2c1bddca2101cd457ff77ce3da5593bc1b093c35","amp;dn":"NCRV+Dokument+-+Slapend+rijk+%28deel+1%29.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c1bddca2101cd457ff77ce3da5593bc1b093c35","infoHashBuffer":{"type":"Buffer","data":[44,27,221,202,33,1,205,69,127,247,124,227,218,85,147,188,27,9,60,53]},"announce":[],"urlList":[]}}