{"title":"Man Thing v2 v3 v4","uid":4290727,"size":166392687,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:2d007f1e1844db433a2470ed2f05d3cffcdd96f3&amp;dn=Man+Thing+v2+v3+v4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"gilgamesh07","files":24,"time":1215888188,"description":"This torrent contains volumes 2 - 4 of Marvel Comics&amp;#039; Man-Thing.\n\nThe Man-Thing is a fictional character in the Marvel Comics Universe, created by writers Stan Lee, Roy Thomas, and Gerry Conway and artist Gray Morrow in Savage Tales #1 (May 1971). He went on to be featured in various titles and in his own series, including Adventure into Fear, which introduced the popular character Howard the Duck. In 2005 Man-Thing was produced as a TV movie for the SciFi Channel.\n\nMan-Thing is a large, slow-moving, vaguely humanoid creature living in the Florida Everglades near the Seminole reservation.\n\nA second Man-Thing series ran 11 issues (Nov. 1979 - Jan. 1981). Writer Michael Fleisher and penciller Mooney teamed for the first three issues, with the letters page of #3 noting that Fleischer&amp;#039;s work had received a great deal of negative criticism and that he had been taken off the book. He was succeeded by, primarily, writer Chris Claremont and illustrators Don Perlin (breakdowns) and Bob Wiacek (finished pencils).\n\nJ.M. DeMatteis began writing the character in a backup story in Man-Thing vol. 2, #9, which opened with a fill-in by Dickie McKenzie. DeMatteis would go on to write Man-Thing stories in Marvel Team-Up, The Defenders, Marvel Fanfare, and the limited series Daydreamers, as well as the eight-issue Man-Thing vol. 3 (Dec. 1997 - July 1998), illustrated by Liam Sharp. The two would re-team for the Man-Thing feature in the two-issue Strange Tales vol. 3 (Sept.-Oct. 1998).\n\nIn the 2000s, Man-Thing has starred in a handful of stories appearing in one-shots and limited series, including Marvel Knights Double Shot #2 (July 2002) and Legion of Monsters: Man-Thing #1 (May 2007).\n\nIn 2008, Roberto Aguirre-Sacasa began a Marvel MAX retelling of his origin in Dead of Night: Man-Thing, hosted by the Digger.\n\nMan-Thing is a former scientist who was transformed into a creature composed of vegetable matter through the synergistic interaction of mystical energy and chemical mutagens. He became a nearly mindless mass of slime with no particular affinity to any living thing, but who nevertheless often becomes an accidental hero as it stumbles upon various crime and horror scenarios. It is able to sense human emotions, and is enraged by fear and automatically secretes a strong chemical corrosive; anyone feeling fear and clutched by the Man-Thing is prone to be burned (either chemically or mystically), hence the series&amp;#039; tag-line, &quot;Whatever knows fear burns at the Man-Thing&amp;#039;s touch.&quot; Though fear is understandably most people&amp;#039;s response to the creature, typically only villains end up meeting an immolating death at its hands.\n\nThe Man-Thing possesses a variety of superhuman powers that are derived from the interaction of the scientific formula created by Ted Sallis and the mystical energies of the Nexus of Realities.\n\nMan-Thing&amp;#039;s superhuman strength varies considerably in his comic book appearances. Initially, the Man-Thing is only slightly stronger than Captain America, but in later appearances, the Man-Thing possesses sufficient superhuman strength to stand toe to toe with much stronger villains.\n\nThe Man-Thing&amp;#039;s body is practically invulnerable to harm. Because his body is not entirely solid, but composed of the muck and vegetative matter of the swamp, fists, bullets, knives, energy blasts, etc. will either pass entirely through him or will harmlessly be lodged within his body. Even if a vast portion of the Man-Thing&amp;#039;s body were to be ripped away or incinerated, he would be able to reorganize himself by drawing the necessary material from the surrounding vegetation.\n\nThe Man-Thing is also able to ooze his body through openings or around barriers that would seem too small for him to pass though. The smaller the opening, the longer it will take for him to reorganize his mass upon reaching the other side.\n\nUnusual psychic and mystical forces react in what passes as the &quot;brain&quot; cells located throughout his body. These unique forces render the Man-Thing extremely sensitive to emotions. Emotions that are mild and generally considered positive arouse curiosity and the Man-Thing will sometimes observe from a distance. However, emotions that are often viewed as negative, such as violent emotions, rage, anger, hatred and fear, cause the Man-Thing great discomfort and might provoke him to attack. Once provoked into violent actions, his body secretes highly concentrated sulfuric acid that can burn human beings to ashes within a matter of seconds. Even individuals that have high levels of superhuman durability have proven unable to withstand this potent acid (except, perhaps the Hulk). While the Man-Thing is devoid of violent emotions, his body produces a type of foamy, soapy mucus that neutralizes the acid.\n\nThe Man-Thing is dependent upon the swamp he inhabits for his continued survival. He is able to leave the swamp, and has done so on many occasions, sometimes for a considerable length of time, although the Man-Thing does not willingly travel outside the environment of his swamp. However, his body will slowly weaken and eventually lapse into dormancy if not returned to the swamp or exposed to clean water. His exposure to the Citrusville waste treatment plant[20] greatly enhanced his ability to leave the swamp.\n\nAlthough the Man-Thing is non-sentient, Ted Sallis possessed a PhD. in biochemistry.\n\n\nFor the complete history of the character see my Man-Thing v1 torrent, what follows continues from there O:-\n\nMan-Thing later first encountered Jude the Entropic Man.[15] Man-Thing then first encountered D&amp;#039;Spayre and Spider-Man.[16] Man-Thing also encountered Doctor Strange, and aided Strange against Baron Mordo.[17]\n\nA scientist, Dr. Oheimer, attempted to restore Ted Sallis&amp;#039;s mind, now scattered about in ganglia throughout Man-Thing&amp;#039;s body. A love triangle then took Man-Thing to the Himalayas. Chris Claremont, the writer by this point, introduced himself as a character in the final issue of Volume 2, as Steve Gerber had in the finale of Volume 1. Additionally, Claremont temporarily became the Man-Thing after being stabbed to death by possessed-Sheriff John Daltry. His and other characters&amp;#039; deaths were later resolved with the intervention of the War is Hell series lead, John Kowalski, now an aspect of Marvel Comics&amp;#039; manifestation of Death. Man-Thing later appeared briefly alongside the superhero Cyclops, aiding him in a battle against the supernatural villain D&amp;#039;Spayre.\n\nMan-Thing became embroiled in a U.S. government conspiracy involving Ted Sallis&amp;#039;s &quot;super-soldier&quot; serum.[18] Later, the extra-dimensional Quagmire came into this reality through the Man-Thing&amp;#039;s body.[19]\n\nThanks to the scanners and and to the shiverman and 1stKnight for their contributions to help me complete the collection.\n\nPlease seed. Please enjoy.","torrent":{"xt":"urn:btih:2d007f1e1844db433a2470ed2f05d3cffcdd96f3","amp;dn":"Man+Thing+v2+v3+v4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d007f1e1844db433a2470ed2f05d3cffcdd96f3","infoHashBuffer":{"type":"Buffer","data":[45,0,127,30,24,68,219,67,58,36,112,237,47,5,211,207,252,221,150,243]},"announce":[],"urlList":[]}}