{"title":"Blackwell 1-3 Android","uid":11318180,"size":638241761,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:2d1a9bd3893ddfe9b50aff3abef1f8d0983e7e6c&amp;dn=Blackwell+1-3+Android&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":".BONE.","files":-1,"time":1414570638,"description":"Blackwell 1: Legacy v1.1\nRequirements: 2.3 and up\nOverview: When Rosa Blackwell's aunt Lauren dies after twenty years in a coma, \n\nRosa thinks the worst is over. This all changes when Joey Mallone, a sardonic ghost from the 1930s, blows into her life and tells her that she is a medium with a family legacy to uphold (whether she likes it or not). And when a series of suicides occur at a local university, Rosa - still coming to terms with her new responsibilities - finds herself an unwilling detective in this gruesome mystery.\n\nThis app has no advertisements\n\nBlackwell 2: Unbound v1.1\nRequirements: 2.3 and up\nOverview: The year is 1973. The sound of a lone, ethereal saxophone drifts over the Roosevelt Island promenade, while a series of accidents plague a midtown construction site. \n\nhe citizens of Manhattan take no notice of these events, let alone think they are connected. Embittered medium Lauren Blackwell and her spirit guide Joey Mallone are the only ones who believe that there is anything strange going on, and they are the only ones who can stop an enigmatic killer from striking again...\n\nThis app has no advertisements\n\nBlackwell 3: Convergence v1.1\nRequirements: 2.3 and up\nOverview: A new film opens to rave reviews, despite its bloody history. \n\nA beautiful uptown office remains unoccupied, despite its prime location. A downtown artist berates himself for selling out, while a Wall Street investor congratulates himself on a job well done. Just normal life in the big city? Or is something more sinister binding these events together? Bizarre connections are a dime a dozen for the Blackwell family, but just how far back to they go? Medium Rosa Blackwell and her spirit guide Joey Mallone are about to find out.\n\nThis app has no advertisements","torrent":{"xt":"urn:btih:2d1a9bd3893ddfe9b50aff3abef1f8d0983e7e6c","amp;dn":"Blackwell+1-3+Android","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d1a9bd3893ddfe9b50aff3abef1f8d0983e7e6c","infoHashBuffer":{"type":"Buffer","data":[45,26,155,211,137,61,223,233,181,10,255,58,190,241,248,208,152,62,126,108]},"announce":[],"urlList":[]}}