{"title":"Tower of Basel (2013) Adam LeBor (multi) ","uid":9421989,"size":2822979,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2d437740f40685119295327633394dc8c17c0456&amp;dn=Tower+of+Basel+%282013%29+Adam+LeBor+%28multi%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"7","files":-1,"time":1388606586,"description":"Tower of Basel: The Shadowy History of the Secret Bank that Runs the World (2013) Adam LeBor (multi) \n\n\nTower of Basel: The Shadowy History of the Secret Bank that Runs the World by Adam LeBor\n\n\nFormat: mobi/epub/azw3\nLength: 360 pages\nGenre: Non-Fiction/Banking/Economics\nDate: 28 May 2013\n\nTower of Basel is the first investigative history of the world's most secretive global financial institution. Based on extensive archival research in Switzerland, Britain, and the United States, and in-depth interviews with key decision-makers - including Paul Volcker, the former chairman of the US Federal Reserve; Sir Mervyn King, governor of the Bank of England; and former senior Bank for International Settlements managers and officials - Tower of Basel tells the inside story of the Bank for International Settlements (BIS): the central bankers' own bank.\n\nAfter 1945 the BIS - still behind the scenes - for decades provided the necessary technical and administrative support for the trans-European currency project, from the first attempts to harmonize exchange rates in the late 1940s to the launch of the Euro in 2002. It now stands at the center of efforts to build a new global financial and regulatory architecture, once again proving that it has the power to shape the financial rules of our world. Yet despite its pivotal role in the financial and political history of the last century and during the economic current crisis, the BIS has remained largely unknown - until now.\n\nAuthor:\n\nI am a British author and journalist. I've written eight non-fiction books and two novels including the ground-breaking Hitler's Secret Bankers, which exposed Swiss economic complicity with Nazi Germany and which was shortlisted for the Orwell Prize; a biography of Slobodan Milosevic, now regarded as the standard work on his life and City of Oranges, which recounts the lives of Arab and Jewish families in Jaffa, and which was shortlisted for the Jewish Quarterly Prize. ","torrent":{"xt":"urn:btih:2d437740f40685119295327633394dc8c17c0456","amp;dn":"Tower+of+Basel+%282013%29+Adam+LeBor+%28multi%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d437740f40685119295327633394dc8c17c0456","infoHashBuffer":{"type":"Buffer","data":[45,67,119,64,244,6,133,17,146,149,50,118,51,57,77,200,193,124,4,86]},"announce":[],"urlList":[]}}