{"title":"Erik Ringmar, I'm Blogging This","uid":3899043,"size":745860,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2f81fc31a7db7052d78ff1e21773c35f746b2426&amp;dn=Erik+Ringmar%2C+I%5C%27m+Blogging+This&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"snurk","files":1,"time":1195462193,"description":"There was never such a thing as freedom of speech. In order to speak freely you had to have access to a printing press, a newspaper, a radio or a TV station. And everywhere you had to get past the editors. Only an elite ever did ? the articulate and well-behaved representatives of ordinary people. But ordinary people themselves never had a chance to speak publicly.\n\nNot until now. Today the internet revolution ? led by a ragtag army of bloggers ? has given us all a chance to be irreverent, blasphemous and ungrammatical in public. We can reveal secrets, blow whistles, spill beans, or just make stuff up.\n\nOf course the old elites don?t like it. Of course they really, really hate it. Blogs are shut down left, right and center, and bloggers are silenced, reprimanded and fired from their jobs. Suddenly modern liberal society reveals a repressive face few of us knew existed.\n\nShould we behave ourselves? Should we fall silent? Hell no! Let?s call them on their hypocrisy. Let?s demand that modern liberal society lives by the principles it claims to embrace. Bloggers of the world, unite! You have nothing to lose but your gags.","torrent":{"xt":"urn:btih:2f81fc31a7db7052d78ff1e21773c35f746b2426","amp;dn":"Erik+Ringmar%2C+I%5C%27m+Blogging+This","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f81fc31a7db7052d78ff1e21773c35f746b2426","infoHashBuffer":{"type":"Buffer","data":[47,129,252,49,167,219,112,82,215,143,241,226,23,115,195,95,116,107,36,38]},"announce":[],"urlList":[]}}