{"title":"Bormann-Planet of slaves+Witch hunt in 20th century(2003)","uid":4675491,"size":4417510,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2ffba6be2ff7cb136c070a4dfebcf7309f17f6ff&amp;dn=Bormann-Planet+of+slaves%2BWitch+hunt+in+20th+century%282003%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1232889298,"description":"This is an amazing collection of Matthias Bormann's books and writings that includes Planet of the slaves (2003, english, german, french, italian, spanish translation), Witch hunt in the 20th century (english, german, french translation), Die Fabula Politina (2003, only german) and Das geheime Wissen der mattoistischen Priester (only german). Planet of the slaves discusses the role of various media in the process of enslaving the population through projecting false reality into their minds. Furthermore it explains how we are fed poisonous substances in the name of health. Witch hunt in the 20th century presents the methods of &quot;witch hunters&quot; of the 20th century. Can you imagine that you lost your job only because you had a different opinion? Can you imagine that after a murder has occured everyone &quot;knows&quot; who the murderer was although he is later found innocent? Can you imagine suicides that aren't suicides at all since somebody &quot;helped&quot; the victim? And what about power groups that are trying to make us all equal and why exactly do things on this planet go so wrong all the time? Die Fabula Politina compares the world of politics to world of animals and explains that as long as they will think as animals they will be exactly that - animals. Das geheime Wissen der mattoistischen Priester talks about the art of self-liberation and also discusses some basic questions like who I am and where do I come from. Although the books talk about the horrible reality of this planet, the author stays positive and concludes that everyone has a chance to change something to the better. Hundreds of pages alltogether. A must read for everyone.\n","torrent":{"xt":"urn:btih:2ffba6be2ff7cb136c070a4dfebcf7309f17f6ff","amp;dn":"Bormann-Planet+of+slaves%2BWitch+hunt+in+20th+century%282003%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ffba6be2ff7cb136c070a4dfebcf7309f17f6ff","infoHashBuffer":{"type":"Buffer","data":[47,251,166,190,47,247,203,19,108,7,10,77,254,188,247,48,159,23,246,255]},"announce":[],"urlList":[]}}