{"title":"Tiesto feat. Sneaky Sound System - I Will Be Here (2nafish)","uid":5339816,"size":156385284,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:303c984408b2d1011d8602dc2d08e0f2a4de008a&amp;dn=Tiesto+feat.+Sneaky+Sound+System+-+I+Will+Be+Here+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1265435800,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;I Will Be Here&quot; is a song recorded by TiÃƒÂ«sto and Sneaky Sound System with vocals from Sneaky Sound System's Connie Mitchell. Released on July 28, 2009, the song is the first single off the album Kaleidoscope.\n\nThe music video for &quot;I Will Be Here&quot; premiered on TiÃƒÂ«sto's MySpace on August 7, 2009. TiÃƒÂ«sto teamed up with acclaimed Japanese director Muto to create the music video for &quot;I Will Be Here&quot;, a collaboration with Sneaky Sound System. It begins with a man working on a single computer in a lab, while the screens begin to display TiÃƒÂ«sto and Sneaky Sound System logos. He puts on a single speaker &quot;backpack,&quot; hooked up to a &quot;TiÃƒÂ«sto&quot; cassette player, and presses play. As the music starts, he begins to walk in a robotic fashion, as the computer screens all flicker and switch to the same logos as he leaves the lab. All the lights around him begin to pulsate he walks by, synchronized with the music, while the blue stripes on his white spacesuit outfit also show different light animations. Exiting through a parking deck, he eventually makes his way through Shibuya, Tokyo, and does one final dance in the middle of the famous intersection in front of the Hachiko exit at Shibuya Station, before going to the top of a building, where he &quot;powers down&quot; as the music ends.\n\nIn the United States, the single became their first number one single for both acts on Billboard's Hot Dance Airplay chart, where it reached that peak in its November 21, 2009 issue.\n\nKaleidoscope is the fourth studio album by Dutch trance artist TiÃƒÂ«sto, released on October 6, 2009 on Musical Freedom, TiÃƒÂ«sto's new label in association with PIAS Recordings. The album contains collaborations with Nelly Furtado, Emily Haines of Metric, Tegan and Sara, JÃƒÂ³nsi of Sigur RÃƒÂ³s, Kele Okereke of Bloc Party, and Calvin Harris among others.\n\nThe album also features the song &quot;I Will Be Here&quot; with Australian dance act Sneaky Sound System, which was released as the lead single on July 28, 2009. The album entered the Dutch album charts at number 2. It also debuted at number 20 on the UK album charts and at number 5 on the lrish album charts.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:303c984408b2d1011d8602dc2d08e0f2a4de008a","amp;dn":"Tiesto+feat.+Sneaky+Sound+System+-+I+Will+Be+Here+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"303c984408b2d1011d8602dc2d08e0f2a4de008a","infoHashBuffer":{"type":"Buffer","data":[48,60,152,68,8,178,209,1,29,134,2,220,45,8,224,242,164,222,0,138]},"announce":[],"urlList":[]}}