{"title":"Plane Crazy full game 1998","uid":6597793,"size":255336977,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3164101b7d64149932c230a0535db6362ffb8c77&amp;dn=Plane+Crazy+full+game+1998&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"maul485","files":-1,"time":1313086366,"description":"Plane Crazy, 1998\n\nwiki -&gt; http://en.wikipedia.org/wiki/Plane_Crazy_%28video_game%29\n\nIn Plane Crazy the player pilots a fast, cartoon plane, build for speed across a variety of levels against seven other opponents. The objective of each level is to make it to the finish as fast as possible and try to finish first. There is also a set time where players must fly through checkpoints. If they fail the plane will veer out of control and crash.\n\nPlanes explode when they come into contact with structures and landscape. They then respawn, invincible for a few seconds. There are three types of planes: the light and fast plane that cannot take much damage, the evenly balanced plane and the heavy plane which is slower but can take more punishment. Each of these planes could be upgraded and customized. Nine different levels are included, each with their own themes, songs, and styles. Settings include a canyon, a dock, a jungle and a city.\n\nThroughout each map there are blue vortexes give a random temporary buff or weapon to the plane. These powerups give players an advantage such as the Black Cat, which grants invincibility for a short time, Rocket Boosts, which increase the plane\\'s speed for a small amount of time, or a Missile which would fire at a random target. Each plane is also given three blue missiles which can be used to trigger environmental hazards or shortcuts. Plane Crazy features online play, using the Heat.net multiplayer gaming system. It allows eight players on one server at one time.\n\n/+*-/+*-/+*-/+*-/+*-/+*-/+*-/+*-/+*-/+\n\n\nFROM README\n\nPlane Crazy ReadMe - (c) Inner Workings March 1998\n\n* Installation\n\nSoftware protection: In order to play Plane Crazy you must have the\ndisc loaded in your CD-ROM drive.\n\nPut the CD in the CD-Rom drive and from the Autorun screen choose\nlanguage and follow the on screen instructions.  After installation,\nselect PLAY from the Autorun screen.\n\n/+*-/+*-/+*-/+*-/+*-/+*-\n\nmount and install. i do not believe this is the version that needs to be unaced. i dld\\'ed this awhile ago along with several other versions, and all i remember is that this is the version i got to work :)","torrent":{"xt":"urn:btih:3164101b7d64149932c230a0535db6362ffb8c77","amp;dn":"Plane+Crazy+full+game+1998","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3164101b7d64149932c230a0535db6362ffb8c77","infoHashBuffer":{"type":"Buffer","data":[49,100,16,27,125,100,20,153,50,194,48,160,83,93,182,54,47,251,140,119]},"announce":[],"urlList":[]}}