{"title":"Indiana Jones And The Kingdom Of The Crystal Skull (2008)","uid":5523873,"size":838815744,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3312fed27242e128c7e477d75b25eeb0571398e1&amp;dn=Indiana+Jones+And+The+Kingdom+Of+The+Crystal+Skull+%282008%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Rietjuhh","files":-1,"time":1272672191,"description":"Het verhaal begint wanneer de Sovjets in de jaren vijftig een militaire basis in de Verenigde Staten overvallen. De groep wordt door de Sovjet-commandant Irina Spalko geleid. Indiana Jones, die, samen met zijn handlanger Mac door hen is ontvoerd, moet namelijk voor hen een artefact vinden. Dit bevindt zich in een houten kist in hetzelfde enorme magazijn waar ook de Ark Des Verbonds wordt verborgen. Aangezien de inhoud zeer magnetisch is, lukt het Jones met behulp van kogels als kompas en buskruit het object snel te vinden. Mac blijkt een verrader te zijn, en de Sovjets willen Jones doden, maar die weet op vernuftige wijze te ontsnappen.\n\nDoor zijn contact met Mac wordt Jones door de FBI in de gaten gehouden. Hij wordt ontslagen, en besluit naar Europa te gaan. Voordat hij vertrekt, komt &quot;Mutt&quot; naar hem toe.\n\nMutt, die eigenlijk ook Henry heet, en de zoon van Indiana Jones is (hoewel die nooit te horen heeft gekregen dat hij een zoon heeft bij zijn oude geliefde Marion Ravenwood.), vraagt hem om hulp. Mutt vertelt dat zijn moeder samen met Harold Oxley, met wie Indiana ooit gestudeerd heeft, is ontvoerd door de KGB. Dit nadat Oxley in Peru een schedel heeft gevonden van onbekend, op kristal lijkend metaal met hoog magnetische eigenschappen. Om onbekende redenen had Oxley de schedel teruggebracht naar zijn vindplaats voordat de Sovjets hem ontvoerden.\n\nIndiana en Mutt reizen af naar Peru om de schedel van Oxley te vinden. Wanneer deze door iemand teruggebracht wordt naar El Dorado, (letterlijk: de stad van goud) zal deze persoon volgens voorspellingen over ongekende krachten komen te beschikken. Maar wanneer Indiana en Mutt de schedel hebben gevonden, worden zij gevangen door de Sovjets.\n\nIndiana Jones en Mutt weten tezamen met de ontvoerde Ravenwood en Oxley te ontsnappen aan de Sovjets na een autoachtervolging. Tijdens die achtervolging ontdekt Jones eenmaal dat Mutt zijn zoon is. Het viertal reist dan met de kristallen schedel af naar El Dorado, gevolgd door de Sovjets. Eenmaal in El Dorado aangekomen blijkt dat de gebouwen niet uit massief goud zijn opgetrokken. Het woord voor &quot;goud&quot; blijkt namelijk in een dode taal (Maya's) &quot;rijkdom&quot; te betekenen, want voor de Maya's hield het woord &quot;El Dorado&quot; kennelijk rijkdom van kennis in.\n\nIn de tempel van El Dorado vindt het viertal 13 skeletten van buitenaardse wezens waarvan bij ÃƒÂ©ÃƒÂ©n skelet de schedel ontbreekt. Door het magnetisme van de schedel en van de botten wordt het skelet met zijn schedel herenigd. Op dat moment komen de Sovjets binnenvallen. Door de skeletten ontstaat er een portaal naar een andere dimensie, waardoor de tempel begint in te storten. Spalko eindigt ermee zoveel kennis te absorberen van de skeletten dat ze sterft. Indiana Jones, Mutt, Ravenwood en Oxley hebben net op tijd de tempel kunnen verlaten. Buiten zien ze hoe de tempel instort, een UFO tevoorschijn komt die naar een andere dimensie verdwijnt. De Sovjets echter worden bedolven onder het puin of verdwijnen in het portaal naar de andere dimensie. Jones omhelst zijn Marion en vaderlijke gevoelens voor zijn opvolger Mutt beginnen naar boven te komen. De film eindigt wanneer Indiana Jones en Marion Ravenwood trouwen.\n\nveel plezier met deze film!!\n\nGroeten Rietjuhh","torrent":{"xt":"urn:btih:3312fed27242e128c7e477d75b25eeb0571398e1","amp;dn":"Indiana+Jones+And+The+Kingdom+Of+The+Crystal+Skull+%282008%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3312fed27242e128c7e477d75b25eeb0571398e1","infoHashBuffer":{"type":"Buffer","data":[51,18,254,210,114,66,225,40,199,228,119,215,91,37,238,176,87,19,152,225]},"announce":[],"urlList":[]}}