{"title":"Dave Miller Trio &amp; Rebecca DuMaine - 2014 - Better Than Anyt","uid":10636201,"size":346785719,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:335b9ccf7da49daa054c623d1d9976f6b8b6edfe&amp;dn=Dave+Miller+Trio+%26amp%3B+Rebecca+DuMaine+-+2014+-+Better+Than+Anyt&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eika256","files":-1,"time":1406391800,"description":"Dave Miller Trio &amp; Rebecca DuMaine - 2014 - Better Than Anything\n\nSmart. Simple. Confident. Competent. These are just four descriptors that apply to Rebecca DuMaine's recital with the Dave Miller Trio entitled Better Than Anything. DuMaine and Miller assemble a recital of fifteen standards and near standards that nominally orbit the specters of Bob Haymes, Antonio Carlos Jobim and Leonard Bernstein, who each provide two songs to the mix. DuMaine and Miller's chemistry as one would expect from a daughter-father collaboration. The pair released Deed I Do (Summit Records, 2012), establishing the rich vein of music Americana they would continue to perfect on the present recording.\nAnd, Better Than Anything, like the previous recording is very listenable. But is there anything that separates it from the deluge of similar recordings clotting what by all indications should be an ever shrinking marketplace? The answer is a cautious yes. DuMaine possesses a durable, no-nonsense voice perfectly suited to her song choices. &quot;Better Than Anything&quot; is fresh and sharp, betraying what must be a facile talent for vocalese. Miller and his solid trio provided just the necessary support, while soloing sensibly.\nDuMaine is quite comfortable with Leonard Bernstein's show tunes, dispatching &quot;It's Love&quot; and &quot;Lucky To Be Me&quot; with mirth and aplomb. It is to DuMaine's credit that she places the Bernstein beside the Jobim (&quot;No More Blues&quot; and &quot;Dreamer&quot;) showing how tuneful and similar the two composers were. Better Than Anything is that unadorned jazz singing that must be revisited if only to remind us of what the songs were supposed to sound like to begin with. Creative progress and evolution are fine and necessary if we don't forget from where we have come. Rebecca DuMaine does her part preventing that. (AllAboutJazz)\n\nTrack list:\n01 Better Than Anything\n02 You for Me\n03 Sometime Ago\n04 Oh, Look at Me Now\n05 No More Blues\n06 What Is There to Say\n07 I'm Gonna Go Fishin'\n08 Telephone Song\n09 I Just Found out About Love\n10 It Might as Well Be Spring\n11 Cheek to Cheek\n12 It's Love\n13 Dreamer\n14 Lucky to Be Me\n15 That's All\n\nPersonnel:\nRebecca DuMaine: vocals; \nDave Miller: piano; \nMario Suraci: bass; \nBill Belasco: drums\n\nEnjoy and share!","torrent":{"xt":"urn:btih:335b9ccf7da49daa054c623d1d9976f6b8b6edfe","amp;dn":"Dave+Miller+Trio+%26amp%3B+Rebecca+DuMaine+-+2014+-+Better+Than+Anyt","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"335b9ccf7da49daa054c623d1d9976f6b8b6edfe","infoHashBuffer":{"type":"Buffer","data":[51,91,156,207,125,164,157,170,5,76,98,61,29,153,118,246,184,182,237,254]},"announce":[],"urlList":[]}}