{"title":"Theory of Moral Development - Lawrence Kohlberg - Excerpts","uid":8222371,"size":620722,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:36b4b7130d3f56e7a229ad63a6b8d00c57475260&amp;dn=Theory+of+Moral+Development+-+Lawrence+Kohlberg+-+Excerpts&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"UnviolentPeacemaker","files":3,"time":1362506026,"description":"Excerpts from Kohlberg's books\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Lawrence_Kohlberg%27s_stages_of_moral_development&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Lawrence_Kohlberg%27s_stages_of_moral_development&lt;/a&gt;\n\nFrom Wikipedia, the free encyclopedia\nJump to: navigation, search\n\nLawrence Kohlberg's stages of moral development constitute an adaptation of a psychological theory originally conceived by the Swiss psychologist Jean Piaget. Kohlberg began work on this topic while a psychology postgraduate student at the University of Chicago[1] in 1958, and expanded and developed this theory throughout his life.\n\nThe theory holds that moral reasoning, the basis for ethical behavior, has six identifiable developmental stages, each more adequate at responding to moral dilemmas than its predecessor.[2] Kohlberg followed the development of moral judgment far beyond the ages studied earlier by Piaget,[3] who also claimed that logic and morality develop through constructive stages.[2] Expanding on Piaget's work, Kohlberg determined that the process of moral development was principally concerned with justice, and that it continued throughout the individual's lifetime,[4] a notion that spawned dialogue on the philosophical implications of such research.[5][6]\n\nFor his studies, Kohlberg relied on stories such as the Heinz dilemma, and was interested in how individuals would justify their actions if placed in similar moral dilemmas. He then analyzed the form of moral reasoning displayed, rather than its conclusion,[6] and classified it as belonging to one of six distinct stages.[7][8][9]\n\nThere have been critiques of the theory from several perspectives. Arguments include that it emphasizes justice to the exclusion of other moral values, such as caring;[10] that there is such an overlap between stages that they should more properly be regarded as separate domains; or that evaluations of the reasons for moral choices are mostly post hoc rationalizations (by both decision makers and psychologists studying them) of essentially intuitive decisions.[11]\n\nNevertheless, an entirely new field within psychology was created as a direct result of Kohlberg's theory, and according to Haggbloom et al.'s study of the most eminent psychologists of the 20th century, Kohlberg was the 16th most frequently cited psychologist in introductory psychology textbooks throughout the century, as well as the 30th most eminent overall.[12]\n\nKohlberg's scale is about how people justify behaviors and his stages are not a method of ranking how moral someone's behavior is. There should however be a correlation between how someone scores on the scale and how they behave, and the general hypothesis is that moral behaviour is more responsible, consistent and predictable from people at higher levels.[13]\n\n","torrent":{"xt":"urn:btih:36b4b7130d3f56e7a229ad63a6b8d00c57475260","amp;dn":"Theory+of+Moral+Development+-+Lawrence+Kohlberg+-+Excerpts","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36b4b7130d3f56e7a229ad63a6b8d00c57475260","infoHashBuffer":{"type":"Buffer","data":[54,180,183,19,13,63,86,231,162,41,173,99,166,184,208,12,87,71,82,96]},"announce":[],"urlList":[]}}