{"title":"Gaebelein-Conflict of Ages(origins of revolutionary movements)(1","uid":4645801,"size":783487,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:36d0668480d119436660d9ead45f5cd576feb8f1&amp;dn=Gaebelein-Conflict+of+Ages%28origins+of+revolutionary+movements%29%281&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"red_gonzo","files":1,"time":1231876606,"description":"This is Arno Clemens Gaebelein's mindblowing book The Conflict of the Ages - The Mystery of Lawlessness -  Its Origin, Historic Development and Coming Defeat (1988) which attempts to identify the origins and historic development of revolutionary movements that throughout history resulted in massive lawlessness and rebellions all across the globe. As can be seen on the reverse side side of US seal, the influence of Illuminism and its various offsprings like Communism, Nazism and Zionism extended far across the world and attracted numerous individuals who were and still are secretly working to bring an end to the old order of things in order to establish a new order of ages. The author traces history of such revolutionary movements hundreds of years back even before the advent of the Illuminati and similar orders. Their history is as enigmatic as it can possibly be, their actions always result in rebellions against the powers that be and are especially hostile against any religion and worship of god or other heavenly authority. A godless and extremely tyrannical order is planned where each individual shall be under the dominion of the gestapo-like all-seeing eye. All kinds of methods shall be used to tear apart the fabric of society that rests on family, state and belief in god. Although much of the plan has already been realized when this book first appeared in 1934 the author sees the end of world and of history not in things like the marxist revolution but in Jesus Christ the redeemer. As Gaebelein carefully describes the continuing conflict he concludes that a defeat of revolution is planned at the very end of it. He also reveals that many founding fathers of American revolution were ardent illuminists and have therefore created America not as Christian nation but as a citadel of world revolution. This uncut, unedited and uncensored version of The Conflict of the Ages reveals the truth and throws tight on the evil deeds and plans of those who still conspire against Christ, Christians and Christianity. 170 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:36d0668480d119436660d9ead45f5cd576feb8f1","amp;dn":"Gaebelein-Conflict+of+Ages%28origins+of+revolutionary+movements%29%281","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36d0668480d119436660d9ead45f5cd576feb8f1","infoHashBuffer":{"type":"Buffer","data":[54,208,102,132,128,209,25,67,102,96,217,234,212,95,92,213,118,254,184,241]},"announce":[],"urlList":[]}}