{"title":"Applied Thin-Layer Chromatography 2nd ed","uid":14881961,"size":23566823,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3707d07f29d8694d4cb05f137298469a8e005439&amp;dn=Applied+Thin-Layer+Chromatography+2nd+ed&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1465695649,"description":"Applied Thin-Layer Chromatography - Best Practice and Avoidance of Mistakes 2nd ed - Elke Hahn-Deinstrop (Wiley-VCH, 2007).pdf\r\n\r\nISBN 978-3-527-31553-6\r\n\r\nThin-layer chromatography (TLC) is a powerful, fast and inexpensive analytical method. It has proven its usefulness in pharmaceutical, food and environmental analysis. This new edition of the practical TLC guide features a completely revised chapter on documentation, now including the use of digital cameras. Selected new sorbents and instruments are also introduced.\r\nWhy has the prior edition been successful? All steps of the analytical procedure are clearly explained, starting with the choice of a suitable TLC technique and ending with data evaluation and documentation. Special emphasis is put on the proper choice of materials for TLC. Properties and functions of various materials and the TLC equipment are described, covering e. g. precoated layers, solvents and developing chambers, including information on suppliers. Many practical hints for trouble shooting are given. All this is illustrated with numerous coloured figures.\r\nHow to use TLC in compliance with GLP/GMP regulations is described in detail, including the required documentation. Therefore the reader can very easily compile his own standard operating procedures","torrent":{"xt":"urn:btih:3707d07f29d8694d4cb05f137298469a8e005439","amp;dn":"Applied+Thin-Layer+Chromatography+2nd+ed","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3707d07f29d8694d4cb05f137298469a8e005439","infoHashBuffer":{"type":"Buffer","data":[55,7,208,127,41,216,105,77,76,176,95,19,114,152,70,154,142,0,84,57]},"announce":[],"urlList":[]}}