{"title":"Liar Liar(1997)DVDRip.AC3(ENG)-DROCK","uid":6558115,"size":733042221,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3750edf7ee76cceb10cf9a18e3cf51f6676831c9&amp;dn=Liar+Liar%281997%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"drock232","files":-1,"time":1311356268,"description":"An attorney who tells the truth for 24 hours straight? This has got to be the movies! Fletcher Reede (Jim Carrey) is a lawyer obsessed with his career, and he's devoted his life to bending the truth to his advantage. This habit has broken up his marriage to Audrey (Maura Tierney) and isn't doing much good for his relationship with his young son Max (Justin Cooper). Fletcher repeatedly promised Max that he'll be there for Max's eighth birthday party, but when an important assignment comes up at work, Fletcher calls Audrey and makes an excuse so flimsy that even Max can see through it. When it comes time to blow out the candles on his cake, Max makes a wish: that his Dad could go just one day without telling a lie. Suddenly, Max finds himself physically incapable of saying anything that isn't true -- which, given the divorce settlement case he's just been handed, is going to make his next day in court very interesting indeed. While designed to show off a warmer and more likable side of Jim Carrey's personality, Liar Liar still revels in the broad physical comedy that made Carrey a star in Ace Ventura, Pet Detective -- which makes sense, since both were directed by Tom Shadyac. Both Carrey's fans and foes will get a chuckle out of Swoosie Kurtz's tongue-in-cheek insult to the film's star in the blooper reel that runs under the final credits.\n\nRipped with Handbrake.\n\nLength: 1 Hour 27 Minutes\n\nFile Type: MP4\n\nFrame Width: 720\n\nFrame Height: 400\n\nFrame Rate: 23fps\n\nAudio\n\nBit Rate: 159kbps","torrent":{"xt":"urn:btih:3750edf7ee76cceb10cf9a18e3cf51f6676831c9","amp;dn":"Liar+Liar%281997%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3750edf7ee76cceb10cf9a18e3cf51f6676831c9","infoHashBuffer":{"type":"Buffer","data":[55,80,237,247,238,118,204,235,16,207,154,24,227,207,81,246,103,104,49,201]},"announce":[],"urlList":[]}}