{"title":"Garrow's Law - Season 1 -  DutchReleaseTeam-DVDRIP-NLSubs","uid":7969705,"size":2136194107,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:38e3dccddc311b0cfa02fa38a225f284de2ec9d0&amp;dn=Garrow%27s+Law+-+Season+1+-++DutchReleaseTeam-DVDRIP-NLSubs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Recon06","files":10,"time":1356797147,"description":"Garrow's Law - Season 1 -  DutchReleaseTeam-DVDRIP-NLSubs\n\n[img]http://qpbs.imageg.net/graphics/product_images/pPBS3-9241205dt.jpg[/img]\n\n\nThis a costume drama and period piece based on real people and true facts all set in the 18th century. It is drawn from the actual history of a young lawyer who fundamentally changed the legal system in England at a time when unfair advantage formed the foundation of corruption and defined the war between the classes of rich and landed nobles, and working class people. Not only is it well acted, but the subjects treated in Garrow's cases are pertinent and timely to our own affairs of today. Enjoy a positive story about the struggle for truth, justice and the dignity of honest men and women no matter their lot in life.\n\nWilliam Garrow championed the downtrodden and powerless in 18th-century England as a passionate young barrister who ignited a courtroom revolution. Taking on the established legal practices and smug inertia of the courts, Garrow pioneered the art of cross-examination as an advocate for the accused.  Based on a true story and drawing on actual court records from the Old Bailey.\n\nActors: Andrew Buchan, Alun Armstrong, Victoria Balnaves, Anthony Bowers, Stephen Boxer\nGenres: Biography, Costume drama\nLanguage: English\nSubtitles: Dutch\nFilming Locations: Dumbarton, West Dunbartonshire, Scotland, UK\n\n[url=http://www.imdb.com/title/tt1477131/][img]http://hetmultimediacafe.nl/images/afbeeldingen/imdb.png[/img][/url]\n\nkCnrtnUyj2M[/youtube]\n\nEpisode #1.1\nFrustrated with the lack of defense for the accused, young barrister William Garrow employs his sharp tongue and innovative court room skills when he is called to defend a servant girl accused of murdering her new born child.\n\n\nEpisode #1.2\nGarrow stands to defend 'The Monster', a man accused of assaulting several woman with a blade. Meanwhile Sir Arthur's true intention begin to surface as he moves his living pawns into place, in an attempt to defraud the system.\n\nEpisode #1.3\nWill builds momentum and steps up to defend a man standing trial for allegedly raping a servant.\n\nEpisode #1.4\nHaving successfully defended a prostitute accused of killing a masochistic client, Garrow takes up the case of Joseph Hamer, charged with treason for belonging to the Corresponding Society, who advocate a wider enfranchisement and much needed electoral reform. The prosecutor is Attorney General Scott, a foolish wind-bag, and Garrow wins the case, thanks to crucial information supplied by Lady Sarah. She knows full well that her husband, member of parliament for a nominal constituency, stood to gain if Garrow lost but she is a woman of great principles, for which reason she also refuses to leave Sir Arthur, by whom she is pregnant, for Garrow.\n","torrent":{"xt":"urn:btih:38e3dccddc311b0cfa02fa38a225f284de2ec9d0","amp;dn":"Garrow%27s+Law+-+Season+1+-++DutchReleaseTeam-DVDRIP-NLSubs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38e3dccddc311b0cfa02fa38a225f284de2ec9d0","infoHashBuffer":{"type":"Buffer","data":[56,227,220,205,220,49,27,12,250,2,250,56,162,37,242,132,222,46,201,208]},"announce":[],"urlList":[]}}