{"title":"Gattaca (1997) BRrip x264 Omikron","uid":8394666,"size":800476284,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:38ff8d87a2bd2517a87ae2968492d854b19620d9&amp;dn=Gattaca+%281997%29+BRrip+x264+Omikron&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Omi.Fast","files":-1,"time":1366534831,"description":"New Zealand screenwriter Andrew Niccol (The Truman Show) made his feature directorial debut with this science fiction drama, set in a future when one's life is determined by genetic engineering rather than education or experience. The wealthy can choose the genetic makeup of their descendants. People are designed to fit into whatever role is decided before birth. But what happens when someone desires another way of life? Citizens in this impersonal future-world are fashioned as perfect specimens, so those in the natural-born minority are viewed as inferior to the pre-planned perfect specimens (aka &quot;Valids&quot;) who dominate. One of the natural-borns (aka &quot;In-Valids&quot;), Vincent Freeman (Ethan Hawke), has several defects (poor vision, emotional problems, and short 30-year life expectancy), but he also develops a different outlook on his pre-ordained fate. He yearns to break free from society's constraints, and he dreams of a journey into space as a Gattaca Corp. navigator. To accomplish his goal, he enlists the aid of DNA broker German (Tony Shalhoub) and makes contact with Jerome Morrow (Jude Law), who was paralyzed in an accident and is willing to sell his superior genetic materials. Vincent assumes Jerome's identity and is scheduled for a flying mission. However, a week before his flight, a Gattaca mission director is murdered, and all members of the program are the suspects. Meanwhile, he develops a romantic interest in a beautiful Valid, Irene (Uma Thurman), prevented from going into space because of her heart defect. Tracked by a relentless investigator who is methodically jigsawing all the pieces together, Jerome finds his aspirations dissolving into stardust.\n\nRomance | Sci-Fi\n\nEthan Hawke, Uma Thurman, Gore Vidal\n\n--------------------------------------------------------\nOmikron Channel Online Movies\n\nYou can find us on YouTube, Google+Blogger.\n\n--------------------------------------------------------\n\nEnjoy","torrent":{"xt":"urn:btih:38ff8d87a2bd2517a87ae2968492d854b19620d9","amp;dn":"Gattaca+%281997%29+BRrip+x264+Omikron","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38ff8d87a2bd2517a87ae2968492d854b19620d9","infoHashBuffer":{"type":"Buffer","data":[56,255,141,135,162,189,37,23,168,122,226,150,132,146,216,84,177,150,32,217]},"announce":[],"urlList":[]}}