{"title":"Coast to Coast AM March 27 2013","uid":8328354,"size":56132955,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:39628886f4c8ab8450c44a21442a4e4088edf218&amp;dn=Coast+to+Coast+AM+March+27+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"runcdfirst","files":5,"time":1364835528,"description":"#we.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t03-27-13\nHost: \tGeorge Noory\nGuests: \tMichael Cremo, Brendan Cook\n\nDissident researcher Michael Cremo discussed his continuing work in forbidden archeology and human origins, his scientific papers and theories, as well as ancient Sanskrit history and lore. In regards to the ancient aerial craft known as vimanas in ancient India, he said there was reportedly an appearance of one around 5,000 years ago in the city of Dwarka. The vimana was said to attack the city, using different types of aerial weapons, but according to the ancient writings, Lord Krishna shot the craft down and it crashed into the sea. &quot;Some of these vimanas...were made of metal; they were mechanical devices, other ones appeared to be more interdimensional,&quot; he detailed.\n\nThe ancient Sanskrit material describes periodic catastrophes that wipe out life on Earth over broad cycles of time. We're now in the middle of one such 300 million-year cycle, and in about 180 million years, we can expect a huge devastating cataclysm, Cremo said. He also spoke about his research into psychic archeology and cited how the prominent archaeologist J.T. Robinson, had in 1960 brought a psychic to use in archaeological research at the Sterkfontein Cave site in South Africa. He connected this to accounts in ancient Sanskrit of sages or mystics having a dream or vision about a sacred image being buried in the Earth.\n\nIn his just published collection, My Science, My Religion, Cremo has put together 24 different papers that he presented at scientific and academic conferences from 1994 to 2009, many of them dealing with archaeological anomalies, and evidence for extreme human antiquity. If humans have been here for millions and millions of years &quot;that means our current scientific understanding of who we are and where we came from is wrong,&quot; he remarked. Further, the non-spiritual materialist world view that humans are like machines made of matter has bred ceaseless conflict and environmental crises, he commented.\nEVP Update\n\nFirst hour guest, Brendan Cook of the Ghost Investigator's Society (G.I.S.) returned to the show to talk about ghost investigations and share electronic voice phenomena (EVP). He noted that since the advent of digital sound technology it has been easier to locate anomalous voices within a long recording, and apply filters to make them clearer. Two of the EVPs he played were recorded in a private mortuary in northern Massachusetts, and sounded like the voice of a child. In one, a plaintive voice is heard to seemingly utter &quot;I need you-- are you behind me?&quot;\n\nNews segment guests: Jerome Corsi, Lauren Weinstein\nWebsite(s):\n\n    mcremo.com\n    mysciencemyreligion.com\n    forbiddenarcheologist.com\n    ghostpix.com\n\nBook(s):\n\n    My Science, My Religion\n    Forbidden Archeology\n    Forbidden Archeologist\n\n","torrent":{"xt":"urn:btih:39628886f4c8ab8450c44a21442a4e4088edf218","amp;dn":"Coast+to+Coast+AM+March+27+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39628886f4c8ab8450c44a21442a4e4088edf218","infoHashBuffer":{"type":"Buffer","data":[57,98,136,134,244,200,171,132,80,196,74,33,68,42,78,64,136,237,242,24]},"announce":[],"urlList":[]}}