{"title":"APARAJITO (The Unvanquished)BDRip-1080p-x264.Lpcm[DDR]","uid":13058983,"size":8559037407,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:396efe815089476e95fd8620f1864bb3f39f55d1&amp;dn=APARAJITO+%28The+Unvanquished%29BDRip-1080p-x264.Lpcm%5BDDR%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SaM","files":1,"time":1450690554,"description":"DDR Presents\r\n\r\n\r\nCriterion Collection - The Apu Trilogy - II\r\n\r\nAPARAJITO (The Unvanquished) (1956)\r\n(A film by Satyajit Ray)\r\n\r\nBengali - Blu-Ray Rip - 1440x1072 - (4:3)- 7.97 GB - x.264.PCM.Esubs - 1 Hrs:50 Min\r\n \nhttp://extraimago.com/image/XVc \nhttp://extraimago.com/image/XV7 \nhttp://extraimago.com/image/XVs \nhttp://extraimago.com/image/XVn \nhttp://extraimago.com/image/XVT \nhttp://extraimago.com/image/XVN \nhttp://extraimago.com/image/XV2 \nhttp://extraimago.com/image/XVw \nhttp://extraimago.com/image/XVa \nhttp://extraimago.com/image/XV8 \nhttp://extraimago.com/image/X6f \nhttp://extraimago.com/image/X6W \nhttp://extraimago.com/image/X6u \nhttp://extraimago.com/image/X6V\r\n\r\n Tech Specifications: \r\n \nhttp://extraimago.com/image/X65\r\n\r\nSynopsis:\r\nIn the second paert of the Apu Trilogy, Harihar and Sarbajaya decide to settle in Varanasi. Life is difficult, but they manage and things seem to be going smoothly, when Harihar suddenly dies. Left destitute, Sarbajaya takes up a job in an affluent household. But one day she finds that Apu is being treated like a servant too. Aghast at this turn of events, she decides to return to their village. Apu starts earning as a priest and also goes to school where he does well enough to get a scholarship. He goes to Kolkata and takes up a job in a printing press and starts college. A lonely Sarbajaya waits for the few days Apu can come home to visit her, but Apu is caught up in his own dreams of the future and can come less frequently. Then one day, Apu returns home to learn that his mother is no more. His last ties with hs village snaps as Apu walks away..\r\n\r\nComments:\r\nOnce again an excellent restoration, even if the final product is slightly inferior to the out-of-the-world quality of the Pather Panchali Blu-Ray. This restoration has a little too much of grain and since the images are less sharp, the picture once in a while seems a little blurred. But don't get it wrong! This is far far superior to any video I have seen of Aparajito. Its just that the suuperb restoration of Pather Panchali makes us yearn for more!\r\n\r\nWhen I first saw the film, I too was an adolescent and could empathise more with Apu's yearning for the world outside. I used to think that Sarbajaya had been portrayed as a possessive mother. Now, after so many years, when I saw the film again, I can empathise with Sarbajaya's loneliness and her longing for the only attachment in this world, her son Apu. It is perhaps the quality of the restoration that brings out the expressions on Karuna Bannerjee's face so vividly. But it is also a relection of how mature a filmmaker Ray was, for when he made this film, he was young too, and yet he could capture the loneliness of old age so vividly and touchingly.\r\n\r\nUploader's Notes:\r\nThis 1080p rip is exactly like the original Blu-Ray except for a slight reduction of the excessive grain and some very light sharpening. I have also removed the letterboxing and restored the video to its original 4:3 ratio. The audio is the original pcm monoaural sound.\r\n\r\nDo check the sample. It is from the center of the film and will give you a very good idea of the quality.\r\n\r\nA 720p version is also being uploaded separately.\r\n\r\nApur Sansar will follow..\r\n\r\nIMDB Link:\r\nwww.imdb.com/title/tt0048956/","torrent":{"xt":"urn:btih:396efe815089476e95fd8620f1864bb3f39f55d1","amp;dn":"APARAJITO+%28The+Unvanquished%29BDRip-1080p-x264.Lpcm%5BDDR%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"396efe815089476e95fd8620f1864bb3f39f55d1","infoHashBuffer":{"type":"Buffer","data":[57,110,254,129,80,137,71,110,149,253,134,32,241,134,75,179,243,159,85,209]},"announce":[],"urlList":[]}}