{"title":"Terraria Chaos Mod","uid":8530346,"size":1769326,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3aaf7f45739f534f3ee04ae522d6c06046f1b2f4&amp;dn=Terraria+Chaos+Mod&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"DeathTor","files":-1,"time":1370131929,"description":"Required: Terraria 1.1.2 installed.\nInstall: Drag Terraria Chaos Mod.exe to the terraria folder and run it. \n\n\nIncreased Monster spawn rates and health\nRemoved health and mana limits in player advancement. There is a cap, though legit playing it would take a couple years to reach. Over 9Mil\nIncreased Player damages and modifications of items\nIncreased Player speed\nAll bosses have been modified\nIncreased Player Regeneration\nModified the clouds some\nModified defenses to equipment\nModified some client text\nCompatibility checked with base terraria and confirmed (exclusion is health/mana max - Regular terraria will reset you to it's max of 400/200 Base)\nUnlocked collectors edition allowing the bunny pet and starting character carrot to summon/dismiss the bunny.\nMade some spells more magically?! lol\nIncreased the rate of fire on some projectiles :D\nThe dungeon guardian is a possible fight for a well geared veteran character\n\nTips:\nHave a house done by the first night, this is critical to survival. At a bare minimum, have a box built you can seal up and hide in.\nYou will be unable to handle the world until you gain some equipment, the best method is to build a house and dig a basement.\nGo deep and gain some ore, build some items, avoid the night at all cost or you will be overran by hordes of monsters.\n\nBalance:\nThe key changes to balance would be the health and mana becoming near infinite. Potions become less useful, large health and mana buffers reward\nthose who have spent a good deal of time in preparation for fights with bosses. The healer NPC will become more important, and players will be\nmore durable overall to fall damage due to this.\n\n\nRecipes added (Normal methods to gain said items were not removed) \n\nDart Trap = 10 Stone 2 iron bars\nWrench = 10 copper bars\nWire Cutters = 10 copper bars\nWire = 1 copper ore and 1 silt block \nBoulder = 50 stone 1 iron bar\n\nAbout The Modder - Death\n\n   I really like Terraria, and figure you do as well. Use of this mod requires that you have the terraria files, I only provide the application\nthat can be used with the files of terraria. This implies you bought the game and supported re-logic or of lesser means got the files somehow. \n\n   Q:Why am I doing this?\nA: 1.2 is not far off, perhaps 2 months at this time, this should help spark some new terraria interest and playtime before the 1.2 release.\nA: I am very very poor in real life and hope perhaps someone will send me a donation via bitcoin (address bound to client title bar)\n   What is very poor? Homeless? No income? Indeed... I live in a van, with solar power and jack into free wifi spots as I troll through this life.\n   Anything helps even .0000001 Btc, so if you can, I would greatly appreciate it :) Bitcoin: 1CS6FHJDKJb9fxbwvyWxsugUHzieLm6uXH\n\n   Q:Aspiration and goals?\nA: To make a great game like Terraria for myself, offer it to the world for free and accept humble donations from those of humanity who feel it\nwas worthy of such. I believe in sharing and giving of fellow humans, and they in turn shall do the same if and when they can. This is probably\nwhy I am homeless, however I can always look back upon my life with smiles.\n\n   Q:Will there be more releases?\nA: I would like to add new items and cosmetic house objects, tiles, walls, ores, monsters and more.\nA: This will take time, support and the grace of all things involved.\n\n","torrent":{"xt":"urn:btih:3aaf7f45739f534f3ee04ae522d6c06046f1b2f4","amp;dn":"Terraria+Chaos+Mod","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3aaf7f45739f534f3ee04ae522d6c06046f1b2f4","infoHashBuffer":{"type":"Buffer","data":[58,175,127,69,115,159,83,79,62,224,74,229,34,214,192,96,70,241,178,244]},"announce":[],"urlList":[]}}