{"title":"Kepler and The Universe - David K. Love","uid":13347753,"size":6063589,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3cb7a0311ffe25f97ee7d35c0a0247fb0632f292&amp;dn=Kepler+and+The+Universe+-+David+K.+Love&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1454066076,"description":"A contemporary of Galileo and a forerunner of Isaac Newton, Johannes Kepler (1571-1630) was a pioneering German scientist and a pivotal figure in the history of astronomy. This colorful, well-researched biography brings the man and his scientific discoveries to life, showing how his contributions were every bit as important as those of Copernicus, Galileo, and Newton.\r\n\r\nIt was Kepler who first advocated the completely new concept of a physical force emanating from the sun that controls the motion of the planets--today we call this gravity and take it for granted. He also established that the orbits of the planets were elliptical in shape and not circular. And his three laws of planetary motion are still used by contemporary astronomers and space scientists.\r\n\r\nThe author focuses not just on these and other momentous breakthroughs but also on Kepler's arduous life, punctuated by frequent tragedy and hardships. His first wife died young, and eight of the twelve children he fathered succumbed to disease in infancy or childhood. He was frequently caught up in the religious persecutions of the day. His mother narrowly escaped death when she was accused of being a witch.\r\n\r\nIntermingling historical and personal details of Kepler's life with lucid explanations of his scientific research, this book presents a sympathetic portrait of the man and underscores the critical importance of Kepler's discoveries in the history of astronomy","torrent":{"xt":"urn:btih:3cb7a0311ffe25f97ee7d35c0a0247fb0632f292","amp;dn":"Kepler+and+The+Universe+-+David+K.+Love","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3cb7a0311ffe25f97ee7d35c0a0247fb0632f292","infoHashBuffer":{"type":"Buffer","data":[60,183,160,49,31,254,37,249,126,231,211,92,10,2,71,251,6,50,242,146]},"announce":[],"urlList":[]}}