{"title":"Hedge Fund Alpha: A Framework for Generating and Understanding I","uid":9306793,"size":5410554,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3d25d70d6b7510dc515b069759fbf54fac821808&amp;dn=Hedge+Fund+Alpha%3A+A+Framework+for+Generating+and+Understanding+I&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"moneymakestheworldgoround","files":-1,"time":1386325951,"description":"Description\nHedge funds are perhaps the hottest topic in finance today, but little material of substance to date has been written on the topic. Most books focus on how to set up a hedge fund and the basic strategies, while few to none focus on what matters most: generating and understanding investment performance. This book takes an exclusive look at the latter, including an analysis of the areas that are most likely to generate strong investment returns -- namely, the emerging markets of Brazil, Russia, India and China. The book will be invaluable to not only financial professionals, but anyone interested in learning about hedge funds and their future.\n\n\nContents\nGenerating Performance: Introduction; Hedge Fund Research vs. Traditional Research; Achieving Hedge Fund Alpha in Brazil; Achieving Hedge Fund Alpha in Russia; Achieving Hedge Fund Alpha in India; Achieving Hedge Fund Alpha in China; Using Derivatives to Create Alpha; Best Execution of Hedge Fund Strategies; Growth of the Hedge Fund Management Company: Evolving from a Single Strategy Hedge Fund to a Multistrategy Hedge Fund or Multiple Funds; Fund of Hedge Funds; Understanding Performance: The Psychology of Hedge Fund Managers; Risk Management for Hedge Funds; Hedge Fund Due Diligence; From Birth to Death: The Lifecycle of a Hedge Fund Investment Strategy; The Future of Hedge Funds: Seven Emerging Trends (M D Eichen &amp; J M Longo); Appendices: Internet Sites for Hedge Fund Managers; Reading List for Hedge Fund Managers; Sample Manager Background Report.","torrent":{"xt":"urn:btih:3d25d70d6b7510dc515b069759fbf54fac821808","amp;dn":"Hedge+Fund+Alpha%3A+A+Framework+for+Generating+and+Understanding+I","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d25d70d6b7510dc515b069759fbf54fac821808","infoHashBuffer":{"type":"Buffer","data":[61,37,215,13,107,117,16,220,81,91,6,151,89,251,245,79,172,130,24,8]},"announce":[],"urlList":[]}}