{"title":"[2009] Miranda Lambert - Revolution","uid":5651364,"size":393023833,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3d8c529597303b48a4904a4a5a5b2f6af4ad96fb&amp;dn=%5B2009%5D+Miranda+Lambert+-+Revolution&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ddawg","files":-1,"time":1277648196,"description":" &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/51dpAbMKV%2BL.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/51dpAbMKV%2BL.jpg&lt;/a&gt;\n\n\nTitle: Revolution\nArtist: Miranda Lambert\nAudio CD (September 29, 2009) \nOriginal Release Date: 2009 \nNumber of Discs: 1 \nGenre: Country\nFormat: flac\n\n\nTrack Listing:\n\n01. White Liar\n02. Only Prettier\n03. Dead Flowers\n04. Me and Your Cigarettes\n05. Maintain the Pain\n06. Airstream Song\n07. Makin' Plans\n08. Time to Get a Gun\n09. Somewhere Trouble Don't Go\n10. The House That Built Me \n11. Love Song\n12. Heart Like Mine\n13. Sin For a Sin\n14. That's the Way That the World Goes 'Round\n15. Virginia Bluebell \n\n\nAmazon: Description:\n2009 release, the third album from the Country favorite. Lambert, a two-time Grammy nominee has seen both of her previous albums debut at #1 on the Country Album Chart. Lambert wrote or co-wrote all but three of the 15 cuts on the album and worked with a cross-section of writers including Blake Shelton, Ashley Monroe, Natalie Hemby and Lady Antebellum's Dave Haywood and Charles Kelley, who lends background vocals on 'Love Song.' Of the three songs Lambert did not write, she pulled from the best and her favorites -- John Prine, Julie Miller, Allen Shamblin and Tom Douglas to complete the album. \n\n\nAllmusic Review:\nRevolution is Miranda Lambert's first record to be delivered to great expectations, a reflection of the excellence of her first two and her increasing crossover to a wider, rock-oriented audience. Revolution was certainly made with that audience in mind, running a whopping 15 tracks -- a standard length in rock albums, not country -- and pumped up with growling, grinding guitars and thunderous rhythms, all the better to escalate her image as a rowdy spitfire. The gambit pays off almost too well, not quite obscuring the tender, gentle moments that prevent Lambert from being easily pigeonholed but pushing her Crazy Ex-Girlfriend persona to the verge of parody. What goes too far are not the songs but the sound, the relentless onslaught of overdriven guitars meant to convey an attitude Miranda captures better with her snarl. Lambert still slips easily into a rebel rocker persona, sneering &quot;Only Prettier&quot; with delicious contempt, but here she winds up as more winning when she modulates her delivery, adding sly humor to Fred Eaglesmith's &quot;Time to Get a Gun&quot; or easing into the easy-rolling &quot;Airstream Song&quot; and ballads that wind up as the highlights here. And these slower songs are highlights because they're not as insistent as the rowdy, swaggering rockers -- they flow as naturally as &quot;Kerosene&quot; did on Lambert's debut. Miranda can still pull off her tough-girl attitude -- she's turned into a pro, able to turn on her character at the drop of a dime -- but Revolution is somewhat weighed down by the perception that Lambert is nothing but a rocking rebel when she is, as the sum total of this strong but overly long album ultimately proves, so much more. \n \n","torrent":{"xt":"urn:btih:3d8c529597303b48a4904a4a5a5b2f6af4ad96fb","amp;dn":"%5B2009%5D+Miranda+Lambert+-+Revolution","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d8c529597303b48a4904a4a5a5b2f6af4ad96fb","infoHashBuffer":{"type":"Buffer","data":[61,140,82,149,151,48,59,72,164,144,74,74,90,91,47,106,244,173,150,251]},"announce":[],"urlList":[]}}