{"title":"Jacobs Cross - Season 2 (Dynasty set in Africa)","uid":4262054,"size":6218659674,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3db80312936d5e43b841737c6afda24ff6b1d2ef&amp;dn=Jacobs+Cross+-+Season+2+%28Dynasty+set+in+Africa%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"softline","files":15,"time":1214517417,"description":"Jacob&amp;#039;s Cross is an epic story centred on one man&amp;#039;s quest to build the next great African empire.\n\nThe hero, Jacob Makhubu, is the son of a South African mother and a Nigerian father. He embodies all the characteristics of an outsider whose personal desire is to belong.\n\nThe story starts when Jacob -- serving an obligatory stint as an executive in a Nigerian owned, but Joburg based company and hankering after New York&amp;#039;s more worldly pleasures -- is thrown into the midst of turmoil. He is summoned by his boss and benefactor, who reveals himself as his father and bequeaths to him a business empire.\n\nBut Jacob also inherits a family and an African dream. Standing before his newfound vast family, he makes a vow to his father to fulfill his dream of building an empire while keeping the family united.\n\nThis complex inheritance sets him on an epic quest and immediately pits him against both his new found family with long held business traditions and powerful enemies. Jacob must overcome many obstacles placed in his way, but most importantly, Jacob can only achieve his father&amp;#039;s dream if he changes himself. He must grow from a hesitant but affable intellectual into a decisive business leader who is prepared to live with moral ambiguity.\n\nOn the one hand our characters are all driven by a shared history of colonisation and a desire to tap into the wealth of Africa. On the other hand there are bitter feuds over who the rightful owners of the resources are, how they should be exploited and who should benefit. There are dreams of empire, of legacy and identity and belonging.\n\nNot my capture.  Thanks to original capper.\n\nSeason 2 was missed by the capper when it originally aired.  This cap is from a reair.  Season 3 follows in a week.\n","torrent":{"xt":"urn:btih:3db80312936d5e43b841737c6afda24ff6b1d2ef","amp;dn":"Jacobs+Cross+-+Season+2+%28Dynasty+set+in+Africa%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3db80312936d5e43b841737c6afda24ff6b1d2ef","infoHashBuffer":{"type":"Buffer","data":[61,184,3,18,147,109,94,67,184,65,115,124,106,253,162,79,246,177,210,239]},"announce":[],"urlList":[]}}