{"title":"Partha Chatterjee - The Black Hole of Empire. History of a Globa","uid":10347431,"size":4525519,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3f299514f378b58c0de4a694c3d83ee4cc031fb2&amp;dn=Partha+Chatterjee+-+The+Black+Hole+of+Empire.+History+of+a+Globa&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Anette14","files":-1,"time":1402626836,"description":"Description\nProduct Details\nBook Title: The Black Hole of Empire: History of a Global Practice of Power\t\nBook Author: Partha Chatterjee (Author)\nHardcover: 440 pages\nPublisher: Princeton University Press (April 8, 2012)\nLanguage: English\nISBN-10: 0691152004\nISBN-13: 978-0691152004\n\n===================================================================================\nBook Description\nPublication Date: April 8, 2012\nWhen Siraj, the ruler of Bengal, overran the British settlement of Calcutta in 1756, he allegedly jailed 146 European prisoners overnight in a cramped prison. Of the group, 123 died of suffocation. While this episode was never independently confirmed, the story of &quot;the black hole of Calcutta&quot; was widely circulated and seen by the British public as an atrocity committed by savage colonial subjects. The Black Hole of Empire follows the ever-changing representations of this historical event and founding myth of the British Empire in India, from the eighteenth century to the present. Partha Chatterjee explores how a supposed tragedy paved the ideological foundations for the &quot;civilizing&quot; force of British imperial rule and territorial control in India.\nChatterjee takes a close look at the justifications of modern empire by liberal thinkers, international lawyers, and conservative traditionalists, and examines the intellectual and political responses of the colonized, including those of Bengali nationalists. The two sides of empire's entwined history are brought together in the story of the Black Hole memorial: set up in Calcutta in 1760, demolished in 1821, restored by Lord Curzon in 1902, and removed in 1940 to a neglected churchyard. Challenging conventional truisms of imperial history, nationalist scholarship, and liberal visions of globalization, Chatterjee argues that empire is a necessary and continuing part of the history of the modern state.\nSome images inside the book are unavailable due to digital copyright restrictions.\n\n===================================================================================\nReviews\nOne of HistoryToday's Books of the Year 2013, chosen by Chandak Sengoopta\n\n&quot;[H]ighly insightful, at times quite brilliant . . .&quot;--David Washbrook, Times Literary Supplement\n\n&quot;Chock-full of mini topics and discursive asides, and illustrated with a number of photographs and illustrations, this book is required reading for the genre.&quot;--Choice\n\n&quot;The Black Hole of Empire is his most ambitious book yet. Challenging existing understandings, reinterpreting the meaning of well-known events, and displaying an authoritative knowledge of an astonishing range of scholarly literature, we encounter a historian at the top of his game.&quot;--Gyan Prakash, 3QuarksDaily\n\n&quot;Stimulating and original. . . . In following a trail from history as once every British schoolboy learnt it, Chatterjee illuminates one of the pressing issues of international relations today.&quot;--William Crawley, BBC Northern Ireland\n\n&quot;[T]he scope, depth, and reach of The Black Hole of Empire is an achievement that is difficult to match. . . . The Black Hole of Empire is, in all its richness or argument and historical detail, a book that no anthropologist, historian, or political theorist of empire can afford to miss.&quot;--Peter Pels, Current Anthropology\n\n&quot;[T]he book is so richly detailed and so thoughtfully argued that it can serve as the perfect introduction to the history of British India and, indeed, of imperialism itself.&quot;--Chandak Sengoopta, History Today\n\n===================================================================================\nFrom the Back Cover\n&quot;This is a powerfully argued account of the origins and subsequent justification of British rule in India, and an exploration of the response by Bengali elites to colonialism. A work of classic history, this book carries an intellectual power and brilliance of insight that will excite much interest and comment.&quot;--Thomas Metcalf, professor emeritus of history, University of California, Berkeley\n\n&quot;Moving skillfully between gripping narrative and thoughtful interpretation, The Black Hole of Empire is a deeply researched, brilliantly crafted, and exquisitely written work on the British empire in India. Ambitious and complex, it richly resonates with contemporary political and ethical concerns. A masterly work by one of the finest intellectuals of our times.&quot;--Sugata Bose, Harvard University\n\n===================================================================================\nAbout the Author\nPartha Chatterjee is professor of anthropology and of Middle Eastern, South Asian, and African Studies at Columbia University; and honorary professor at the Centre for Studies in Social Sciences, Calcutta. His books include &quot;The Politics of the Governed.&quot;\n===================================================================================","torrent":{"xt":"urn:btih:3f299514f378b58c0de4a694c3d83ee4cc031fb2","amp;dn":"Partha+Chatterjee+-+The+Black+Hole+of+Empire.+History+of+a+Globa","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f299514f378b58c0de4a694c3d83ee4cc031fb2","infoHashBuffer":{"type":"Buffer","data":[63,41,149,20,243,120,181,140,13,228,166,148,195,216,62,228,204,3,31,178]},"announce":[],"urlList":[]}}