{"title":"BBC Unnatural Histories 3of3 Amazon 720p x264 AAC HDTV MVGroup.o","uid":12815009,"size":1414533280,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:3fd5532ebc41e1d3d4b2589c1e9a39b9558cfd2f&amp;dn=BBC+Unnatural+Histories+3of3+Amazon+720p+x264+AAC+HDTV+MVGroup.o&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MVGroup","files":1,"time":1448226512,"description":"Unnatural Histories (BBC)\r\n\r\nHistory Documentary hosted by Deborah Maclaren, published by BBC in 2011 - English narration. \nhttp://docuwiki.net/images/3/31/Unnatural-Histories-BBC-Cover.jpg\r\n\r\nInformation\r\n------------------------------\r\nSeries looking at three of the world's most iconic wild places and how they have been shaped over time by man.\r\n\r\n1)  Serengeti \r\nMore than anywhere, the Serengeti is synonymous with wilderness and has even come to represent Africa. But the story of the Serengeti is just as much about humans as it is about wildlife. Right from the origin of our species in Africa, humans have been profoundly shaping this unique wilderness - hunters and pastoralists with cattle and fire, ivory traders and big game hunters, conservationists, scientists, film-makers and even tourists have all played a part in shaping the Serengeti.\r\nProbably most powerful of all was a tiny microbe unknowingly brought to Africa by a small Italian expeditionary force - Rinderpest, a deadly virus that swept through the continent decimating cattle and wildlife alike and forever changing the face of the wild. The Serengeti is far from timeless, it is forever changing - and wherever there is change, the influence of Homo sapiens is not far behind.\r\n\r\n2)  Yellowstone \r\nAs the world's first national park, Yellowstone has long served as a model for the protection of wilderness around the world. For Americans it has become a source of great national pride, not least because it encapsulates all our popular notions of what a wilderness should be - vast, uninhabited, with spectacular scenery and teeming with wildlife. But Yellowstone has not always been so. At the time of its creation in 1872, it was renowned only for its extraordinary geysers, and far from being an uninhabited wilderness it was home to several American Indian tribes.\r\nThis film reveals how a remote Indian homeland became the world's first great wilderness. It was the ambitions of railroad barons, not conservationists, that paved the way for a brand new vision of the wild, a vision that took native peoples out of the picture. Iconic landscape paintings show how European Romanticism crossed the Atlantic and recast the American wilderness, not as a satanic place to be tamed and cultivated, but as a place to experience the raw power of God in nature. Forged in Yellowstone, this potent new version of wilderness as untouched and deserving of protection has since been exported to all corners of the globe.\r\n\r\n3)  Amazon \r\nThe Amazon rainforest is the epitome of a last great wilderness under threat from modern man. It has become an international cause celebre for environmentalists as powerful agricultural and industrial interests bent on felling trees encroach ever deeper into virgin forest. But the latest evidence suggests that the Amazon is not what it seems.\r\nAs more trees are felled, the story of a far less natural Amazon is revealed - enormous man-made structures, even cities, hidden for centuries under what was believed to be untouched forest. All the time archaeologists are discovering ancient, highly fertile soils that can only have been produced by sophisticated agriculture far and wide across the Amazon basin. This startling evidence sheds new light on long-dismissed accounts from the very first conquistadors of an Amazon teeming with people and threatens to turn our whole notion of wilderness on its head. And if even the Amazon turns out to be unnatural, what then for the future of wilderness?\r\n\r\nScreenshots\r\n------------------------------ \nhttp://docuwiki.net/images/5/5a/Unnatural-Histories-BBC-Screen0.jpg \nhttp://docuwiki.net/images/a/ac/Unnatural-Histories-BBC-Screen1.jpg \nhttp://docuwiki.net/images/3/3f/Unnatural-Histories-BBC-Screen2.jpg \nhttp://docuwiki.net/images/a/a7/Unnatural-Histories-BBC-Screen3.jpg \nhttp://docuwiki.net/images/f/f3/Unnatural-Histories-BBC-Screen4.jpg \nhttp://docuwiki.net/images/b/bd/Unnatural-Histories-BBC-Screen5.jpg \nhttp://docuwiki.net/images/e/e9/Unnatural-Histories-BBC-Screen6.jpg \nhttp://docuwiki.net/images/8/89/Unnatural-Histories-BBC-Screen7.jpg \nhttp://docuwiki.net/images/5/5c/Unnatural-Histories-BBC-Screen8.jpg \nhttp://docuwiki.net/images/4/42/Unnatural-Histories-BBC-Screen9.jpg \nhttp://docuwiki.net/images/4/4c/Unnatural-Histories-BBC-Screen10.jpg \nhttp://docuwiki.net/images/a/a9/Unnatural-Histories-BBC-Screen11.jpg \r\n\r\nTechnical Specs\r\n------------------------------\r\n * Video Codec: x264 CABAC   \r\n * Video Bitrate: CRF 21 (~2877Kbps)\r\n * Video Resolution: 1280x720\r\n * Video Aspect Ratio: 16:9\r\n * Frames Rate: 25 FPS\r\n * Audio Codec: AAC-LC\r\n * Audio Bitrate: Q=0.45 VBR 48KHz (~128Kbps)\r\n * Audio Channels: 2\r\n * Run-Time: 59 mins\r\n * Number Of Parts: 3\r\n * Part Size: 1.26 GB (average)\r\n * Source: HDTV (upscaled)\r\n * Subtitles: Merged\r\n\r\nLinks\r\n------------------------------ \nhttp://www.bbc.co.uk/programmes/b011wd41","torrent":{"xt":"urn:btih:3fd5532ebc41e1d3d4b2589c1e9a39b9558cfd2f","amp;dn":"BBC+Unnatural+Histories+3of3+Amazon+720p+x264+AAC+HDTV+MVGroup.o","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3fd5532ebc41e1d3d4b2589c1e9a39b9558cfd2f","infoHashBuffer":{"type":"Buffer","data":[63,213,83,46,188,65,225,211,212,178,88,156,30,154,57,185,85,140,253,47]},"announce":[],"urlList":[]}}