{"title":"Librivox M4B Audiobook - Iliad and Odyssey by Homer","uid":5521058,"size":393379867,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:404880b4701b8e8db84cd46740e1e9c60c89457d&amp;dn=Librivox+M4B+Audiobook+-+Iliad+and+Odyssey+by+Homer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"VoxRatio","files":-1,"time":1272624621,"description":" &lt;a href=&quot;http://bayimg.com/OAMHPaacd&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/OAMHPaacd&lt;/a&gt;\n\nThe Iliad, together with the Odyssey, is one of two ancient Greek epic poems traditionally attributed to Homer. The poem is commonly dated to the 8th or 7th century BC, and many scholars believe it is the oldest extant work of literature in the Greek language, making it the first work of European literature. The existence of a single author for the poems is disputed as the poems themselves show evidence of a long oral tradition and hence, multiple authors. The poem concerns events during the tenth and final year in the siege of the city of Iliun, or Troy, by the Greeks.\n\n(Summary adapted from Wikipedia by Karen Merline.)\n\n\n &lt;a href=&quot;\nhttp://bayimg.com/pAMHCAaCD&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/pAMHCAaCD&lt;/a&gt;\n\nThe Odyssey is one of the two major ancient Greek epic poems (the other being the Iliad), attributed to the poet Homer. The poem is commonly dated to between 800 and 600 BC. The poem is, in part, a sequel to the Iliad, and concerns the events that befall the Greek hero Odysseus in his long journey back to his native land Ithaca after the fall of Troy.\nIt takes Odysseus ten years to return to his native land of Ithaca after ten years of war; during his 20-year absence, his son Telemachus and his wife Penelope must deal with a group of unruly suitors who have moved into Odysseus' home to compete for Penelope's hand in marriage, since most have assumed that Odysseus has died.\nThe poem is a fundamental text in the Western canon and continues to be read in both Homeric Greek and translations around the world.\n(Summary from Wikipedia)\n\n\n\nAn M4B file is an audio file which can be bookmarked. This is the audio-book file type. These files can have chapter markers which can be skipped through as you would skip through files on a play list. They can have built in cover art and chapter images. They will remember where you left off each time you stop the file and come back to it . And variable speed settings on Ipods and a growing number of other mp3 players can be utilized by this file type. The ability to bookmark allows for as little as one large file instead of many small ones without the burden of fast forwarding to find your spot every time you resume listening or the fear of otherwise losing your place. The reduced number of files also makes browsing through your files to find your book and your place in it much less effort.\n","torrent":{"xt":"urn:btih:404880b4701b8e8db84cd46740e1e9c60c89457d","amp;dn":"Librivox+M4B+Audiobook+-+Iliad+and+Odyssey+by+Homer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"404880b4701b8e8db84cd46740e1e9c60c89457d","infoHashBuffer":{"type":"Buffer","data":[64,72,128,180,112,27,142,141,184,76,212,103,64,225,233,198,12,137,69,125]},"announce":[],"urlList":[]}}