{"title":"Mobile Doc Scanner (MDScan) v3.1.7 Patched","uid":12610473,"size":24453921,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:404dfcdb9892eb8f1546d2d47e106e60acfcf260&amp;dn=Mobile+Doc+Scanner+%28MDScan%29+v3.1.7+Patched&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"John3245","files":1,"time":1445453884,"description":"With MDScan users are free to scan any type of document, ranging from receipts to text pages and almost everything in between, on the go anywhere and anytime.\r\nA perfect companion for busy users, MDScan allows anyone to transform everything from invoices to whiteboards and classes notes, magazine articles and more into a PDF format in order to easily export them, share and e-mail it to others, or for any other reason they can come up with. MDScan automatically detects borders, corrects distortion, and equalizes brightness to create clear, legible documents at a very high speed for your convenience.\r\n\r\nGoing above and beyond other mobile scanning solutions MDScan offers Batch shooting mode for a super fast scanning so users can easily scan within seconds multiple pages and save scanned files for batch processing later.\r\n\r\nThe app shines in terms of uploading as well as all document conversion is performed locally right on user's device. This means that you can upload documents to cloud storage services, including Dropbox, Google Docs, or Box.net, email services, orand Twitter that is guaranteed to go off quickly, without a hitch, and without risk of any potentially sensitive information becoming compromised.\r\nSimply put there's enough for you to worry about without having to go out of your way to scan and convert files into PDFs should the need arise, and now with MDScan its one worry you won't ever have again.\r\n\r\n★★★★★\r\nMain advantages and benefits\r\n========================\r\n★ Transform any image into PDF format.\r\n★ Automatic, high quality document edge detection and perspective correction.\r\n★ Manual free Advanced image processing to enhance poor quality images and documents.\r\n★ Quickly scan and manage multi-page documents on the go\r\n★ Scan, upload or send any document quickly, including receipts, news and magazine articles, invoices, coupons, posters and much more\r\n★ Cloud storage and social network integration for accessibility and sharing \r\n \nhttps://play.google.com/store/apps/details?id=com.stoik.mdscan&amp;hl=en","torrent":{"xt":"urn:btih:404dfcdb9892eb8f1546d2d47e106e60acfcf260","amp;dn":"Mobile+Doc+Scanner+%28MDScan%29+v3.1.7+Patched","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"404dfcdb9892eb8f1546d2d47e106e60acfcf260","infoHashBuffer":{"type":"Buffer","data":[64,77,252,219,152,146,235,143,21,70,210,212,126,16,110,96,172,252,242,96]},"announce":[],"urlList":[]}}