{"title":"The.Bourne.Legacy.2012.TS.XviD-PORsub.avi","uid":7619242,"size":1537186594,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:41f8b990ed7047039113b5455bd2e2811986a5d2&amp;dn=The.Bourne.Legacy.2012.TS.XviD-PORsub.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"globeplus","files":-1,"time":1347282814,"description":"* XVID CAM  * 02H05M11S    * + 1500 Bitrate    * Worked with the Dub plugins\n\n\n* FILE INFO :\n\n\n- Black borders at the top and the bottom in full screen corrected\n\n- particles on the picture background reduced to the minimum\n\n- colours improved\n\n\n\n* PLOT :\n\nAaron Cross (Jeremy Renner) is a member of Operation Outcome, a Department of Defense black ops program which enhances the physical and mental abilities of field operatives through pills (or &quot;chems&quot;, short for chemicals). Cross is deployed to Alaska for a training assignment, during which he pretends to lose his supply of chems to obtain more, and meets another Outcome operative, Number Three (Oscar Isaac). Number Three and Cross, codenamed &quot;Number Five&quot;, lodge up in a cabin, but a blizzard prevents Cross from returning to civilization. Number Three is stationed in the lodge, because he fell in love.\n\nMeanwhile, Jason Bourne (through his actions seen in The Bourne Ultimatum, and with also other timeline events that are revisited from that movie, such as the assassination of Simon Ross) exposes Operation Blackbriar and the Treadstone Project, leading the FBI to investigate CIA Deputy Director Pamela Landy (Joan Allen) and Blackbriar supervisor Noah Vosen (David Strathairn). Upon learning of this, CIA Director Ezra Kramer (Scott Glenn), also under investigation, calls Eric Byer (Edward Norton), a retired Air Force colonel responsible for overseeing the CIA's clandestine operations, for help.\n\nByer decides to eliminate all Outcome assets and deploys a Predator drone to destroy Number Three's cabin, unaware of Cross' presence. Cross leaves to survey the area just as a missile destroys the cabin with Number Three inside. He uses a sniper rifle to destroy the Predator and, realizing that his superiors have ordered his assassination, removes a tracking device in his thigh, which he later forces a wolf that attacks him to swallow. A second Predator drone deployed to eliminate Cross strikes the wolf, and Byer assumes Cross has been terminated.\n\n\n\n\n\n* enjoy ...\n\n\n\n\n\n\n* GLOBE FILES 2012 \n\t\t","torrent":{"xt":"urn:btih:41f8b990ed7047039113b5455bd2e2811986a5d2","amp;dn":"The.Bourne.Legacy.2012.TS.XviD-PORsub.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41f8b990ed7047039113b5455bd2e2811986a5d2","infoHashBuffer":{"type":"Buffer","data":[65,248,185,144,237,112,71,3,145,19,181,69,91,210,226,129,25,134,165,210]},"announce":[],"urlList":[]}}