{"title":"Fall of Eagles Part II","uid":4106913,"size":2067693264,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:44a4281e574d6022e086829044e09b96af3c07ae&amp;dn=Fall+of+Eagles+Part+II&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"anca13","files":5,"time":1206852218,"description":"This is Disk 2of 4 - Please seed after download\nSo that I can upload next disk:-*  :-* \n\n\n[quote]\n[b]By Lawrance M. Bernabo[/b]\n\n&quot;Fall of Eagles&quot; covers the decline and fall of the three great ruling dynasties of central Europe which disappeared after World War I. These are the Habsburgs in Austria-Hungary, the Hohenzollerns in Germany, and the Romanovs in Russia. The 13-part BBC mini-series was produced in 1974, and features the expected cast of familiar faces, most notably Patrick Stewart as Lenin, with the pivotal roles being first Miles Anderson and then Laurence Naismith as Emperor Franz Josef I, Charles Kay as Tsar Nicholas II, Gayle Hunnicutt as Tsarina Alexandra, and Barry Foster as &quot;Willy&quot; (Kaiser Wilhelm II). The series begins in 1853 with the decision of the Franz Josef picks the wrong sister to be his wife while Queen Victoria&amp;#039;s eldest daughter Vicky marries Crown Prince Frederick of Prussia. The road to World War begins because one ruler marries a weak woman rather than a strong one, thereby laying the seeds for revolution, while another marries a strong woman but is only able to rule for 99 days before dying and leaving the throne to a son eager to turn his back on the desire of his parents to move towards a constitutional monarch and embrass Prussian militarism. \n\nHowever, &quot;Fall of Eagles&quot; is not a balanced treatment of the fall of these three dynasties, with most of the emphasis being on what was happening in Russia even thought the Romanovs show up last. There are six episodes focusing primarily on the Romanovs (5, 7-9, 11-12), with another episode (6) devoted to Lenin besting his rival Julius Martov for control of the Russian Social Democratic Labour Party. In contrast there are only three episodes focusing on the Habsburgs (1, 4, 10), one of which (4) is basically a detective story regarding the death of Crown Prince Rudolf and his mistress at Mayerling (which was interesting to see after having watch &quot;The Illusionist&quot; this year). The Hohenzollerns are also the subject of three episodes (2, 3, 13), including the last one, although Willy pops up several times in the context of his relationship with his cousin Nicky in Russia. The emphasize on Austria-Hungary and Germany at the beginning certainly made it seem that we would be treated to the fall of each empire in equal measure, which certainly affected how much I enjoyed the mini-series as a whole. \n\nIt seems to me there is a concerted effort to avoid covering some of the most familiar ground from World War I and the Russian Revolution. But while I can understand having the execution of the Romanovs and other key events covered in the 1971 film &quot;Nicholas and Alexandra&quot; occur off screen, I was rather disappointed that the assassination of the Archduke Ferdinand in Sarajevo, the spark the set off the World War, happens that way as well. I thought that would be one of the pivotal moments in the series and while I can appreciate the dramatic irony of doing it this way, it was still disappointing. In that frame of mind I watched the final episodes fully aware how time and time again too much of the end game was happening off camera. World War I is necessarily a whirl of contemporary film footage and Michael Hordern&amp;#039;s narration, and that the two pivotal actions by Germany during the war were its use of unrestricted submarine warfare, which ultimately brought the United States into the war, and how they helped get Lenin and his comrades back to Russian to co-opt the revolution begun by Alexander Krensky. Of course, back in 1974 the Soviet Union still existed, so what the Russian Revolution would clearly have been the great legacy from the end of these dynasties from the perspective of world history. \n\nThe end of &quot;Fall of Eagles&quot; comes not with the bang of the death of the Tsar and his family, but the whimper of the Kaiser greeting his exile as the chance to finally have a nice cup of English tea. However, it was the off handed remark concerning what happened to the Habsburgs that was the final disappointment because I fully expected in the end to see the eagles fall and not just hear about it. That being said I certainly know a lot more about the background of the First World War than I did before hand, especially in regards to Germany and Austria-Hungary. I definitely appreciate the recommendations I found in other reviews here for books where I can &quot;read more about it.&quot; Earlier this month Charlotte Winters, the last surviving woman to have served in the American armed forces in World War I died, and the news reported that there are literally only a handful of American soldiers from that war still alive (20 Britons and one Australian too). Seeng that story and watching this mini-series only underscores for me that this particular conflict has woefully underepresented in film and television. Of what little is out there &quot;Fall of Eagles&quot; is a good place to turn to for an introduction to what the monarchies of Europe did to bring it about and cause their own downfalls.[/quote]\n\n","torrent":{"xt":"urn:btih:44a4281e574d6022e086829044e09b96af3c07ae","amp;dn":"Fall+of+Eagles+Part+II","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44a4281e574d6022e086829044e09b96af3c07ae","infoHashBuffer":{"type":"Buffer","data":[68,164,40,30,87,77,96,34,224,134,130,144,68,224,155,150,175,60,7,174]},"announce":[],"urlList":[]}}