{"title":"Taxing the Rich: A History of Fiscal Fairness by Kenneth Scheve","uid":14469284,"size":5496295,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:44b1664b6619d0ad3f261315d010f0e39dc52abb&amp;dn=Taxing+the+Rich%3A+A+History+of+Fiscal+Fairness+by+Kenneth+Scheve&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Dr.Soc","files":1,"time":1461887294,"description":"Kenneth Scheve, David Stasavage, &quot;Taxing the Rich: A History of Fiscal Fairness in the United States and Europe&quot; \r\nEnglish | ISBN: 0691165459 | 2016 | 288 pages | PDF | 5 MB\r\n\r\nIn today's social climate of acknowledged and growing inequality, why are there not greater efforts to tax the rich? In this wide-ranging and provocative book, Kenneth Scheve and David Stasavage ask when and why countries tax their wealthiest citizens–and their answers may surprise you.\r\n\r\nTaxing the Rich draws on unparalleled evidence from twenty countries over the last two centuries to provide the broadest and most in-depth history of progressive taxation available. Scheve and Stasavage explore the intellectual and political debates surrounding the taxation of the wealthy while also providing the most detailed examination to date of when taxes have been levied against the rich and when they haven't. Fairness in debates about taxing the rich has depended on different views of what it means to treat people as equals and whether taxing the rich advances or undermines this norm. Scheve and Stasavage argue that governments don't tax the rich just because inequality is high or rising–they do it when people believe that such taxes compensate for the state unfairly privileging the wealthy. Progressive taxation saw its heyday in the twentieth century, when compensatory arguments for taxing the rich focused on unequal sacrifice in mass warfare. Today, as technology gives rise to wars of more limited mobilization, such arguments are no longer persuasive","torrent":{"xt":"urn:btih:44b1664b6619d0ad3f261315d010f0e39dc52abb","amp;dn":"Taxing+the+Rich%3A+A+History+of+Fiscal+Fairness+by+Kenneth+Scheve","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44b1664b6619d0ad3f261315d010f0e39dc52abb","infoHashBuffer":{"type":"Buffer","data":[68,177,102,75,102,25,208,173,63,38,19,21,208,16,240,227,157,197,42,187]},"announce":[],"urlList":[]}}