{"title":"Brutally Honest Fast Food Reviews (gnv64)","uid":14051494,"size":17379384,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:45273ed294c1022a94a411e4207075de84b6ee77&amp;dn=Brutally+Honest+Fast+Food+Reviews+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gnv65","files":5,"time":1459056835,"description":"Brutally Honest Fast Food Reviews: The Best and Worst of Burger King, McDonald's, Taco Bell, and Other Drive-Thru\r\nby Marvo and The Staff of the Impulsive Buy\r\nHyperink | July 2012 | ISBN: N/A | ePUB | 16.5 mb\r\n\r\nIf you're a connoisseur of fast food, consider this to be your fast food yearbook, allowing you to look back at many of the salty, fatty, and/or sugary menu items you may have passed through your digestive system, but in a non-artery clogging and non-blood pressure raising way...unless you're eating fast food while reading this. There are dozens of reviews in this book, mostly from fast food behemoths, like McDonald's, Subway, and Taco Bell, but there are also reviews from medium-sized fast food chains, like Jack in the Box and Dunkin' Donuts, and from smaller chains, like Carl's Jr. and Whataburger. Most of the products reviewed can still be found on fast food menu boards, or in the McDonald's McRib's case it comes back every so often for a limited time, but some are buried in the discontinued fast food graveyard, never to be consumed again.\r\nThese fast food reviews were originally posted on our blog, The Impulsive Buy (theimpulsivebuy.com), which is one of the internet's premier websites for junk and fast food reviews. Actually, we're not 100 percent sure the last part of the previous sentence is true, but our cumulative blood pressure and cholesterol levels make us feel like we are.\r\n\r\nSo who are we?\r\n\r\nWell, we're just a bunch of regular folks with semi-decent grammar who have the ability to eat fast food, get sleepy from eating fast food, and wake up from our fast food-induced comas to write about what we just ate. Our writing style is a bit different than other review blogs because we want our reviews to not only educate, but to also entertain. Of course, what we define as entertaining might be different than your definition, so let us put it this way: If The Impulsive Buy was a movie, the Motion Picture Association of America would give us a PG-13 or R rating for a little profanity, some sexual situations, and occasional drug use references.\r\nThe Impulsive Buy has been named a Yahoo! Site of the Day and has been mentioned in Marie Claire and Buffalo Spree magazines. It was also named one of the Top 100 Undiscovered Websites of 2008 by PC Magazine and one of their Favorite Blogs of 2008.\r\nWe hope you find this ebook useful and entertaining. If you are a dietician who accidentally purchased this book, we've included nutrition facts for almost every item, so it might not be a total loss for you. Enjoy! Marvo Editor-in-chief The Impulsive Buy\r\n \nhttp://s18.postimg.org/geaklngp5/Brutally_Honest_Fast_Food_Reviews.jpg","torrent":{"xt":"urn:btih:45273ed294c1022a94a411e4207075de84b6ee77","amp;dn":"Brutally+Honest+Fast+Food+Reviews+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"45273ed294c1022a94a411e4207075de84b6ee77","infoHashBuffer":{"type":"Buffer","data":[69,39,62,210,148,193,2,42,148,164,17,228,32,112,117,222,132,182,238,119]},"announce":[],"urlList":[]}}