{"title":"Hogtied------HT-30435 Bailey Blue","uid":8522657,"size":2829870491,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:45787b2645d62e9c2e576520feb438f6cb61c574&amp;dn=Hogtied------HT-30435+Bailey+Blue&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"merzedes","files":-1,"time":1369951759,"description":"\n\n\nMega Hottie Bailey Blue\n\nMay 30, 2013 - Performers: Bailey Blue \n \n\nMP4 and WMV + Pics.\n  \n\nWelcome Bailey to round one on HogTied. This hot princess gets introduced to the pain and pleasure of intense rope bondage, relentless orgasms, and pain games. In scene one, she is bound in an asymmetrical bondage arrangement and tormented with the tazapper, tickle torment, and flogging. She is then transitioned onto her side, so we can get better access to her cunt to take advantage of this wanton slut. Second, she is bound in a face up pile driver suspension. Her feet are mercilessly caned, now that we know how sensitive they are. Clamps are added and tightly grab the flesh of her labia, and clover clamps to her nipples. When in the air, her asshole is repeatedly violated by Claire's fingers and a thick black dick. \n\nFinally, she is bound in what looks like a comfortable position, but clearly not for long. Suction tubes suck in her nipples and clit, making them swell to a nice cherry red. Her tongue is clamped too and then, she is made to suck cock like a good whore. Since her cunt is busy being partially sucked in by the clit/labia tube, our self proclaimed ass slut is pounded in the ass. Now, comes the hard part. Bitch is hoisted upside down by her knees. Dangling in the air, she is fisted into multiple explosive orgasms. She writhes in pleasure and pain, not sure what to do other than cum and cum and cum. We'll see you again, bitch.\n\nScreens &lt;a href=&quot;\nhttp://www.hogtied.com/site/shoot.jsp?shootId=30435&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.hogtied.com/site/shoot.jsp?shootId=30435&lt;/a&gt;\n\n10 000 uploads and counting, 11k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:45787b2645d62e9c2e576520feb438f6cb61c574","amp;dn":"Hogtied------HT-30435+Bailey+Blue","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"45787b2645d62e9c2e576520feb438f6cb61c574","infoHashBuffer":{"type":"Buffer","data":[69,120,123,38,69,214,46,156,46,87,101,32,254,180,56,246,203,97,197,116]},"announce":[],"urlList":[]}}