{"title":"Kings and Queens of England  (History Channel - 2004)","uid":8484770,"size":2523003726,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:487bea7acb0ad9fa45f4e9ed0e8d69a79f3a620a&amp;dn=Kings+and+Queens+of+England++%28History+Channel+-+2004%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Robin1966","files":13,"time":1368826751,"description":"\n\nPresented by Alan Ereira. Alan Ereira is co-executive producer of the Crusades\nseries with Terry Jones. He has worked as a BBC radio and television producer,\nspecialising in history, since 1962. His credits include Battle of the Somme,\nwhich won the Japan Prize in 1978; Armada, which was winner of the Royal\nTelevision Society's Best Documentary Series of 1988; The Terror; Ireland's\nOpportunity; and From the Heart of the World. He is the author of The People's\nEngland, The Invegordon Mummy and The Heart of the World\n\n01 Normans to Magna Carta. (1066 -\n\nThis programme studies the Normans, covering historical landmarks such as the\nBattle of Hastings, the creation of the exchequer, Thomas Becket's murder, the\nCrusades and the signing of the Magna Carta.\n\n\n02 Medieval.\n\nThis episode covers the time from the Magna Carta through to Henry VI, taking in\nthe 100 Years War, the Peasant's Revolt and the Battle of Agincourt along the\nway.\n\n\n03 The Tudors (1485 - 1603)\n\nKing Henry VII Founder of the Tudor dynasty. King Henry VIII &amp; his six wives.\nQueen Mary I - Bloody Mary. Queen Elizabeth I - The Virgin Queen\n\n04 The Stuarts (1603 - 1714)\n\nTaking a look at the reign of the Stuarts. An era of an expanding court, plague,\nfire, radical politics, religious debate, and a bloody civil war in the mid-\nseventeenth century between Cavaliers and Roundheads.\n\n05 The Georgians (1714-1837)\n\nLust, tempestuous relationships and madness feature in the colourful reigns of\nthe Georgians. George I brought two mistresses over from Germany, George II\nquarrelled openly with his son Frederick, and George III became ruler of the\nBritish Empire - but madness eventually disabled him. His son reigned as Prince\nRegent for eight years, and later as King George IV.\n\n06 The Moderns (1837 - Present)\n\nIn this edition, a look at the modern royal family of Saxe-Coburg and Windsor,\nwhose direct lineage stretches back to Queen Victoria and continues up to\nElizabeth II.\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:487bea7acb0ad9fa45f4e9ed0e8d69a79f3a620a","amp;dn":"Kings+and+Queens+of+England++%28History+Channel+-+2004%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"487bea7acb0ad9fa45f4e9ed0e8d69a79f3a620a","infoHashBuffer":{"type":"Buffer","data":[72,123,234,122,203,10,217,250,69,244,233,237,14,141,105,167,159,58,98,10]},"announce":[],"urlList":[]}}