{"title":"Lego Bionicle PC Game","uid":6727841,"size":1167206400,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:491f7e6df860cc002aa24f373b8ee3708f179039&amp;dn=Lego+Bionicle+PC+Game&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"punk_oll","files":-1,"time":1318008646,"description":"Playing as the Toa, Toa Nuva and finally the 7th Toa, you must explore the six elementally-themed regions of Mata Nui - a tropical paradise of high mountains, great lakes and mighty volcanoes - rescue the scattered Matoran and break the spell of darkness sent by the evil Makuta. In doing so you will face danger in equal measure from the islands many environmental hazards (including falling rocks, rainforest winds, icicles and lava falls) and the foul minions of Makuta. So whether youre a skilled player or a young gamer, the time has come to emerge from behind your mask. The fate of Mata Nui is now in your hands...\nFeatures\n\n    Play as the six Toa heroes: Battle the forces of evil.\n\n    Use the unique powers of the Toa: Summon &quot;blasts&quot; of elemental energy to defeat your enemies.\n\n    Explore the island of Mata Nui: Six stunning environments, covering jungles, mountains, lakes, and more. Cross a molten river, glide from tree to tree on thermals, and swim in the deep waters of Lake Naho. Snowboard down Mount Ihu, surf through lava rapids, and use the Mask of Speed to race through Pohatu's desert.\n\n    Master the gameplay: A unique blend of subtle puzzle-solving and gripping action-adventure.\n\n    Rescue villagers: Interact with Matoran villagers scattered across Mata Nui.\n    Prepare for battle: Fight against the Bohrok and the Rahkshi, and take on the ultimate challenge of defeating Makuta in his own lair.\n\n    Collect pick-ups: Increase your elemental powers.\n\n    Find the Mask of Light: Use it to become the mighty seventh Toa, the Toa of Light. \n\n\n\n\n\n\nOperating system: Microsoft WindowsÃ‚Â® 98/2000/ME/XP\nProcessor: 600 MHz Intel Pentium III processor or 100% Compatible\nMemory: 64MB RAM\nCD-DVD: 4x CD ROM/DVD drive\nGraphics Card: 32MB Direct3D video card with DirectX 9 compatible driver (with hardware T&amp;L support) ","torrent":{"xt":"urn:btih:491f7e6df860cc002aa24f373b8ee3708f179039","amp;dn":"Lego+Bionicle+PC+Game","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"491f7e6df860cc002aa24f373b8ee3708f179039","infoHashBuffer":{"type":"Buffer","data":[73,31,126,109,248,96,204,0,42,162,79,55,59,142,227,112,143,23,144,57]},"announce":[],"urlList":[]}}