{"title":"Horace Silver - 1962 - The Tokyo Blues CD and vinyl FLAC","uid":8399779,"size":687068184,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4a00ff657cfd4db1d8015f5754a1b6d6187ea1e1&amp;dn=Horace+Silver+-+1962+-+The+Tokyo+Blues+CD+and+vinyl+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eika256","files":-1,"time":1366665998,"description":"Horace Silver - 1962 - The Tokyo Blues Blue Note vinyl (mono)\nHorace Silver - 1962 - The Tokyo Blues (2009) (RVG remaster)\n\nFollowing a series of concert dates in Tokyo late in 1961 with his quintet, Horace Silver returned to the U.S. with his head full of the Japanese melodies he had heard during his visit, and using those as a springboard, he wrote four new pieces, which he then recorded at sessions held on July 13 and 14, 1962, along with a version of Ronnell Bright's little known ballad &quot;Cherry Blossom.&quot; One would naturally assume the resulting LP would have a Japanese feel, but that really isn't the case. Using Latin rhythms and the blues as a base, Silver's Tokyo-influenced compositions fit right in with the subtle cross-cultural but very American hard bop he'd been doing all along. Using his usual quintet (Blue Mitchell on trumpet, Junior Cook on tenor sax, Gene Taylor on bass) with drummer Joe Harris (he is listed as John Harris, Jr. for this set) filling in for an ailing Roy Brooks), Silver's compositions have a light, airy feel, with plenty of space, and no one used that space better at these sessions than Cook, whose tenor sax lines are simply wonderful, adding a sturdy, reliable brightness. The centerpieces are the two straight blues, &quot;Sayonara Blues&quot; and &quot;The Tokyo Blues,&quot; both of which have a delightfully natural flow, and the building, patient take on Bright's &quot;Cherry Blossom,&quot; which Silver takes pains to make sure sounds like a ballad and not a barely restrained minor-key romp. The bottom line is that The Tokyo Blues emerges as a fairly typical Silver set from the era and not as a grandiose fusion experiment welding hard bop to Japanese melodies. That might have been interesting, certainly, but Silver obviously assimilated things down to a deeper level before he wrote these pieces, and they feel like a natural extension of his work rather than an experimental detour.\n\nBlue Mitchell - trumpet\nJunior Cook - tenor sax\nHorace Silver - piano\nGene Taylor - bass\nJohn Harris, Jr. - drums\n\nTrack list:\n01. Too Much Sake\n02. Sayonara Blues\n03. The Tokyo Blues\n04. Cherry Blossom\n05. Ah! So\n\nAll compositions by Horace Silver, except &quot;Cherry Blossom&quot;- by Ronnell Bright\nRecorded on July 13 (#2 &amp; 3) and 14 (#1, 4, 5) 1962\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:4a00ff657cfd4db1d8015f5754a1b6d6187ea1e1","amp;dn":"Horace+Silver+-+1962+-+The+Tokyo+Blues+CD+and+vinyl+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a00ff657cfd4db1d8015f5754a1b6d6187ea1e1","infoHashBuffer":{"type":"Buffer","data":[74,0,255,101,124,253,77,177,216,1,95,87,84,161,182,214,24,126,161,225]},"announce":[],"urlList":[]}}