{"title":"Matching Properties of Deep Sub-Micron MOS Transistors","uid":6512291,"size":12355056,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4a04fdeb2f42184bae5bab214e332bd6a0b46545&amp;dn=Matching+Properties+of+Deep+Sub-Micron+MOS+Transistors&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_F1_","files":-1,"time":1309681268,"description":"Jeroen A. Croon, Willy Sansen, Herman E. Maes, &quot;Matching Properties of Deep Sub-Micron MOS Transistors&quot; \n Publisher: Springer | ISBN: 0387243143 | edition 2005 | PDF | 206 pages | 12 mb\n\n Matching Properties of Deep Sub-Micron MOS Transistors examines this interesting phenomenon. Microscopic fluctuations cause stochastic parameter fluctuations that affect the accuracy of the MOSFET. For analog circuits this determines the trade-off between speed, power, accuracy and yield. Furthermore, due to the down-scaling of device dimensions, transistor mismatch has an increasing impact on digital circuits. The matching properties of MOSFETs are studied at several levels of abstraction:\n A simple and physics-based model is presented that accurately describes the mismatch in the drain current. The model is illustrated by dimensioning the unit current cell of a current-steering D/A converter.\n The most commonly used methods to extract the matching properties of a technology are bench-marked with respect to model accuracy, measurement accuracy and speed, and physical contents of the extracted parameters. \n The physical origins of microscopic fluctuations and how they affect MOSFET operation are investigated. This leads to a refinement of the generally applied 1/area law. In addition, the analysis of simple transistor models highlights the physical mechanisms that dominate the fluctuations in the drain current and transconductance. \n The impact of process parameters on the matching properties is discussed. \n The impact of gate line-edge roughness is investigated, which is considered to be one of the roadblocks to the further down-scaling of the MOS transistor. \n Matching Properties of Deep Sub-Micron MOS Transistors is aimed at device physicists, characterization engineers, technology designers, circuit designers, or anybody else interested in the stochastic properties of the MOSFET.","torrent":{"xt":"urn:btih:4a04fdeb2f42184bae5bab214e332bd6a0b46545","amp;dn":"Matching+Properties+of+Deep+Sub-Micron+MOS+Transistors","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a04fdeb2f42184bae5bab214e332bd6a0b46545","infoHashBuffer":{"type":"Buffer","data":[74,4,253,235,47,66,24,75,174,91,171,33,78,51,43,214,160,180,101,69]},"announce":[],"urlList":[]}}