{"title":"Can.U.Feel.It .The.UMF.Experience.480p.DVDRip.XVID-ORJAKONE","uid":8881573,"size":1123436580,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4a1ea3e9fdf047b4fbc66f441593c922a303fb9d&amp;dn=Can.U.Feel.It+.The.UMF.Experience.480p.DVDRip.XVID-ORJAKONE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1378338028,"description":"CAN U FEEL IT is the experience of UMF on the big screen. It's a feature length film about a new generation seen through the eyes of the world's greatest DJs. Tiesto, David Guetta, Carl Cox, Afrojack, Fedde le Grand, Boys Noize will be the headlining superstars that will take you on an electrifying journey through UMF and the world of dance music. The film makes you feel like you are on the dance floor and in the DJ booth at the same time and has the pace and feel of a music video mixed with in-depth storylines on the artists, the event and especially the rise of dance music around the world. UMF is the world's premiere electronic music festival. It is like the Olympics for electronic dance music (EDM) and every year during Miami Music Week all the major EDM artists and fans from around the world collide in Miami for this ultimate experience in dance music. &quot;It's the biggest dance party in the world&quot; says Tiesto about UMF. &quot;The whole world is dancing now&quot;, says David Guetta explaining the global explosion of dance music. Get closer than ever before and feel the vibe and the energy of the UMF experience. CAN U FEEL IT? *Also featuring: Armin van Buuren, Avicii, Steve Aoki, Laidback Luke and Will.i.am. The film was shot during UMF Miami in 2011.","torrent":{"xt":"urn:btih:4a1ea3e9fdf047b4fbc66f441593c922a303fb9d","amp;dn":"Can.U.Feel.It+.The.UMF.Experience.480p.DVDRip.XVID-ORJAKONE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a1ea3e9fdf047b4fbc66f441593c922a303fb9d","infoHashBuffer":{"type":"Buffer","data":[74,30,163,233,253,240,71,180,251,198,111,68,21,147,201,34,163,3,251,157]},"announce":[],"urlList":[]}}