{"title":"The Internal Mystery Plays (August L. Reader), fixed","uid":10711973,"size":93621,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4a4aaf191fac22fbfeb79083d803fb547fee9d44&amp;dn=The+Internal+Mystery+Plays+%28August+L.+Reader%29%2C+fixed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":2,"time":1407368729,"description":"\nTHE INTERNAL MYSTERY PLAYS: THE ROLE AND PHYSIOLOGY OF THE VISUAL SYSTEM IN CONTEMPLATIVE PRACTICES\n\nAuthor: August L. Reader III\n\nAbstract\n\nIn summary, the &quot;White Light&quot; and the imagery reported in contemplative practices appears to be a complex system of reflexes that mediate ischemia to the cerebral cortex, stimulating &quot;release&quot; of the occipital poles and the rostral midbrain to discharge these images in any profound state of cellular agony. These vascular events are mediated by way of the autonomic nervous system, either accidentally or purposefully, thus acquiring a near-death experience. Understanding the mechanism of the reflexes has taken many years and thousands of researchers to elucidate. In spite of these discoveries and those yet to come, no one will ever fully know why these reflexes and the sensations associated with them exist, or why they cause such profound psychic, physical, and spiritual changes in the individuals who have them. At this point, I can only be humbled by the process that has brought me to the paradigm I have described. I only know that most of the connections and correlations expressed in this article were the product of some of those methods mentioned herein; therefore, I cannot, and will not, take credit for that portion provided by the Guiding Spirit. Thus, the internal mysteries of the brain will always hide the Inner Mysteries, although the heart will always have a way of finding the right answers. We have become the Uroboric serpent (the serpent that eats its tail), in that we have returned to the ancient Egyptians' way of considering the eye as the seat of the soul and the doorway into the Inner Mysteries of the religious experience. Now, we find that in many ways they were correct that the eye, through its physiology, is another key to understanding these Inner Mysteries.\n\n(Fixed issue with previous upload)","torrent":{"xt":"urn:btih:4a4aaf191fac22fbfeb79083d803fb547fee9d44","amp;dn":"The+Internal+Mystery+Plays+%28August+L.+Reader%29%2C+fixed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a4aaf191fac22fbfeb79083d803fb547fee9d44","infoHashBuffer":{"type":"Buffer","data":[74,74,175,25,31,172,34,251,254,183,144,131,216,3,251,84,127,238,157,68]},"announce":[],"urlList":[]}}