{"title":"WinRAR 4.01 NL incl. regkey en thema's","uid":6474405,"size":28858047,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4b2854fb03228b41ba71c3c93e18c8306548e0d3&amp;dn=WinRAR+4.01+NL+incl.+regkey+en+thema%5C%27s&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"djjlicious","files":130,"time":1308264760,"description":"    Volledige ondersteuning van RAR- en ZIP archieven\n    Hoogtechnologisch, uniek compressiealgoritme, geoptimaliseerd voor multimediagegevens\n    Archiefgrootte tot 8 589 934 591 GB!\n    Ondersteuning van NTFS-beveiliging en datastreams\n    Sterke versleuteling, voor het afschermen van (zeer) gevoelige gegevens (AES 128-bits encryptie)\n    Omgevingsinterface met &quot;Drag en drop&quot;\n    Absolute verzegeling d.m.v. &quot;digitale handtekening&quot; (waarmerkcontrole)\n    Ondersteuning van niet-RAR archieven: 7Z, ACE, ARJ, BZ2, CAB, GZ, ISO, JAR, LZH, TAR, UUE, Z\n    Compact inpakken waardoor de compressie met 5 tot 50% kan verhogen\n    Multivolume archieven volgens instelbare grootte, met CRC-controle\n    WinRAR biedt een klassieke interactieve Windows-interface, maar kent daarnaast ook een opdrachtregel-interface\n    Maken van zelfuitpakkende archieven (ook multivolumes) m.b.v. standaard of optionele SFX-module\n    Ondersteuning van Unicode in bestandsnamen\n    Mogelijkheid tot bijvoegen van een herstelbestand\n\nNieuw in Versie 4.01\n\n1. Ondersteuning toegevoegd aan binair opgeslagen bestandsgroottes in TAR-archieven. \nEnkele TAR-archieven gebruiken de binaire grootte-indeling in plaats van de octale vorm voor bestanden groter dan 8 GB.\n\n2. Fouten verbeterd:\n\na) opdracht &quot;Herstellen&quot; mislukte bij het reconstrueren van de structuur van RAR-archieven die minimaal ÃƒÂ©ÃƒÂ©n bestand bevatten met een ingepakte grootte groter dan 4 GB.\nDeze fout had geen invloed op herstel gebaseerd op herstelvolumes. Het deed zich enkel voor indien geen herstelvolume was gevonden en WinRAR reconstructie uitvoerde van de archiefstructuur;\n\nb) zelfs als de optie &quot;Paden niet uitpakken&quot; in het tabblad &quot;Uitgebreid&quot; van het uitpakdialoogvenster was ingesteld als standaardwaarde, dan nog pakte WinRAR bestandspaden uit op het moment dat deze werd opgestart vanuit het rechtermuisknopmenu van Windows Verkenner.\n\nc) na het invoeren van een verkeerd wachtwoord voor een versleuteld ZIP-archieven, negeerde WinRAR in enkele gevallen volgende pogingen om een geldig wachtwoord in te voeren;\n\nd) de opdracht &quot;Wizard&quot; maakte het niet mogelijk om zelf-uitpakkende en multivolume-archieven te maken bij het inpakken van een enkele map of een bestand zonder extensie.\n\ne) de opdracht &quot;Instellingen importeren vanuit bestand&quot; herstelde niet meerregelig commentaar in WinRAR-compressieprofielen;\n\nf) bij het omzetten van RAR-archieven met naamgeving in de indeling 'naam1.naam2.part#.rar' haalde de opdracht &quot;Archieven omzetten&quot; foutief het deel &quot;.name2&quot; weg. Hierdoor had de uiteindelijke archiefnaam de vorm 'naam1.rar' in plaats van 'naam1.naam2.rar'.\n\ng) RAR kon mogelijk vastlopen bij het maken van een nieuw archief met de schakeloptie '-agNNN' indien het archiefnummer in de gegenereerde naam 110 of groter zou zijn.\n\nh) WinRAR gaf niet-Engelstalige bestandsnamen juist weer in 7-Zip-archieven wanneer deze een niet-standaard codepagina in gebruik hadden. Het probleem deed zich enkel voor bij het weergeven, de namen werden wel goed verwerkt bij het uitpakken.\n\n\n\nLees de leesmij.txt en veel plezier!! En wel blijven delen, niet afhaken als die binnen is!!","torrent":{"xt":"urn:btih:4b2854fb03228b41ba71c3c93e18c8306548e0d3","amp;dn":"WinRAR+4.01+NL+incl.+regkey+en+thema%5C%27s","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b2854fb03228b41ba71c3c93e18c8306548e0d3","infoHashBuffer":{"type":"Buffer","data":[75,40,84,251,3,34,139,65,186,113,195,201,62,24,200,48,101,72,224,211]},"announce":[],"urlList":[]}}