{"title":"Boeing - B737, 600, 700, 800.iso.rar","uid":3677089,"size":389497389,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4b9ac3a8b4ab3896554d239b3bd42214b3d0893a&amp;dn=Boeing+-+B737%2C+600%2C+700%2C+800.iso.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"chattanooga","files":1,"time":1177953497,"description":"An old one!\n\n--------------------------\n\n                         Guide to Installation of\n                   Boeing 737-600/700/800 Authorware CBT\n\n\nHardware Requirements\n\nTo run Boeing 737 Authorware CBT in Windows 3.x or Windows 95 from \nthe CD-ROMs, the student station requires the following hardware:\n\n  486/66 CPU or better (Pentium recommended)\n  16 MB RAM (32 MB recommended)\n  1024x768 pixel, 256 color display\n  SoundBlaster compatible audio\n  Speaker or headphones\n  Mouse\n  CD-ROM reader (4x or faster)\n  Disk space for about 3.2 MB of overhead files and a 20 MB swap file \n\nDepending on your system configuration, performance may be enhanced by \ncopying the contents of the CD-ROMs to your hard disk or server and \nrunning the programs from there.  If you do this, you will not need the \nCD-ROM reader to run them but you will need approximately the following \namounts of additional disk space to store them: \n\n   220 MB for 737 Flight Differences CBT (English)\n   240 MB for 737 Flight Differences CBT (Metric)\n  1050 MB for 737 Flight Transition CBT\n   810 MB for 737 Maintenance CBT (including about 160 MB for ILCBT)\n\n\nInstalling the Router and Other Overhead Files\n\n1. If you are installing 737 Flight CBT on a station that already has 737 \n   Maintenance CBT, or vice versa, rename the program group or Start \n   Programs menu item for the CBT that is already installed (for example, \n   &quot;Boeing 737 CBT Router&quot;) to &quot;Boeing 737 Flight CBT&quot; or &quot;Boeing 737 \n   Maintenance CBT&quot; as appropriate.  (See &quot;Renaming a Windows 3.x Program \n   Group&quot; or &quot;Renaming a Windows 95 Start Programs Item&quot; below.)\n\n2. Insert the first CD-ROM into the CD-ROM drive.\n\n3. Using the Windows 3.x File Manager or Windows 95 Explorer, find \n   SETUP.EXE in the root directory of the CD-ROM.\n\n4. Execute SETUP.EXE by double-clicking it.\n\n5. Follow the on-screen instructions.\n\n   a. When SETUP asks for the &quot;Installation directory&quot;, indicate the \n      drive letter and directory where you want to install the overhead \n      files.\n\n      (1) If you are installing CBT in place of a prior version of the \n          same CBT, specify the same directory.\n\n      (2) If you are installing Flight CBT on a station that already has \n          (or will have) 737 Maintenance CBT (or vice versa), specify \n          a directory name that signifies Flight or Maintenance as \n          appropriate (for example, 737F_CBT or 737M_CBT).\n\n      (3) If the &quot;Installation directory&quot; is a network (server) location \n          and you want more than one student station to share it, be sure \n          to specify the same location each time you run SETUP.\n\n   b. When SETUP offers you the choice of modifying your AUTOEXEC.BAT \n      file or putting the changes in CMI_UP.BAT, select the latter and\n      click OK.  When a window advises you to exit Windows and run the \n      CMI_UP.BAT program before running the CBT, ignore the advice and \n      click OK.  (The modifications and CMI_UP.BAT were to enable use of\n      a Boeing CMI program that is no longer available.)\n\n   To enable you to start the CBT, SETUP creates a Windows 3.x program \n   group containing icons or adds the name of the courseware to the \n   Windows 95 Start Programs menu.  It also installs all of the system \n   support files (such as fonts &amp; DLLs) needed to run the CBT \n   courseware.  It does not copy the lesson files to your hard disk or \n   server. \n\n6. If you are using Windows 95, proceed as follows:\n\n   a. If a window titled &quot;C:WINDOWSStart MenuProgramsBoeing 737 CBT \n      Router&quot; remains when SETUP is done, close it.\n\n   b. If you wish to have an icon on your PC desktop for starting the\n      CBT, proceed as follows:\n\n      (1) Using the Windows 95 Explorer, find SROUTER.EXE where \n          SETUP installed it.\n\n      (2) Click and drag SROUTER.EXE from the Explorer to your \n          desktop.  (This leaves the SROUTER.EXE file in place but \n          creates a shortcut.)\n\n      (3) Using your right mouse button, click the title (SROUTER.EXE) \n          under the icon.  Select Rename.  Then type the new title (for\n          example, 737-700 Maintenance CBT) and press the Enter key.\n\n7. If you installed 737 Flight CBT on a station that already had 737 \n   Maintenance CBT, or vice versa, rename the &quot;Boeing 737 CBT Router&quot; \n   program group or Start Programs menu item (for the CBT that you just \n   installed) to &quot;Boeing 737 Flight CBT&quot; or &quot;Boeing 737 Maintenance CBT&quot; \n   as appropriate. (See &quot;Renaming a Windows 3.x Program Group&quot; or \n   &quot;Renaming a Windows 95 Start Programs Item&quot; below.)\n\n8. The LESSONS.LST file installed by SETUP expects the lesson files to be \n   stored on drive D:.  If your CD-ROM reader is not D:, you must edit \n   each line of the LESSONS.LST file in your &quot;Installation directory&quot; to \n   change D: to the correct drive letter.  (See &quot;Editing Files&quot; and \n   &quot;LESSONS.LST:  List of Lesson Titles and File Locations&quot; below.)  Then \n   mark the file as read-only to avoid inadvertent changes to it.  (See \n   &quot;Marking a File as Read-Only&quot; below.)\n\n9. Test the router installation:\n\n   a. If you are using Windows 95, click Start, Programs, Boeing 737 CBT \n      Router (or Boeing 737 Flight CBT or Boeing 737 Maintenance CBT), and \n      then 737 CBT Router, or on your desktop double-click your 737 CBT \n      shortcut icon.\n\n   b. If you are using Windows 3.x, in Program Manager open the Boeing \n      737 CBT Router (or Boeing 737 Flight CBT or Boeing 737 Maintenance \n      CBT) program group and then double-click the 737 CBT Router icon.\n\n   c. Select a lesson, use it until you are satisfied it is running\n      satisfactorily, and then exit from the lesson.  Try other lessons\n      briefly.\n\n\nInstalling the Courseware on a Hard Disk or Server\n\nThe lessons can run from the CD-ROM drive.  However, depending on your \nsystem configuration, performance may improve if you copy the contents \nof the CD-ROM to your hard disk or server and run the lessons from \nthere.  To do this, complete steps #1-7 above on each station where you \nwant to run the courseware, and then proceed as follows:\n\n1. To learn how much disk space will be required to store the courseware \n   from each CD-ROM, use Windows 3.x File Manager (click the CD-ROM \n   reader and read the total disk space at the bottom of the window) or \n   Windows 95 Explorer (right-click the CD-ROM reader and select \n   Properties).  To learn if you have sufficient space on the drive(s) \n   where you intend to install the courseware, use the same method but \n   read the space free.\n\n2. Copy the CBT lessons to the hard disk of your station or server.  To \n   accomplish this, &quot;drag and drop&quot; the directory (or directories) \n   containing the lessons and modules (for example, SPCBT) from the \n   CD-ROM to the installation directory.  The lesson and module files \n   will then reside in their own directories with all their supporting \n   files (*.MNU, *.SPT, *.PRC *.TXT, *.GLO, etc.), just as they do on the \n   CD-ROM.\n\n3. If there is a directory called FIXDDISK on the CD-ROM, copy the \n   LESSONS.LST file from that directory to the installation directory,\n   overwriting the one installed by SETUP.\n\n4. Edit the LESSONS.LST file in the installation directory:\n\n   a. If the optional [Volume|Volume_Title] is present, delete it \n      everywhere it appears.\n \n   b. Make sure the path for each lesson file (*.APP) is correct.\n     (See the description of LESSONS.LST below.)  \n\n5. Mark the LESSONS.LST file as read-only to avoid inadvertent changes to \n   it.  (See &quot;Marking a File as Read-Only&quot; below.)\n\n6. Test the installation as described in step #9 of &quot;Installing the \n   Router&quot;, above.\n\n\nThe Router Program\n\nThe 737 CBT Router is a program designed specifically to launch 737 CBT \nlessons.  It is a simple menu system --- NOT a CMI program.  It does NOT \nhave student login, data collection, or reporting.  The 737 lessons were \ndesigned for use with a separate CMI program compatible with version 1.9 \nof the AICC CMI Guidelines for Interoperability.\n\n\nRunning the 737 CBT Router and Lessons\n\nTo run the 737 CBT Router, see step #9 of &quot;Installing the Router and \nOther Overhead Files&quot; above.\n\nIf there are more than 14 lessons in your lesson list, they will be \nbroken into &quot;pages&quot; (14 lessons or fewer per page).  Use the &quot;paging \narrows&quot; at the bottom of the screen to move between pages.  The page \nnumber is displayed at the bottom of the screen.\n\nTo run a lesson, click its name on the menu.\n\nTo quit the router, click the EXIT button.\n\n[etc...]","torrent":{"xt":"urn:btih:4b9ac3a8b4ab3896554d239b3bd42214b3d0893a","amp;dn":"Boeing+-+B737%2C+600%2C+700%2C+800.iso.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b9ac3a8b4ab3896554d239b3bd42214b3d0893a","infoHashBuffer":{"type":"Buffer","data":[75,154,195,168,180,171,56,150,85,77,35,155,59,212,34,20,179,208,137,58]},"announce":[],"urlList":[]}}