{"title":"Richard_Egel - The Molecular Biology of Schizosaccharomyces pomb","uid":9852840,"size":10322357,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4c6e39aebf5ea092ccc0dc58b0f9c8b218cff9b5&amp;dn=Richard_Egel+-+The+Molecular+Biology+of+Schizosaccharomyces+pomb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"lesmen","files":1,"time":1396174677,"description":"The fission yeast Schizosaccharomyces pombe is the favoured tool of many productive research groups throughout the world, serving as a useful model for fundamental principles and mechanisms, such as genome organization, differential gene regulation, cell-cycle control, signal transduction, or cellular morphogenesis. This book collates the current state of knowledge derived from molecular studies in this simple eukaryotic microorganism. The entire sequence of its genome has been completed, emphasizing the comparative value and model status of this yeast. The individual chapters, highlighting up-to-date views on prominent aspects of molecular organization, were written by active research scientists, presenting the results of their investigations to other workers in neighbouring fields. This book intends to serve the fission yeast community as a handy source of reference for years to come. It will also be of particular value to the ever-increasing number of researchers starting to look into fission yeast affairs for comparative reasons from other platforms of molecular genetics and cell biology.","torrent":{"xt":"urn:btih:4c6e39aebf5ea092ccc0dc58b0f9c8b218cff9b5","amp;dn":"Richard_Egel+-+The+Molecular+Biology+of+Schizosaccharomyces+pomb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c6e39aebf5ea092ccc0dc58b0f9c8b218cff9b5","infoHashBuffer":{"type":"Buffer","data":[76,110,57,174,191,94,160,146,204,192,220,88,176,249,200,178,24,207,249,181]},"announce":[],"urlList":[]}}