{"title":"Paprika Recipe Manager v. 1.1.0 [K]racked","uid":6977193,"size":3727078,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:4f7ba4b1ed6b6f3362bfaade5792b551e568e238&amp;dn=Paprika+Recipe+Manager+v.+1.1.0+%5BK%5Dracked&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"polisdavid","files":-1,"time":1327299620,"description":"Official Web Site: &lt;a href=&quot; http://www.paprikaapp.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.paprikaapp.com/&lt;/a&gt;\n\nDescription\n\nPaprika Recipe Manager is a delightfully simple recipe management for everyone: from aspiring cooks to professional chefs. With ingredient scaling, grocery lists and meal planning, Paprika is the perfect kitchen companion. If you love to cook, Paprika will be most useful app you've ever downloaded!\n\nFeatures:\n\n* Automatically download recipes with a single tap from more than 100\n  supported sites. Supported site list: http://www.paprikaapp.com/sites\n\n* Innovative clipboard tools let you copy and paste recipe information\n  from any website..\n\n* Quickly scale recipe ingredients to your desired serving size.\n\n* Add personalized notes to each recipe.\n\n* Track nutritional information (automatically saved from sites which\n  provide it).\n\n* Easily manage your grocery list: add recipes with a single click, as well\n  as your own items.\n\n* No-hassle meal planning: add specific recipes or custom entries into the\n  weekly meal planner.\n\n* Customizable categories: assign recipes to multiple categories.\n\n* Powerful search tools help you easily find any recipe by source,\n  ingredient or name.\n\n* Full printing and emailing support for recipes, grocery lists, and meal\n  plans.\n\n* Share recipes via email (that other Paprika users can automatically\n  import).\n\n* Backup and restore keeps your recipe collection safe.\n\n* Import from popular desktop apps such as MacGourmet, YummySoup!\n  and MasterCook.\n\n* Cloud sync between Mac OS X, iPads, iPhones and iPod Touches.\n\n* Offline access. All of your data is stored locally, no internet connection\n  is required.\n\n* Bookmarklet. Capture recipes from your web browser straight into your\n  Paprika - Cloud Sync account.\n\n\n\nWhat's New:\n\nGrocery List Improvements\n\n* The grocery list now consolidates similar ingredients (so '1 egg' and '2\n  eggs' will be added together and displayed as '3 eggs').\n\n* The grocery list now displays items sorted by grocery store aisle instead\n  of by the recipe name (so milk shows up under Dairy and carrots show\n  up under Produce).\n\n* When adding recipes to the grocery list, you can now select/deselect\n  individual ingredients to add (instead of always adding the entire recipe).\n\n* You can also now add the same recipe to the grocery list more than\n  once.\n\nBug Fixes\n\n* Fixed an issue with selecting certain dates in the meal planner.\n\n* Fixed an issue when adding new categories with blank names.\n\n* Fixed a potential corruption problem when emailing recipe attachments.\n\nOther Improvements\n\n* Added significant performance enhancements for users with databases\n  containing over 20,000 recipes.\n\n* Improved the performance of the app while running Paprika Cloud\n  Sync.\n\n* Improved the print and email formatting of recipes, grocery lists, and\n  meal plans.\n\n* You can now update recipe photos via drag and drop onto the image\n  well when editing a recipe.\n\nSystem Requirements:\n\nIntel Mac, OS X.7 or greater\n\n--- PLEASE SEED ---\n","torrent":{"xt":"urn:btih:4f7ba4b1ed6b6f3362bfaade5792b551e568e238","amp;dn":"Paprika+Recipe+Manager+v.+1.1.0+%5BK%5Dracked","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f7ba4b1ed6b6f3362bfaade5792b551e568e238","infoHashBuffer":{"type":"Buffer","data":[79,123,164,177,237,107,111,51,98,191,170,222,87,146,181,81,229,104,226,56]},"announce":[],"urlList":[]}}