{"title":"EnigmaT Set Rips { Cuts } - May 25th, 2014","uid":10219425,"size":881989349,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:504ad4a77be10b7c962b18a0b41b1ef7df06ea35&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+May+25th%2C+2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EnigmaT","files":93,"time":1401014388,"description":"4 Strings - Living Colors (ASOT 664 Rip)-enTc\nAaron Camz vs. Solis &amp; Sean Truby - Consequence (GDJB Rip)-enTc\nAimoon - Krosha (Original Mix) (Cut From Aimoon Set)-enTc\nAirzoom - A Little Peace (Imida Remix) (Cut From Blue Silence Set)-enTc\nAlae Khaldi &amp; Sergei Kanev - Lifelapse (Cut From Cosmic Gate Set)-enTc\nAlex Aark feat. Meron - Along With The Stars (Original Mix) (ABGT 080 Rip)-enTc\nAlex Kenji feat. Dacia Bridges - I Feel (Cut From SVD Set)-enTc\nAlpha Duo - Imperium (Alexander One Remix) (Cut From Jong Set)-enTc\nAndre van Reese - Recovered (Cut From GO Set)-enTc\nAndrew Rayel Feat. Jonathan Mendelsohn - One In A Million (ASOT 664 Rip)-enTc\nAnske - Vilnius (GDJB Rip)-enTc\nArem Ozguc - Breaking Back (Cut From Hardwell Set)-enTc\nArisen Flame - Magnus (ASOT 664 Rip)-enTc\nArmin van Buuren - Ping Pong (Iversoon &amp; Alex Daf Bootleg) (Cut From El Jay Set)-enTc\nArmin van Buuren Feat. Ayu - Terminal (Dub Mix) (ASOT 664 Rip)-enTc\nAstraeus - When We Connect (Paul Denton Remix) (Cut From Temple Set)-enTc\nAudiocells - Thunderbird (Mike Saint-Jules Remix) (Cut From Feel Set)-enTc\nBingo Players - Knock You Out (Hardwell Remix) (Cut From Hardwell Set)-enTc\nBorgeous - Wildfire (Cut From SVD Set)-enTc\nChanges - Obedience (Original Mix) (Cut From El Jay Set)-enTc\nCitizen Kain &amp; Phuture Traxx - Libido (Original Mix) (Cut From Arnej Set)-enTc\nCJ Bolland - The Prophet (Walsh &amp; McAuley Remix) (Cut From Sherry Set)-enTc\nClouds - Articles (Arnej Rework) (Cut From Arnej Set)-enTc\nCold Blue - Human (Original Mix) (Cut From Temple Set)-enTc\nCosmic Gate - Happyness (Original Mix) (ABGT 080 Rip)-enTc\nCosmic Gate feat. Sarah Lynn - Sparks After The Sunset (Album Mix) (Cut From Cosmic Gate Set)-enTc\nCraft Integrated - New Dimension (Cut From GO Set)-enTc\nDan Stone - Orinoco (ASOT 664 Rip)-enTc\nDavid Morales - Needin' U (Steve Brian Bootleg) (ABGT 080 Rip)-enTc\nDavid Temessi - Bow Down (MicRoCheep &amp; Mollo Remix) (Cut From Valentine Set)-enTc\nDeorro &amp; J-Trick - Rambo (Hardwell Edit) (Cut From Hardwell Set)-enTc\nDimitri Vegas &amp; Like Mike vs. Diplo &amp; Fatboy Slim feat. Bonde do Role &amp; Pin - Eparrei (W&amp;W Remix) (Set Rip)-enTc\nDJ Arabesque vs. Jakyro - Strance (Jakyro Remix) (Cut From Valentine Set)-enTc\nDomeno &amp; Mikey Salerno - Science (Cut From Hardwell Set)-enTc\nDreamy feat. Isa Bell - Because You Are (Paul Rigel Remix) (Cut From Feel Set)-enTc\nEDU &amp; Kristoffer Ljungberg - Outbreak (Aerofoil Remix) (Cut From MIKE Set)-enTc\nEDU &amp; Kristoffer Ljungberg - Outbreak (Stan Arwell Remix) (ABGT 080 Rip)-enTc\nELV - Eminence (Original Mix) (-SPAMMED- Cut From Feel Set)-enTc\nFabio XB &amp; Mike Saint Jules - Throne (ASOT 664 Rip)-enTc\nFerry Tayle Feat. Poppy - The Way Back Home (Monoverse Remix) (ASOT 664 Rip)-enTc\nFher Vizzuett - Saviour (Original Mix) (Cut From Allen&amp;Envy Set)-enTc\nFrankie Goes to Hollywood - Two Tribes (Rex Mundi Drive Mix) (GDJB Rip)-enTc\nGai Barone - Cartaria (Relaunch Early Morning Remix) (GDJB Rip)-enTc\nGaia - Empire of Hearts (Matt Bukovski Bootleg) (Set Rip)-enTc\nGal Abutbul &amp; Tim Briggs - Revert (ASOT 664 Rip)-enTc\nHarry Square - All You Can Eat (GDJB Rip)-enTc\nHenry Fong &amp; Reece Low - Slapjack (Cut From SVD Set)-enTc\nID - Blackwolf (Cut From Hardwell Set)-enTc\nID - High Voltage (Cut From Arnej Set)-enTc\nID feat. ID - ID (Rex Mundi Remix) (GDJB Rip)-enTc\nIssy - Burduga (Original Mix) (Cut From Shah Set)-enTc\nJethimself - Solar Wind (Dallonte Remix) (Cut From Shah Set)-enTc\nJoze - Sorted Pipes (Tasso Remix) (Cut From Allen&amp;Envy Set)-enTc\nJunior Sanchez &amp; Kaz James feat. Felix Da Housecat - Underground Police (Cut From SVD Set)-enTc\nKay Stone &amp; Dark Moon - Last Moonlight (Cut From RAM Set)-enTc\nKeemo &amp; Schild feat. Justin Hopkins - Revolution (Sunset Chill) (Cut From Shah Set)-enTc\nKheDa - Typhoon (Alter Future Remix) (GDJB Rip)-enTc\nKill The Buzz - Carbon (Cut From Hardwell Set)-enTc\nLence &amp; Pluton featuring Irina Makosh - Never Too Late (GDJB Rip)-enTc\nLove N Frequency - Distorted Reality (Original Mix) (Cut From Feel Set)-enTc\nMagnus - 2nd Born (ASOT 664 Rip)-enTc\nMarie Marie - Cotton Candy Hurricane (Brian Laruso's Vatos Locos Edit) (Cut From Shah Set)-enTc\nMark Found - Donum (Cut From MIKE Set)-enTc\nMatt Eray - Moments Like This (Cut From GO Set)-enTc\nMax Go, Chris Lawr &amp; Cami - Wayward Love (Dave Correa Dub Remix) (Cut From 9Axis Set)-enTc\nMike Hawkins - Revolt (Cut From SVD Set)-enTc\nMorvan - Absolutely (ASOT 664 Rip)-enTc\nNDKj - Fat Plus (Markantonio Remix) (Cut From Valentine Set)-enTc\nNERVO feat. Duane Harden - Sunshine Thru Rain Clouds (Cut From SVD Set)-enTc\nOmnia &amp; Ana Criado - No One Home (Monochrome Bootleg) (-SPAMMED- Cut From Feel Set)-enTc\nPaul Oakenfold - Ready Steady Go (Beatman &amp; Ludmilla Remix) (Cut From Tydi Set)-enTc\nPhilippe El Sisi &amp; Abstract Vision feat. Jilliana Danise - This Time (Wach Remix) (Cut From Allen&amp;Envy Set)-enTc\nR.E.L.O.A.D. - Over And Over Again (Original Mix) (Cut From El Jay Set)-enTc\nR3hab - Samurai (Tiesto Remix) (Cut From Hardwell Set)-enTc\nRadion6 - Daylight (GDJB Rip)-enTc\nRex Mundi - ID 001 (GDJB Rip)-enTc\nRex Mundi - Macchina (GDJB Rip)-enTc\nRoger Shah pres. Sunlounger feat. Chase - Surrender (Walden Remix) (Cut From Shah Set)-enTc\nRoman Messer feat. Ange - Imagination (Original Mix) (Cut From Allen&amp;Envy Set)-enTc\nScott Lowe &amp; Liam Nicklin - Igosco (Harmonic Rush Remix) (Cut From Allen&amp;Envy Set)-enTc\nScuba - Time Rentless Time (Dosem Edit) (ABGT 080 Rip)-enTc\nSean Matthews - Samurai (ASOT 664 Rip)-enTc\nSHato &amp; Paul Rockseek Feat. Alex Humphreys - Losing Control (LTN Remix) (ASOT 664 Rip)-enTc\nSimon Moon - Sounds From My Heart (Original Mix) (Cut From El Jay Set)-enTc\nSolis &amp; Sean Truby Feat. Irina Makosh - Forever (ASOT 664 Rip)-enTc\nSound Quelle - Piece of Cake (Original Mix) (ABGT 080 Rip)-enTc\nSoundGate - Everything Has Changed (Original Mix) (Cut From Blue Silence Set)-enTc\nSteve Brian &amp; Jason Ross - Good Love (Cut From Cosmic Gate Set)-enTc\nTerraNation - Shine (Original Mix) (Cut From Tero A Set)-enTc\nThomas Schwartz &amp; Fausto Fanizza - You Would (Original Mix) (ABGT 080 Rip)-enTc\nTucandeo - Citadel (Robbie Seed Remix) (Cut From GO Set)-enTc\nUla - In Time (Tuomas.L Remix) (Cut From Tero A Set)-enTc\nUla - Open Your Eyes (Original Mix) (Cut From Feel Set)-enTc\n","torrent":{"xt":"urn:btih:504ad4a77be10b7c962b18a0b41b1ef7df06ea35","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+May+25th%2C+2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"504ad4a77be10b7c962b18a0b41b1ef7df06ea35","infoHashBuffer":{"type":"Buffer","data":[80,74,212,167,123,225,11,124,150,43,24,160,180,27,30,247,223,6,234,53]},"announce":[],"urlList":[]}}