{"title":"Cockos REAPER v3.04.Patch-FFF","uid":4965284,"size":4614272,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:50aafe10019c9fe6025e36197adc8687c8b04128&amp;dn=Cockos+REAPER+v3.04.Patch-FFF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Murlok","files":-1,"time":1245504616,"description":"REAPER is a powerful but sensible Windows application that lets you record, arrange, edit, and render multi-track waveform audio. It provides an extensive set of features, but is a very small and lightweight application (the installer is less than 1 megabyte, and includes many effects and a sample project). REAPER supports ASIO, Kernel Streaming, WaveOut, and DirectSound for playback and recording. It reads WAV, OGG, and MP3 files, and records WAV files. You can arrange any number of items in any number of tracks and use audio processing plug-ins (DirectX and Jesusonic). REAPER also supports volume, pan controls and envelopes per track, multi-layer undo/redo, and user creatable color themes.\n\nBasic features:\n- Portable - supports running from USB keys or other removable media\n- 64 bit audio engine\n- Excellent low-latency performance\n- Multiprocessor capable\n- Direct multi-track recording to many formats including WAV/BWF/W64, AIFF, WavPack, FLAC, OGG, and MIDI.\n- Extremely flexible routing\n- Fast, tool-less editing\n- Supports a wide range of hardware (nearly any audio interface, outboard hardware, many control surfaces)\n- Support for VST, VSTi, DX, DXi effects\n- ReaPlugs: high quality 64 bit effect suite\n- Tightly coded - installer is just over 2MB\n\nEditing features:\n- Tool-less mouse interface -- spend less time clicking\n- Drag and drop files to instantly import them into a project\n- Support for mixing any combination of file type/samplerate/bit depth on each track\n- Easily split, move, and resize items\n- Each item has easily manipulated fades and volume\n- Tab to transient support\n- Configurable and editable automatic crossfading of overlapping items\n- Per-item pitch shift and time stretch\n- Arbitrary item grouping\n- Markers and envelopes can be moved in logical sync with editing operations\n- Ripple editing - moving/deletion of items can optionally affect later items\n- Multiple tempos and time signatures per project\n- Ability to define and edit project via regions\n- Automation envelopes\n\nChanges in REAPER 3.04\n-Joystick MIDI improvements (modeless config, submodes, etc)\n-Allow ctrl+drag copy of selected areas of items even with very small selections\n-Actions: split selected items at project markers, split selected items at grid\n-Action: remove content behind selected items (shift-X by default)\n-Crossfade selected items action allows time selection that is completely within both items\n-Fixed bug with render dialogs render master not being restored from configuration\n-ReaDelay: fixed label of delay length (from QN to 8N)\n-Fixed some bugs relating to Unicode conversions when getting long UI strings\n-OSX: fixed sending 1 and 2 byte messages to MIDI hardware\n-Ctrl+drag (pencil mode) creates empty MIDI item if no item is selected\n-SiF meters now show actual signal\n-Batch rendering will no longer show save prompt/project properties if preference set\n-MIDI editor: fixed sorting and mouse hit testing of overlapping notes\n-MIDI editor: Undo/redo of certain actions from within editor updates cached note names\n-MIDI editor: fixed scroll issues with last clicked note selection\n-MIDI editor: notes are not created when dragging vertically\n-MIDI editor: action to cycle through multiple items loaded in one editor (alt+N by default)\n-MIDI editor: better paste edit cursor behavior with looped items\n-Menu bar shows recording format, device settings, optionally free disk space including time\n-Normalize as much as +120dB (up from +36dB)\n-Allow resizing tracks in folder compact (not supercompact) mode\n-Toolbar icons show current state for many global toggle actions\n-Fixed relative filename item paste issues (when option to use relative files before fully qualified path is set)\n-Disabling record arm for tracks now sends all notes off\n-New JS: adpcm_simulator\n-Fixed project load splash screen leak\n-Better track vertical resize behaviors with varying arrange view sizes\n-Fixed open performance meter causing crashes in certain instances\n-VST: Support for plug-ins with Unicode filenames\n-VST: UAD plug-ins always get constant blocksizes (so that they can loop without extra latency)\n-VST: extra UAD mutexing on opening of UI.\n\n\nEnjoy","torrent":{"xt":"urn:btih:50aafe10019c9fe6025e36197adc8687c8b04128","amp;dn":"Cockos+REAPER+v3.04.Patch-FFF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50aafe10019c9fe6025e36197adc8687c8b04128","infoHashBuffer":{"type":"Buffer","data":[80,170,254,16,1,156,159,230,2,94,54,25,122,220,134,135,200,176,65,40]},"announce":[],"urlList":[]}}