{"title":"The Everybodyfields - Nothing Is Okay [2007][EAC,log,cue. FLAC]","uid":8919722,"size":276906617,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5124f4b5a9a961474f854d1cd0469ac5d661722f&amp;dn=The+Everybodyfields+-+Nothing+Is+Okay+%5B2007%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":14,"time":1379223794,"description":"Artist: The Everybodyfields\nRelease: Nothing Is Okay\nReleased: 2007\nLabel: Ramseur Records\nCatalog#: RR 2715\nFormat: FLAC / Lossless / Log (100%) / Cue\n[color=blue]Country: US\nStyle: americana\n\n\n01. Aeroplane (3:28)\n02. Lonely Anywhere (5:46)\n03. Don't Tern Around (3:17)\n04. Leaving Today (2:53)\n05. Be Miner (3:40)\n06. Savior (3:17)\n07. Birthday (2:53)\n08. Wasted Time (4:09)\n09. Everything is Okay (2:37)\n10. Tuesday (3:04)\n11. Over and Done (4:06)\n12. Out on the Highway (13:14)\n\n&quot;Sad songs say so much,&quot; Elton John once sang in a moment of alliterative clarity, and the Everybodyfields take his sentiments to heart. The title of the duo's third release, and first without dobro playing founder David Richey, evokes the melancholy within. The sound concentrates on singer/songwriters Jill Andrews and Sam Quinn's moody, often dark but oddly uplifting country-folk. Occasional fiddle and lap steel enhance the vibe but it's the achingly beautiful tunes that resonate with the subtle authority of a band that has refined its approach. &quot;Lonely Anywhere,&quot; a lovely ballad sung by Andrews with teary intensity, is as moving as anything in Emmylou Harris' catalog, and Quinn's harmonizing can't help but add a dollop of Gram Parsons styled dewy sentimentality to the atmosphere. The combination of the two leads you to imagine what Harris and Parsons might have produced if the latter hadn't crashed and burned at such a young age. The glum, often mournful vibe never becomes overwhelming because the strength of the melodies and vocals remains compelling and even deepens over the course of the 45-minute running time. The production is sparse enough to amplify the mood but isn't afraid to use dynamics to build the music to occasional crescendos that make the songs' expressive core even more powerful. The album's title is a play on the track &quot;Everything Is Okay,&quot; an epic that is the set's emotionally stirring centerpiece. Clearly everything is not OK at all in the Everybodyfields' world, but that doesn't make the group's music any less thrilling. Surely this isn't for parties, unless it's a pity party, yet there is a calming poignancy generated by the combination of gorgeous harmonies and exquisite songs that is hypnotic and quietly captivating.","torrent":{"xt":"urn:btih:5124f4b5a9a961474f854d1cd0469ac5d661722f","amp;dn":"The+Everybodyfields+-+Nothing+Is+Okay+%5B2007%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5124f4b5a9a961474f854d1cd0469ac5d661722f","infoHashBuffer":{"type":"Buffer","data":[81,36,244,181,169,169,97,71,79,133,77,28,208,70,154,197,214,97,114,47]},"announce":[],"urlList":[]}}