{"title":"DC Universe 52 February 2014 (darkhomr) [ALL]","uid":9753001,"size":2153253489,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:5147f95f4cccf200d3bcf518303a954ae71b7fbb&amp;dn=DC+Universe+52+February+2014+%28darkhomr%29+%5BALL%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dadrkhomr","files":50,"time":1394683152,"description":"Todays pack includes all the DCU titles for February 2014. People ask me where I get my numbering from since i seem to be two weeks ahead of everyone else. Week 1 was a two title week, with only Flashpoint #5 and Justice League #1 being published. Week 14 was a light week with only one title from the 52 Universe. Fact is, its not the numbering that matters, its the content. \n\n Before uploading these, I am opening them with ComicRack, and made sure they all opened there. If there are problems please let me know. As usual, these are not my scans. Thanks to the original scanners and uppers. If you like what you got here, please purchase them in some form. If this torrent has no seeds please msg me privately. I will be glad to reup anything that has no seeds. It is my policy to not publish my weekly packs unless they are complete, but no later than Friday morning. If you have questions or requests, please message me privately. All descriptions are from DC and taken from Comiclist.\n\n\n\n***Week of 2/5/2014***\n\n\n\n\n\nAction Comics #28 (CBR 2/5/2014)\n\nWho or what is the Ghost Soldier, and what mysterious ties does he have to The Man of Steel? Will he side with Superman as he is caught in the middle of the military's battle with subterranean monsters? \n\nBatman Jokers Daughter #1 (CBR 2/5/2014)\n\nWho is The Joker's Daughter? What horrors lurk in the mind of this deranged lunatic, and why is there more to her than meets the eye? More than just a crazy person who stumbled upon The Joker's face, more than just a woman with a mission, The Joker's Daughter sees herself as a woman on the path of greed, dominance and lordship over the Gotham Underground. This special issue tells a sordid tale in the life of one of DC's most popular new villains! \n\nBatwing #28 (CBR 2/5/2014)\n\nWelcome to Gothtopia! Die happy! A blast from Batwing's past is back to menace him! \n\nDetective Comics #28 (CBR 2/5/2014)\n\nWelcome to Gothtopia! Die happy! The Scarecrow makes the ultimate bid for control of Gotham City's citizens--so why is everybody so happy about it? Nothing is as it seems as the strange gets stranger in &quot;Gothtopia,&quot; part 2 of 3. \n\nEarth 2 #20 (CBR 2/5/2014)\n\nSuperman's plans for Earth 2 finally come to light as Batman, Hawkgirl and Red Tornado join a new ally who could turn the tide in the war with Apokolips. \n\nForever Evil #5 (of 7) (CBR 2/5/2014)\n\nWith everything to lose, Lex Luthor and his Injustice League raid the stronghold of the Crime Syndicate with consequences so devastating, the DC Universe will never be the same! \n\nForever Evil Arkham War #5 (of 6) (CBR 2/5/2014)\n\nBane must face Scarecrow's army of criminal psychopaths who have been enhanced by his Venom toxin! The fate of Gotham City hangs in the balance as Bane faces odds even he might not be able to beat! \n\nGreen Arrow #28 (CBR 2/5/2014)\n\n&quot;The Outsiders War&quot; part 3! If you're still in shock over the end of last issue, just wait until you see happens next! Nothing could have prepared Green Arrow for this! \n\nGreen Lantern Red Lanterns #28 (CBR 2/5/2014)\n\nDon't miss this amazing flip-issue with two covers at a special price of just $2.99! This double issue contains both Green Lantern #28 and Red Lanterns #28! With dozens of sectors in open rebellion against the Green Lantern Corps, Hal Jordan is faced with a crisis in the sector most important to him: 2814, home of Earth . . . as well as Ysmault, home of the Red Lanterns. Hal made a dangerous bargain with Guy Gardner, and now it's time to pay up! Plus: Guy and the Red Lanterns take over policing Sector 2814! And you'll want to keep reading Red Lanterns next month to see what happens to their newest member: SUPERGIRL! \n\nMovement #9 (CBR 2/5/2014)\n\nBatgirl comes to Coral City in pursuit of a superhuman who is trying to join the Movement! And Burden's terrifying brother attempts to bring him back home and away from the influence of his friends! \n\nPhantom Stranger #16 (Trinity of Sin) (CBR 2/5/2014)\n\nForever Evil: Blight - Part 11 of 18 The Justice League Dark infiltrates the Crime Syndicate - by striking an unholy alliance with Aquaman's evil doppelganger: The Sea King! Continues in CONSTANTINE #11! \n\nStormwatch #28 (CBR 2/5/2014)\n\nExtremax and Jenny return to Earth as the final battle with the Kollective looms on the horizon! \n\nSwamp Thing #28 (CBR 2/5/2014)\n\nAt last, the origin of the mysterious Capucine, including the revelation of the threat so deadly--it's enough to make a thousand-year-old assassin run for help! Plus, the fateful decision Swamp Thing made last issue will have consequences that he--and the world--could never have seen coming! \n\n\n***Week of 2/15/2014***\n\n\n\n\nBatgirl #28 (CBR 2/12/2014)\n\nIt's a hazardous reunion between Batgirl and the former Court of Owls assassin Strix as they face off against the lethal new threat known as Silver - the man who knows the secret of Gotham City's conspiracy of bats! \n\nBatman #28 (CBR 2/12/2014)\n\nZERO YEAR: DARK CITY reaches its conclusion! The final chapter of Zero Year is almost upon us, and we've saved the best for last! What corners of Batman's past will be revealed? And how will they impact his very near future? Find out here! \n\nConstantine #11 (CBR 2/12/2014)\n\nForever Evil: Blight - Part 12 of 18 Project Thaumaton revealed! The Crime Syndicate has twisted the world's greatest mystics into something horrible - is this the beginning of the end? Continues in this month's TRINITY OF SIN: PANDORA #8! \n\nForever Evil Rogues Rebellion #5 (of 6) (CBR 2/12/2014)\n\nThe Rogues against the might of The Royal Flush Gang! Guess who just got dealt a losing hand? Do the boys have any more tricks up their sleeves, or will this be the end of their run? \n\nGreen Lantern Corps #28 (CBR 2/12/2014)\n\nThe Green Lanterns are under siege from the secretive Durlans--so it's time to find the one Lantern who knows all of the Durlans' tricks! But how do you find a shapeshifter who could be anywhere in the universe? And when the Green Lanterns find out who their newest allies are, some of them might prefer no help at all! \n\nJustice League 3000 #3 (CBR 2/12/2014)\n\nThe Flash is defeated. Green Lantern is in the clutches of Locus, a psychotic teenaged girl with the powers of God. And Superman, Batman and Wonder Woman have been banished to a planet wide penal colony! \n\nJustice League of America #12 (CBR 2/12/2014)\n\nA devastating battle against Despero begins as Manhunter and Stargirl arrive in San Francisco to save Stargirl's family from Firestorm's fallout! \n\nNightwing #28 (CBR 2/12/2014)\n\nAll the sins of the past still haunt Nightwing. How can he make his peace with his old life if Gotham City won't leave him alone? \n\nSuicide Squad #28 (CBR 2/12/2014)\n\nThe Thinker unleashes OMAC on the Suicide Squad at the doors of Belle Reve! In this epic clash, not all will survive! \n\nSuperboy #28 (CBR 2/12/2014)\n\nSuperboy and his new team of unstable teen powerhouses must return to the present-day DC Universe to make sure Jon Lane Kent lives to see his plans come to fruition! \n\nSuperman Wonder Woman #5 (CBR 2/12/2014)\n\nFaora has joined Zod--and now, Earth must kneel before their combined might! Even Superman and Wonder Woman can't stop their plan for the Phantom Zone! \n\n\n\n***Week of 2/19/2014***\n\n\n\n\nAnimal Man #28 (CBR 2/19/2014)\n\n&quot;Evolve or Die!&quot; concludes as Animal Man marshals every last bit of power he has to protect his daughter from Brother Blood! But will it be enough to save Maxine and the Red--or will Buddy lose another child? \n\nBatman And Two Face #28 (CBR 2/19/2014)\n\n&quot;The Big Burn&quot; concludes! In the final showdown, Batman, Two-Face and Erin McKillen fight for their lives against Gotham City's united Mafiosi! \n\nBatwoman #28 (CBR 2/19/2014)\n\nAs Batwoman reels from Maggie's surprising revelation last issue, the two must work together to discover the secret of the Wolf Spider. Who hired him and what are his deadly plans for Gotham? \n\nBirds Of Prey #28 (CBR 2/19/2014) \n\nWelcome to Gothtopia! Die happy! Black Canary confronts Ra's al Ghul--who makes her an offer that could save her husband! Is she willing to pay the ultimate price? \n\nGreen Lantern New Guardians #28 (CBR 2/19/2014)\n\nThe fiery religion of the goddess X'Hal has brought peace to a star system that has only known conflict! Could this be the galactic paradise that Kyle Rayner and the New Guardians have been searching for? If it is, it won't last long--because the mysterious beings known as The God-Killers have X'Hal--and Kyle--in their sights! \n\nHarley Quinn #3 (CBR 2/19/2014)\n\nIt's Valentine's Day, and Harley is getting depressed watching happy couples walk by. Will a special gift from Poison Ivy turn things around for Harley? \n\nJustice League #28 (CBR 2/19/2014)\n\n&quot;FOREVER EVIL&quot; continues! With the Justice League gone, new heroes continue to rise up throughout the DC Universe! The Crime Syndicate tried to kill him, but now Cyborg is back to settle the score -- and with him are The Metal Men!\n\nRed Hood And The Outlaws #28 (CBR 2/19/2014)\n\nThe Outlaws head off for a well-earned rest as Jason tries to rekindle his romance with Isabelle--but they are soon fighting for their lives against a new cartel! \n\nSupergirl #28 (CBR 2/19/2014)\n\nA RED LANTERN RING is coming to get Kara--and it will change her forever! No lie! Not an imaginary story! It's really going to happen! &quot;Red Daughter of Krypton&quot; starts here! \n\nTrinity of Sin Pandora #8 (CBR 2/19/2014)\n\nForever Evil: Blight - Part 13 of 18 Pandora and The Justice League Dark race to save the world's mystics from The Crime Syndicate! Continues in JUSTICE LEAGUE DARK #28! \n\nWonder Woman #28 (CBR 2/19/2014)\n\nThe last time the First Born came for Olympus, it took the death of the God of War to stop him. And if Wonder Woman is now the God of War . . . and if the First Born is more determined than ever to claim his birthright . . . then things are about to get VERY violent indeed! \n\n\n\n\n \n***Week of 2/26/2014***\n\n\n\n\n\nAnimal Man #28 (CBR 2/26/2014)\n\nOld West meets modern medicine! Are Hex's scars healed? Trapped in a future he's still coming to grips with, Jonah Hex confronts his own history as he uncovers a museum dedicated to the scarred bounty hunter's days in the Old West. \n\nAquaman #28 (CBR 2/26/2014)\n\nHe's saved a diver from a vicious shark attack--but he'll soon regret it. His most powerful weapon has been stolen from his care--and he's never even heard of the man who took it. But Aquaman's greatest challenge yet may be Amnesty Bay's ten year high school reunion! \n\nBatman Superman #8 (CBR 2/26/2014)\n\nThe Worlds' Finest teams of two worlds meet at last in chapter 1 of 'First Contact'! With Power Girl's abilities on the fritz, see what happens when her long-lost cousin Superman approaches her! And a major threat returns in a way you won't believe!\n\nBatman The Dark Knight #28 (CBR 2/26/2014)\n\nPart one of a two-part story detailing the complex history of Dr. Kirk Langstrom, a.k.a. Man-Bat! How does Man-Bat's past connect to Batman's future? \n\nCatwoman #28 (CBR 2/26/2014)\n\nWelcome to Gothtopia! Die happy! As Catbird carries on the fight for justice even without the help of her beloved Batman, she finds herself facing a great mystery: Who is Catwoman? \n\nDC Universe vs. Masters Of The Universe #5 (of 6) (CBR 2/26/2014)\n\nWith the fate of the earth in the balance, it's the final showdown between the DC heroes and the Masters of the Universe! Plus, Teela and John Constantine travel to a dark realm to rescue Superman and find the secret of reversing the enchantment that holds Earth's champions under its spell. \n\nFlash #28 (CBR 2/26/2014)\n\nThe Flash and Deadman team up to stop The Miner--by killing him? \n\nForever Evil Argus #5 (of 6) (CBR 2/26/2014)\n\nA.R.G.U.S. leader Colonel Steve Trevor has struck a deadly alliance with Killer Frost in order to find Wonder Woman's lost lasso! Only one problem: the lasso is in the hands of the deadly Cheetah, who doesn't mind soaking it in Trevor's blood! \n\nJustice League Dark #28 (CBR 2/26/2014)\n\nForever Evil: Blight - Part 14 of 18 What has The Crime Syndicate done to the world's most powerful mystics - and what is Project Thaumaton? The world continues to grow darker before the dawn and Constantine will be forced to do the unthinkable! Continues in Phantom Stranger #17. \n\nLarfleeze #8 (CBR 2/26/2014)\n\nLarfleeze has more than he knows what to do with - especially cosmic entities that want to kill him! But Larfleeze will brave it all if it means getting more, and getting his 'butler,' Stargrave, back! \n\nSuperman #28 (CBR 2/26/2014)\n\nA mysterious and powerful figure seeks The Man of Steel to join her against a threat coming to Earth. Plus: Sam Lane ascends to power, which makes him an even more formidable opponent for Superman. \n\nSuperman Lois Lane #1 (CBR 2/26/2014)\n\nLois Lane is known for chasing down stories--but what happens when the story is her family? As her father gains more power in the government, Lois's sister Lucy has become involved with a deadly drug scene! Meanwhile, Lois thought she was rid of the influence of Brainiac, but now she finds that the the computer tyrant of Colu is calling out to her again! \n\nTalon #16 (CBR 2/26/2014)\n\nCalvin Rose must find a Lazarus Pit to bring himself back from the dead. But first he must fight another undead villain with the same notions: Lord Death Man! \n\nTeen Titans #28 (CBR 2/26/2014)\n\nKid Flash's true history and motivations are revealed as he goes to war with his former teammates in the future he plans to rule. \n\nWorlds Finest #20 (CBR 2/26/2014)\n\nPower Girl and Huntress come face to face with the Superman and Batman of the DC Universe for the first time in chapter 2 of &quot;First Contact&quot;! Continues in next month's BATMAN/SUPERMAN #9! \n\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:5147f95f4cccf200d3bcf518303a954ae71b7fbb","amp;dn":"DC+Universe+52+February+2014+%28darkhomr%29+%5BALL%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5147f95f4cccf200d3bcf518303a954ae71b7fbb","infoHashBuffer":{"type":"Buffer","data":[81,71,249,95,76,204,242,0,211,188,245,24,48,58,149,74,231,27,127,187]},"announce":[],"urlList":[]}}