{"title":"Batman The Animated Series-Dark Knight Chronicles 3 disc boxset[","uid":6638761,"size":4103957499,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5162b4a72a2ff545d36e7ce7cc42e44569541440&amp;dn=Batman+The+Animated+Series-Dark+Knight+Chronicles+3+disc+boxset%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"alanwatson","files":-1,"time":1314667036,"description":"Widely considered to be the absolute pinnacle of action-hero animation, the dynamic series takes a shadowy approach to the Dark Knight, observing his self imposed isolation within the Batcave, situated deep below the Wayne estate. The series features an equally dramatic portrayal of Batman's alter-ego Bruce Wayne, a man who devoted his life to wiping out crime following the death of his parents at the hands of a criminal.\n\nVoiced by an all star cast which includes veteran voice over artist Kevin Conroy as the unmistakable voice of Batman and Star Wars legend Mark Hamill, both DVD's are animated in striking 'Dark Deco' style which gives every scene an extraordinary look and redefines the infamous appearance of Gotham City.\n\n\nIN THE BOXSET:\n\n \nDVD 1:THE LEGEND BEGINS VOL 1 \n\nHe rules the night as Gotham City's shadowy protector - a crusading Dark Knight defending the innocent and striking fear into the hearts of evildoers. The legend of Batman begins in this thrilling collection of the first five landmark episodes of the Emmy award-winning 'Batman: The Animated Series'.\n\nFrom the perilous punchlines of The Joker's latest pranks to the nightmarish Scarecrow and Poison Ivy's deadly embrace, this is Batman at his action-packed best!\n\nEpisodes comprise: \nOn Leather Wings / Christmas With The Joker / Nothing To Fear / The Last Laugh / Pretty Poison.\n\n-----------------------------------------\n\nDVD 2:TALES OF THE DARK KNIGHT-VOL 2\n\nHe rules the night as Gotham City's shadowy protector - a crusading Dark Knight defending the innocent and striking fear into the hearts of evildoers. The legend of Batman continues in this thrilling collection of the second volume of the Emmy award-winning 'Batman: The Animated Series'.\n\nEpisodes comprise: \nThe Underdwellers, P.O.V. / The Forgotten / Be A Clown.\n\n-----------------------------------------\n\nDVD 3:OUT OF THE SHADOWS-VOL 3\n\nHe rules the night as Gotham City's shadowy protector - a crusading Dark Knight defending the innocent and striking fear into the hearts of evildoers. The legend of Batman continues in this thrilling collection of the third volume of the award-winning 'Batman: The Animated Series'.\n\nEpisodes comprise: \nTwo Face Part 1 / Two Face Part 2 / It's Never Too Late / I've Got Batman In My Basement\n","torrent":{"xt":"urn:btih:5162b4a72a2ff545d36e7ce7cc42e44569541440","amp;dn":"Batman+The+Animated+Series-Dark+Knight+Chronicles+3+disc+boxset%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5162b4a72a2ff545d36e7ce7cc42e44569541440","infoHashBuffer":{"type":"Buffer","data":[81,98,180,167,42,47,245,69,211,110,124,231,204,66,228,69,105,84,20,64]},"announce":[],"urlList":[]}}