{"title":"Fed Up!: Winning the War Against Childhood Obesity ","uid":5836967,"size":4673214,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:51ace2a7c8590204ccaeb69b09cfbefb37640bf6&amp;dn=Fed+Up%21%3A+Winning+the+War+Against+Childhood+Obesity+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Djofullinn","files":1,"time":1284757693,"description":"From Publishers Weekly\nDrawing on up-to-date research as well as personal stories, Okie presents the astounding statistics on what she calls &quot;the fattest generation&quot; and the dire health risk the obesity epidemic poses. Okie, a Harvard-trained family physician and Washington Post medical reporter, tackles obesity's causes methodically and without sensation, explicating the biology of body mass and appetite regulation and the relationship between calorie intake and energy expenditure. She also examines some of the rare hormone problems and genetic disorders that, in a tiny minority of children, can cause obesity. Having explored how obesity lowers self-esteem, the author persuasively shows that recent shifts in the environment are most likely to blame for today's childhood obesity epidemic: sprawling suburban neighborhoods that discourage walking, ballooning portions in restaurant food, poor choices in school lunches, a decline in home cooking and the resulting tendency to snack rather than sit down for a family meal are among the factors she cites. Commenting analytically on pediatricians' reluctance to deal with obesity, Okie documents the innovative efforts of certain states and schools to engineer healthy eating and exercise programs. She also meets and describes several families who have put diet and exercise plans into action, or whose children have been hospitalized for obesity. Never preachy or patronizing, Okie will inform and empower all concerned parents about a problem whose time has come (as shown by a New York Times Magazine piece on the subject and recent books like Generation Extra Large. (Feb.)\nCopyright Ã‚Â© Reed Business Information, a division of Reed Elsevier Inc. All rights reserved. --This text refers to the Hardcover edition.\nReview\n&quot;'[Fed Up!] concludes by offering thoroughly sound and detailed solutions to an exasperating problem.... A must-read for parents whose children are overweight - or who hope to avoid the problem'. - The Washington Post&quot; \n &lt;a href=&quot;\nhttp://www.amazon.com/Fed-Up-Winning-Against-Childhood/dp/0309101980/ref=sr_1_1?ie=UTF8&amp;s=books&amp;qid=1284750281&amp;sr=8-1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Fed-Up-Winning-Against-Childhood/dp/0309101980/ref=sr_1_1?ie=UTF8&amp;s=books&amp;qid=1284750281&amp;sr=8-1&lt;/a&gt;","torrent":{"xt":"urn:btih:51ace2a7c8590204ccaeb69b09cfbefb37640bf6","amp;dn":"Fed+Up%21%3A+Winning+the+War+Against+Childhood+Obesity+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51ace2a7c8590204ccaeb69b09cfbefb37640bf6","infoHashBuffer":{"type":"Buffer","data":[81,172,226,167,200,89,2,4,204,174,182,155,9,207,190,251,55,100,11,246]},"announce":[],"urlList":[]}}