{"title":"Joni Mitchell - Club 47, Cambridge MA, 1968 - FM (upgrade)","uid":10732448,"size":422539912,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:53fa359171068b3300c8cfd2e7bc176ebc50b254&amp;dn=Joni+Mitchell+-+Club+47%2C+Cambridge+MA%2C+1968+-+FM+%28upgrade%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"thewaymouth","files":-1,"time":1407642159,"description":"Joni Mitchell\n\nAcoustic-guitar, small club, folk-pop solo performance.\n\nThis show you see it glows from the dazzling display of six mind-blowing kisses, from her highly underrated, classical classic, de-beauty. Songs to a seagull from a see-girl who sings of and brings on everything. And so on is she hear.\n\n\nThe Club 47 set includes as well three songs from her second coming album, 'Clouds,' and two from her third, 'Ladies of the Canyon.' If all that were not enough, the Belle of Saskatoon reaches into her bag of kicks to deliver four unreleased, Joni boni maronies: &quot;Gift of the Magi,&quot; &quot;Ballerina Valerie,&quot; &quot;Come to the Sunshine&quot; and &quot;The Way It Is.&quot; \n\n_______________\n\n_______________\n\n\nJoni Mitchell\nClub 47 \nCambridge, MA\n(WTBS-FM (MIT radio)\n1968-01-10\n\nSetlist:\n\n01 Cactus Tree\n02 Night in the City\n03 Gift of the Magi\n04 I Had a King\n05 Morning Morgantown\n06 Ballerina Valerie\n07 Song to a Seagull\n08 Both Sides Now\n09 Conversation\n10 Come to the Sunshine\n11 Chelsea Morning\n12 The Pirate of Penance\n13 The Way It Is\n14 The Dawntreader\n\n____________________________________\n\n\n- tape flip after Song to a Seagull\n\n- total running time 65:00 (approx)\n\n\nThis is the 2007 Randall, pitch-corrected version, a considerable source-upgrade.\n\nThis version came originally from a CDR picked up by Randall @ DIME from the Joni Mitchell DC++ hub in April 2007. \n\n\nIt is not from the boot, &quot;By The Banks of the River Charles.&quot; This 04-07 CDR (Randall) version was then speed-corrected and shared by him. The other-source version has been described as having more hiss and more bass than Randall's [plus speed bumps]. \n\n\nRandall notes:  After some correspondence with &quot;Professor Goody,&quot; it was determined that this show was running quite a bit fast. Professor G's advice has always been on the mark (no pun intended) so I have pitch and speed corrected the recording according to his instructions. Thanks, Professor!\n\n\nCDR&gt;WAV (EAC, secure)&gt;Flac level 8 in TLH&gt;decoded to WAV in TLH&gt;pitch and speed corrected by -65 cents in Sony Sound Forge 8&gt;Resulting SBEs corrected in TLH&gt;reencoded to Flac level 8 in TLH\n\n[Original CDR lineage: CDR&gt;WAV (EAC, secure)&gt;Flac level 8 in TLH&gt;Joni Mitchell DC++Hub (jmdl.no-ip.info:411)]\n\n_____________________________\n\n\n{Did not come with artwork, so I made an avatar from a cap of 'The Way It Is,' CBC-TV, 1967, a show discussed by Joni here}\n\n\n2014-08-09 on The Pirate Bay around thewaymouth\n\n\ntwm rating of Sound Quality = 8.75 \n\n\na bit of radio hiss, but the sound is bright and clear as bitchin bliss\n\nJust fill up some bass \nand you can't help but come \nto the sunshine on chelsea morning morgantown\n\ntwm rating of Show Quality = beyond compare \n\n___________________________________________\n\n\nJANUARY 10\n\nNEW YEAR'S DAY: For the Amerindian Iroquois who celebrate with a 'Feast of Dreams'.\n\n1968 \n\n-- Vietnam: The 10,000th US airplane is lost over Vietnam (&quot;Calling Commander Cody!&quot;)\n\n\n-- US: With thoughts that no longer fit The Man, she is so busy being free in the People's Republic of Cambridge.\n\n\nJoni's first album would finally see the bright light of day in two months time. 'Song to a Seagull,' produced by David Crosby, is released on Reprise in March of 1968. \n\n\n...Is it no wonder then on the last day of that month of time marches on, LBJ would surprise the nation by turning on, tuning in and dropping out like a lamb on national television. When he announced he would not run for re-election by concluding with the lines: 'I shall not seek, and I will not accept, the nomination of my party for another term as your President... Song to a Seagull is just that freaking good. And now I know I am just that damn inadequate. Rock is dead, they say. How many kids did you kill today?! I am but a man, and man is a poor player that struts and frets his hour upon the stage and then is heard no more. So I do not believe I should devote an hour or a day of my time to any duties other than the awesome duty to just listen to Joni, to just listen to her glisten...'\n\n\nWherefore art an artist with a more commanding and beautifully brilliant, live display than this... \n\nAll these she dreams come to me.\n\nI need, you need, we all so need Joni. \n______________________________________","torrent":{"xt":"urn:btih:53fa359171068b3300c8cfd2e7bc176ebc50b254","amp;dn":"Joni+Mitchell+-+Club+47%2C+Cambridge+MA%2C+1968+-+FM+%28upgrade%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53fa359171068b3300c8cfd2e7bc176ebc50b254","infoHashBuffer":{"type":"Buffer","data":[83,250,53,145,113,6,139,51,0,200,207,210,231,188,23,110,188,80,178,84]},"announce":[],"urlList":[]}}