{"title":"Kanye West - Heartless  (2nafish)","uid":5311651,"size":102674436,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:54e02a6ff53139fd72c46fde03920d8f2eaa2a13&amp;dn=Kanye+West+-+Heartless++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1264584663,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos.\n\n\n&quot;Heartless&quot; is a song by American hip hop artist Kanye West, released on November 4, 2008 digitally as the second single for his fourth studio album, 808s &amp; Heartbreak. It debuted at the number four spot on the Billboard Hot 100 where it eventually peaked at number two and reached number-one on the Billboard Hot Rap Tracks and U.S. Hot 100 Airplay chart. The song came to be covered by numerous artists, most notably by Denver-based piano rock band The Fray and American Idol season 8 winner Kris Allen, with both versions managing to enter charts in the absence of a physical single release.\n\nDirected by Hype Williams, the animated music video for &quot;Heartless&quot; pays tribute to Ralph Bakshi's 1981 film American Pop. It features use of rotoscoped animation, in which actual people were filmed and over sixty-five animators in Hong Kong drew over their every movement, and references various scenes and backgrounds from the film. The video portrays West wandering through a city alone at night, with scenes of various women shown throughout the video.\n\nThe song was performed for the first time at the ONE Campaign concert during the 2008 Democratic National Convention in Denver, Colorado. The song was also performed at a T.I. concert at Key Club in Los Angeles. Kanye made a special guest appearance and confirmed the song's future release as a single at that show. A snippet of the unmastered version of the song was leaked onto the Internet on October 12, 2008. This was followed by a full unmastered version of the song being posted on West's official blog on October 15. The song was released on iTunes on November 4, 2008. On November 8, 2008, Kanye posted a new mastered version of the song on his official blog. A free link to download the song was posted there as well.\n\nIn the U.S. on the week of November 13, &quot;Heartless&quot; made a &quot;Hot Shot Debut&quot; at number four on the Billboard Hot 100, selling 201,000 downloads in the United States alone and making it his second highest debut on the chart. The single fluctuated in and out of the top ten for two months before reaching a new peak at number three in mid-January, and rose to two in mid-February. In early March it also reached number four on the Pop 100 chart. It is West's second consecutive top five hit on the Hot 100, and his second consecutive song to debut in the top five there. This makes 808s &amp; Heartbreak the first West album to contain two Hot 100 top five hits. On Hot R&amp;B/Hip-Hop Songs, it peaked at four. It debuted at number eleven on the Hot Rap Tracks and has managed to reach number-one in late January. The song has so far sold over 3,000,000 paid digital downloads in the United States, becoming West's second song to reach that mark, the first being &quot;Stronger&quot; in 2007. The feat puts West as the sixth artist to put two songs at or above the 3 million mark in paid downloads.\n\nIn Canada it also made a &quot;Hot Shot Debut&quot; at number eight on the Canadian Hot 100, also based on huge amount of downloads in the country. On the 1st of December 2008, the song debuted at number sixty-three, on the Australian ARIA Singles Chart. It has reached seven so far on the New Zealand RIANZ chart. On the UK Singles Chart, the song debuted at number forty-five and has already reached the tenth position due to album download sales. The official digital release date for the single was 12 January 2009. On the Irish Singles Chart the song has peaked at number ten so far.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:54e02a6ff53139fd72c46fde03920d8f2eaa2a13","amp;dn":"Kanye+West+-+Heartless++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54e02a6ff53139fd72c46fde03920d8f2eaa2a13","infoHashBuffer":{"type":"Buffer","data":[84,224,42,111,245,49,57,253,114,196,111,222,3,146,13,143,46,170,42,19]},"announce":[],"urlList":[]}}