{"title":"Polyoxomolybdates as Green Catalysts for Aerobic Oxidation","uid":12088228,"size":3411464,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:56152e3327676bcde0de74697f28cf4a88944c6e&amp;dn=Polyoxomolybdates+as+Green+Catalysts+for+Aerobic+Oxidation&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1435956167,"description":"Polyoxomolybdates as Green Catalysts for Aerobic Oxidation - Anjali Patel, Soyeb Pathan (Springer, 2015).pdf\n\nISBN 9783319129877\n\nHeterogeneously catalyzed selective oxidations of alcohols is a highly topical field. The first chapter of this brief describes the importance of the selective oxidation of alcohols and advantages of heterogeneous catalysts over conventional catalysts, use of environmentally benign oxidants, and the design of selective catalysts by tailoring of polyoxometalates at the molecular level. Chapter 2 describes synthesis, characterization 11-molybdophosphate based supported materials and their use as heterogeneous catalysts for oxidation of alcohols with molecular oxygen under solvent free mild reaction condition. ZrO2, Al2O3, MCM-41 and zeolite HÎ² were used as supports. Chapter 3 describes synthesis, characterization of transition metals (Mn, Co, Ni, Cu)- substituted phosphomolybdates and their use as heterogeneous catalysts for oxidation of alcohols with molecular oxygen under solvent free mild reaction condition. Chapter 4 describes conclusive remarks for present catalytic systems","torrent":{"xt":"urn:btih:56152e3327676bcde0de74697f28cf4a88944c6e","amp;dn":"Polyoxomolybdates+as+Green+Catalysts+for+Aerobic+Oxidation","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56152e3327676bcde0de74697f28cf4a88944c6e","infoHashBuffer":{"type":"Buffer","data":[86,21,46,51,39,103,107,205,224,222,116,105,127,40,207,74,136,148,76,110]},"announce":[],"urlList":[]}}