{"title":"Harlequin - Love Crimes [1980][2011][320 KBPS][RMSTD]","uid":9508259,"size":92282395,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:57a8e7c6b2cb51059d79f056faa9e72ee0d30e8e&amp;dn=Harlequin+-+Love+Crimes+%5B1980%5D%5B2011%5D%5B320+KBPS%5D%5BRMSTD%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LameDuck69","files":13,"time":1390354832,"description":"Harlequin - Love Crimes [1980][2011][Remastered]\n\n\n\n\n\n01 Innocence\n02 Love On The Rocks\n03 Thinking Of You\n04 It's All Over Now\n05 Heaven (Dial 999)\n06 Sayin' Goodbye To The Boys\n07 Wait For The Night\n08 Crime Of Passion\n09 Can't Hold Back\n10 Midnight Magic\n\n\n\n\n\n\n320 KBPS [CBR]\n\nCover Art\n\n\n\n\n\n\nFrom Wikipedia:\n\n\n\nHarlequin is a Canadian rock band that formed in Winnipeg, Manitoba in 1975 and lasted until the mid-1980s. The band is best known for their hit singles &quot;I Did It For Love,&quot; &quot;Thinking of You,&quot; &quot;Superstitious Feeling,&quot; and &quot;Innocence.&quot;\n\nIn 2004, the band reformed briefly as Harlequin II, and in 2007 the band resurfaced under their original name and released a live album, On/Q Live, in 2009.\n\n-----------------------------------------------------------------------------------\n\nIn 1975, Winnipeg bassist Ralph James formed Harlequin upon recruiting vocalist George Belanger, guitarist Glen Willows, keyboardist Gary Golden, and drummer David Budzak.[2] The band began recording demos and travelling to Toronto to perform in the local bars and clubs. It was in one of these small bars in Toronto that Harlequin were discovered by representatives of Jack Douglas, the producer of Aerosmith, John Lennon, and Patti Smith, after they tried to see another band in a larger bar downstairs, but could not gain admittance due to a sell-out crowd.\n\nDouglas helped get Harlequin signed to CBS/Epic Records records in 1979, and later that year that band released their first LP, Victim of a Song, which went Gold, and received heavy radio play, particularly in Western Canada. The band's second release, Love Crimes (1980) wielded two hits, &quot;Thinking Of You,&quot; and &quot;Innocence,&quot; Harlequin's biggest hit to date. Harlequin's third album One False Move (1982) wielded two more hits, &quot;Superstitious Feeling,&quot; and &quot;I Did It For Love.&quot; The first three albums together locked Harlequin in as a staple on Canadian rock radio, and they released a compilation album, Radio Romances in 1984.\n\nFor their self-titled fourth studio album, Harlequin replaced Douglas with The Fixx bassist Alfie Agius as their producer. Harlequin (1985), produced only one single, &quot;Take this Heart.&quot;[3] In 1986, Harlequin released their Greatest Hits album, and disbanded shortly thereafter. By the time the band stopped touring in 1986, Willows had been replaced by John Hannah, Golden had been replaced by John White, and Budzak had been replaced by Denton Young.\n\nIn 2004, some members of the band reformed temporarily under the name of Harlequin II, and in 2006, the band was inducted into the Western Canadian Music Hall of Fame at the Western Canadian Music Awards.\n\nIn 2007 Belanger reformed Harlequin with an entirely different lineup of musicians, including guitarist Derrick Gottfried, bassist Nik Rivers, keyboardist Darren Moore, and drummer AJ Chabidon. This lineup released Waking the Jester (2007), which contained two singles, &quot;Shine On,&quot; and &quot;Rise.&quot; The band resumed touring and in 2009 released Harlequin's first live album, Live On/Q.\n\nThe band continues to tour mostly within Canada, performing frequently around the country.","torrent":{"xt":"urn:btih:57a8e7c6b2cb51059d79f056faa9e72ee0d30e8e","amp;dn":"Harlequin+-+Love+Crimes+%5B1980%5D%5B2011%5D%5B320+KBPS%5D%5BRMSTD%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57a8e7c6b2cb51059d79f056faa9e72ee0d30e8e","infoHashBuffer":{"type":"Buffer","data":[87,168,231,198,178,203,81,5,157,121,240,86,250,169,231,46,224,211,14,142]},"announce":[],"urlList":[]}}