{"title":"Hacker Cracker","uid":7767464,"size":16431601,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:57c4dc000eb08980ecfd07947ba48e6f84195fac&amp;dn=Hacker+Cracker&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"d347hBy73","files":2,"time":1351424433,"description":"Hacker Cracker\n\nRelease Date: December 16, 2003\nAuthors:David Chanoff and Ejovi Nuwere\n\nLike other kids in the Bedford-Stuyvesant neighborhood of Brooklyn, Ejovi Nuwere grew up among thugs and drug dealers. When he was eleven, he helped form a gang; at twelve, he attempted suicide. In his large, extended family, one uncle was a career criminal, one a graduate student with his own computer. By the time Ejovi was fourteen, he was spending as much time on the computer as his uncle was. Within a year he was well on his way to a hacking career that would lead him to one of the most audacious and potentially dangerous computer break-ins of all time, secret until now.\n\nBefore he finished high school he had created a hidden life in the hacker underground and an increasingly prominent career as a computer security consultant. At the age of twenty-two, he was a top security specialist for one of the world's largest financial houses.\n\nHacker Cracker is at once the most candid revelation to date of the dark secrets of cyberspace and the simple, unaffected story of an inner-city child's triumph over shattering odds to achieve unparalleled success.","torrent":{"xt":"urn:btih:57c4dc000eb08980ecfd07947ba48e6f84195fac","amp;dn":"Hacker+Cracker","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57c4dc000eb08980ecfd07947ba48e6f84195fac","infoHashBuffer":{"type":"Buffer","data":[87,196,220,0,14,176,137,128,236,253,7,148,123,164,142,111,132,25,95,172]},"announce":[],"urlList":[]}}