{"title":"Enrique Iglesias - Rhythm Divine","uid":4765346,"size":134172676,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:58013a5e0d3c0e89dc753dd3b09bbf7cd4480977&amp;dn=Enrique+Iglesias+-+Rhythm+Divine&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1236849630,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Rhythm Divine&quot; is the title of the first single released by Enrique Iglesias from his first English language album Enrique.\n\nThe track was written and produced by the same team who did his breakthrough single &quot;Bailamos&quot;, Paul Barry,Mark Taylor and Brian Rawling. The video for this single was directed by Francis Lawrence.\n\nThe track was not as successful as &quot;Bailamos&quot;, however peaked inside the Top 50 in United States, UK, France, Germany, Australia and Netherlands. The Spanish version of the single, titled &quot;Ritmo Total&quot; hit the number 1 spot in the Billboard Hot Latin Tracks (for four weeks) and Spain.\n\nAccording to http://www.billboard.com in the single review, Enrique Iglesias delivers this &quot;savvy follow-up bid for top 40 longevity&quot;, this single is &quot;precisely the kind of song that should ensure this crossover artist's chance to dance up the ladder of success&quot;. Also makes a comparation with fellow Latin performer Ricky Martin:\n\n&quot;Unlike peer Ricky Martin, Iglesias is far from overexposed, leaving plenty of room for listeners to be surprised by his potential as a singer, performer, and presence to grow comfortable with on the top 40 airwaves&quot;. About the song structure: &quot;Masterfully produced, passionately sung, and ready for the kind of video exploration that will further reveal this gorgeous young artist as one of the blossoming solo sex symbols of the new millennium, this song-written by &quot;Bailamos&quot; scribes Mark Taylor and Paul Barry-is a solid sell for fans of the new sound of the Latin nation, replete with Spanish guitars, a gutsy vocal, and rhythms that will move the masses in a single spin. Oh, so solid, &quot;Rhythm Divine&quot; will propel another new hero to the upper reaches of the charts in just a few short weeks. The song appears in an episode of The Simpsons. A sure sell-through from his upcoming English-language debut, the songs deserves a big bravo for sheer pop merit&quot;.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:58013a5e0d3c0e89dc753dd3b09bbf7cd4480977","amp;dn":"Enrique+Iglesias+-+Rhythm+Divine","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58013a5e0d3c0e89dc753dd3b09bbf7cd4480977","infoHashBuffer":{"type":"Buffer","data":[88,1,58,94,13,60,14,137,220,117,61,211,176,155,191,124,212,72,9,119]},"announce":[],"urlList":[]}}