{"title":"Foxit PDF Reader Pro 2.0 full - MaMuNi.rar","uid":4048808,"size":1786115,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:58bb15d904dd7f0a60e971dbb5e7c102a241eb5c&amp;dn=Foxit+PDF+Reader+Pro+2.0+full+-+MaMuNi.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MaMuNi","files":1,"time":1204054223,"description":"Foxit PDF Reader is an alternative to Adobe Reader, that allows you to view and print PDF files. Unlike Adobe Reader, it opens PDF files very fast, without any delay. It supports all the standard features, as well as browser integration, and also an option select/copy of text from the documents. Furthermore, you can create a snapshot from a selected portion of the page, fill interactive forms and more.\n\nNow with Foxit Reader, you don&amp;#039;t have to endure such pain any more. The following is a list of compelling advantages of Foxit Reader:\n\n    * Incredibly small: The download size of Foxit Reader is only 2.1 M which is a fraction of Acrobat Reader 20 M size.\n    * Breezing-fast: When you run Foxit Reader, it launches instantly without any delay. You are not forced to view an annoying splash window displaying company logo, author names, etc.\n    * Annotation tool: Have you ever wished to annotate (or comment on) a PDF document when you are reading it? Foxit Reader allows you to draw graphics, highlight text, type text and make notes on a PDF document and then print out or save the annotated document.\n    * Text converter: You may convert the whole PDF document into a simple text file.\n    * High security and privacy: Foxit Reader highly respects the security and privacy of users and will never connect to the Internet without users&amp;#039; permission. While other PDF readers often silently connect to the Internet in the background. Foxit PDF Reader does not contain any spyware.\n","torrent":{"xt":"urn:btih:58bb15d904dd7f0a60e971dbb5e7c102a241eb5c","amp;dn":"Foxit+PDF+Reader+Pro+2.0+full+-+MaMuNi.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58bb15d904dd7f0a60e971dbb5e7c102a241eb5c","infoHashBuffer":{"type":"Buffer","data":[88,187,21,217,4,221,127,10,96,233,113,219,181,231,193,2,162,65,235,92]},"announce":[],"urlList":[]}}