{"title":"Legends_of_the_Fall_(1994)_DvdRip_avi","uid":4463018,"size":1273986582,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:59acdab21913e42c7a84a67009c2dab40afc8f06&amp;dn=Legends_of_the_Fall_%281994%29_DvdRip_avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"R-key-typE","files":3,"time":1224790977,"description":"Legends of the Fall (1994)\n\n\nThe sweeping, melodramatic saga of three brothers, their powerful father, and a beautiful woman, the popular period drama Legends of the Fall presents a romanticized view of rugged masculinity against lush Montana scenery. Based on a novel by Jim Harrison, the film covers decades in the lives of Alfred (Aidan Quinn), Tristan (Brad Pitt), and Samuel (Henry Thomas) Ludlow, the sons of retired military man William Ludlow (Anthony Hopkins). Raised by the unorthodox Ludlow after the departure of their mother, the boys grow up close, sharing an appreciation of the land and a pioneering spirit. The family becomes divided, however, when young Sam enlists in World War I over his father's objections, and his brothers follow suit to protect him. Despite these efforts, Sam dies in battle, leaving Alfred and Tristan to return home and deal with the lingering torment. Further complicating matters is the presence of Sam's beautiful fiancÃƒÆ’Ã‚Â©e, Susannah (Julia Ormond). After Sam's death, she attracts the romantic attention of both the responsible Alfred and the brooding Tristan, a conflict that threatens to drive the brothers apart. Aspiring to epic status, the film utilizes period detail and attractive landscapes as a backdrop for tragic, doomed romance. While some critics complained that the film resembled a romance novel writ, veering at times into the overwrought, audiences embraced the combination of emotion and grand historical scale, making the film a box-office success.\n\n\n\n\nRule of thumb: Seed twice as long as it took to download!\n\nThanks, it's appreciated by many!!!\n\n\nTo see my other healthy torrents: http://thepiratebay.se/user/R-key-typE/\n\n\nWith regards,\n\nR-key-typE\n\n","torrent":{"xt":"urn:btih:59acdab21913e42c7a84a67009c2dab40afc8f06","amp;dn":"Legends_of_the_Fall_%281994%29_DvdRip_avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59acdab21913e42c7a84a67009c2dab40afc8f06","infoHashBuffer":{"type":"Buffer","data":[89,172,218,178,25,19,228,44,122,132,166,112,9,194,218,180,10,252,143,6]},"announce":[],"urlList":[]}}