{"title":"Avantasia feat. Klaus Meine - Dying For An Angel (2nafish)","uid":6046121,"size":160544772,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:5af3ca349426d9cec8df373a92fc2312cdb9d054&amp;dn=Avantasia+feat.+Klaus+Meine+-+Dying+For+An+Angel+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"2nafish","files":-1,"time":1292556085,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThe Wicked Symphony is the fourth full-length Avantasia album by German power metal vocalist Tobias Sammet, released on April 3, 2010, parallel with Angel of Babylon. The Wicked Symphony was released both as part of a box set, with the two albums combined, and as an individual album. It's the second part of &quot;The Scarecrow Saga&quot;. Tobias Sammet describes the title track in his own words, &quot;a ten minute track featuring a vocal battle between JÃƒÂ¸rn Lande, Russell Allen and me&quot;.\n\nAvantasia is a heavy metal project created by Tobias Sammet, vocalist and frontman of the group Edguy. The project's title is a portmanteau of the words &quot;avalon&quot; and &quot;fantasia&quot; (&quot;fantasy&quot;) and describes &quot;a world beyond human imagination&quot; (a quotation from the booklet). The project consists of a self-titled single, two full-length albums with the subtitle The Metal Opera, two EPs called Lost in Space, and the Scarecrow trilogy, composed of The Scarecrow, The Wicked Symphony and Angel of Babylon.\n\nIn the fall of 2009, Sammet announced the release of two new albums, The Wicked Symphony and Angel of Babylon, to be released on April 3, 2010. The story is set as a continuation of The Scarecrow. Some of the special guests include: drummers Eric Singer, Alex Holzwarth and Felix Bohnke, keyboardist Jens Johansson of Stratovarius, as well as vocalists Michael Kiske, Bob Catley, JÃƒÂ¸rn Lande, Tim &quot;Ripper&quot; Owens, Klaus Meine, Russell Allen, Andre Matos and Jon Oliva.\n\nTobias announced that the band will begin a tour in December 2010, and Avantasia was confirmed for Wacken Open Air 2011.\n\nIn Spring 1999, during Edguy's Theater of Salvation tour, Tobias Sammet began to write down his ideas for a metal opera, a concept album with many guest musicians. When the tour was finished, he carried this plan out, recruiting well-known metal players like ex-Helloween singer Michael Kiske, Andre Matos, Kai Hansen, and Rob Rock (ex Axel Rudi Pell, ex Angelica, ex Warrior, Driver, Impellitteri). The project was recorded with a core band of four members - Sammet playing keyboards and arranging orchestration, Henjo Richter playing guitar, Markus Grosskopf playing bass, and Alex Holzwarth on drums. In 2001, the self-titled single and the first full-length album, The Metal Opera, were released. The project was completed in September 2002 with the release of The Metal Opera Part II.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:5af3ca349426d9cec8df373a92fc2312cdb9d054","amp;dn":"Avantasia+feat.+Klaus+Meine+-+Dying+For+An+Angel+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5af3ca349426d9cec8df373a92fc2312cdb9d054","infoHashBuffer":{"type":"Buffer","data":[90,243,202,52,148,38,217,206,200,223,55,58,146,252,35,18,205,185,208,84]},"announce":[],"urlList":[]}}