{"title":"Beach Party (1963)","uid":4934054,"size":734849974,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5b60d8c2e548f074e7b301f7e8bf0f3f274eaee3&amp;dn=Beach+Party+%281963%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"martiniz","files":-1,"time":1244165045,"description":"Muscle Beach Party is the first of seven Beach Party films\n\nFilms in the series:\nBeach Party (1963) \nMuscle Beach Party (1964) \nBikini Beach (1964) \nPajama Party (1964) \nBeach Blanket Bingo (1965) \nHow to Stuff a Wild Bikini (1965) \nThe Ghost in the Invisible Bikini (1966) \n\n\nPlot:\nThe plot kicks off with an anthropologist, Professor Robert Orwell Sutwell (Robert Cummings) secretly studying the wild mating habits of Southern California teenagers that hang out at the beach and use strange surfing jargon. After he temporarily paralyzes Eric Von Zipper (Harvey Lembeck), the leader of the local outlaw motorcycle gang, who was making unwanted advances on buxom beach bunny Dolores (Annette Funicello), Dolores develops a crush on the Professor. Of course her surfing boyfriend Frankie (Frankie Avalon), the local Big Kahuna, becomes jealous and begins flirting with Ava, a foreign waitress who is even more buxom than his girlfriend. In the words of Deadhead (Jody McCrea), &quot;She's got everything!&quot; Meanwhile Marianne (Dorothy Malone) is also developing a crush on the Professor. Also, to top it all off, Ava develops a thing for Von Zipper. Will true love triumph?\n\nThe Eric Von Zipper character (Harvey Lembeck) is mostly a parody of Marlon Brando's role in the motorcycle-gang film The Wild One. The film introduced a running gag throughout most of the rest of the series, when Von Zipper learns a special nerve touch to the head that puts a person into a frozen trance that he calls &quot;giving someone the finger&quot;. Unfortunately for Von Zipper, the only person to whom he seems able to give the finger is himself. Along with this and other misfortunes that almost always bestow him, he can frequently be heard lamenting his famous, &quot;Why me? ... why is it always me?&quot; Von Zipper's motorcycle gang appears in all of the beach films except for Muscle Beach Party. Shortly after this film Meredith MacRae went on to join the cast of Petticoat Junction.\n\nCast:\nRobert Cummings \nDorothy Malone\nFrankie Avalon\nAnnette Funicello\nMorey Amsterdam\nHarvey Lembeck","torrent":{"xt":"urn:btih:5b60d8c2e548f074e7b301f7e8bf0f3f274eaee3","amp;dn":"Beach+Party+%281963%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b60d8c2e548f074e7b301f7e8bf0f3f274eaee3","infoHashBuffer":{"type":"Buffer","data":[91,96,216,194,229,72,240,116,231,179,1,247,232,191,15,63,39,78,174,227]},"announce":[],"urlList":[]}}