{"title":"Billy Joel - Streetlife Serenade 320cbr (Big Papi Vinyl) 1974","uid":9464737,"size":91806613,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5b68615bd40723cd7dfc96712e9860db272919bf&amp;dn=Billy+Joel+-+Streetlife+Serenade+320cbr+%28Big+Papi+Vinyl%29+1974&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Big-Papi","files":-1,"time":1389436196,"description":"Source: 1974 Vinyl LP\n\nRaw rip no post-processing has been done. This is actual record play. - Big Papi\n\n\nTracklist\n\nA1\t Streetlife Serenader\t5:18\nA2\t Los Angelenos\t3:41\nA3\t The Great Suburban Showdown\t3:46\nA4\t Root Beer Rag\t3:00\nA5\t Roberta\t4:28\nB1\t The Entertainer\t3:39\nB2\t Last Of The Big Time Spenders\t4:36\nB3\t Weekend Song\t3:31\nB4\t Souvenir\t2:01\nB5\t The Mexican Connection\t3:38\n\n\nBy S. Heffer\n\nSomehow, this album escaped my notice initially when I was exploring the music of Billy Joel - it wasn't in my dad's record collection and none of my friends who were into his music had ever mentioned it. After having, I supposed, overlooked it at first in the record store, I finally discovered the record and brought it home with me sometime in the spring of 1985. My initial impression of this album was not necessarily a great one...There were only a couple of songs on here that I liked at first. Over the years it remained relatively ignored by me...but now, when I listen to Billy Joel, this is one of the albums I listen to most - probably because I didn't over-play this one when in High School.\n\nActually, most of the songs here are really very good and show a little bit of a broadening of style for Billy Joel. Favorites include &quot;Los Angelenos&quot; which is actually rocks a little bit and makes good use of the electric piano (which, for those who have read other reviews of mine, is one of my favorite instruments...). &quot;The Great Suburban Showdown&quot; makes interesting use of what I suppose is one of those early Moog Synthesizers. It's used to great effect, as sort of embellishment to a tale of middle-class weekend boredom. &quot;The Entertainer&quot; is a very catchy, cynical view of the music business. I also very much like the pretty instrumental &quot;The Mexican Connection&quot; which has a nice hook and which also makes good ornamental use of the Moog synthesizer...I suppose the one song I don't like that much is the other instrumental, the cornball &quot;Root Beer Rag&quot; - great piano playing and all, but just too corny for my tastes...The other two or three songs on the album to me are somewhat nondescript, if not pleasant typical early Billy Joel songs...\n\nIn sum, there are no real masterpieces on this album, but most of the songs on this album are really nice - pretty piano playing, good lyrics - biting at times - and well composed. A couple of others are neither here nor there - neither good nor bad...and one (&quot;Root Beer Rag&quot;) which I just don't like. This is a better than average album and I give it 3.75 stars, rounding up to 4 stars. RECOMMENDED..","torrent":{"xt":"urn:btih:5b68615bd40723cd7dfc96712e9860db272919bf","amp;dn":"Billy+Joel+-+Streetlife+Serenade+320cbr+%28Big+Papi+Vinyl%29+1974","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b68615bd40723cd7dfc96712e9860db272919bf","infoHashBuffer":{"type":"Buffer","data":[91,104,97,91,212,7,35,205,125,252,150,113,46,152,96,219,39,41,25,191]},"announce":[],"urlList":[]}}