{"title":"Things v2.1","uid":7937443,"size":19788559,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:5c79960ccfecbfc406ea83c98b6fa1e1d5616bd0&amp;dn=Things+v2.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"brad101","files":-1,"time":1355898620,"description":"Things is a powerful, easy-to-use task-management app that can help you enter, organize, and act on items in your to-do list. Based on the popular Getting Things Done productivity method, Things gives you an elegant, streamlined interface--a classic, Mac-style multipane setup that doesn't require a lot of additional windows for its work flow.\n\nIts clean interface even dispenses with columns, and you can use the app's flexible tag system for priority, task duration, or any sort of categorization that works for you. You can quickly enter new tasks from anywhere, using a system-wide shortcut, and you can include links to URLs, e-mails, folders, and files, along with due dates and other additional context. &quot;Projects&quot; lets you collect subtasks into a larger endeavor, &quot;Areas&quot; lets you group by areas of responsibility in your life (such as work or family), &quot;People&quot; helps keep an eye on delegated tasks, and the &quot;Logbook&quot; tracks completed tasks.\n\nThere are other, similar task-management apps available--including many that are much cheaper--but Things' killer interface, robust capability to scale, plug-ins with popular app launchers, support for AppleScript, and integration with a separate iPhone app combine to make this one of the very best applications of its kind. If you use Get Things Done, you need to check out Things.\n\nw/keygen from CORE.","torrent":{"xt":"urn:btih:5c79960ccfecbfc406ea83c98b6fa1e1d5616bd0","amp;dn":"Things+v2.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c79960ccfecbfc406ea83c98b6fa1e1d5616bd0","infoHashBuffer":{"type":"Buffer","data":[92,121,150,12,207,236,191,196,6,234,131,201,139,111,161,225,213,97,107,208]},"announce":[],"urlList":[]}}