{"title":"The Sword Collection COMPLETE 1942 Ace Publications","uid":8501926,"size":143202474,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:5c98233edc2c8b7011d69cdc47f94fff97a45f05&amp;dn=The+Sword+Collection+COMPLETE+1942+Ace+Publications&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Mothra67","files":-1,"time":1369326234,"description":"this guy was REALLY obscure!\n\n\nThe son of John Lake, president of the Lake Aircraft company, Arthur Lake accompanied his father on a business trip to England, where Arthur found the tomb of King Arthur along with with his legendary blade, Excalibur, sheathed in a stone. He pulled the sword out of the stone, gaining superhuman powers and transforming from a teenager into an older superhero form. He is superhumanly strong but not invulnerable (perhaps because he lacks the legendary scabbard of Excalibur which protects from all wounds). As &quot;The Sword,&quot; he uses these powers to fight both the Nazis and the evil sorceress Morgana. He soon gained two sidekicks - his friend Lance Larter and a plant worker named Moe Lynn. Whenever Arthur transforms by drawing his sword, they gain powers of their own. Lance became the Lancer with similar powers as Sword, while Moe became the new Merlin.\n\nEarly accounts state that Arthur can only draw the sword when he is pure of heart. The magic is fairly strict, forbidding him to use the sword when he'd been rude to a witch who had cursed his father's factory and only allowed to wield it again when he'd saved a cat from a tree. (Lightning Comics v3 #1) If Arthur Lake is anything like the legendary Arthur, this may be a problem later on. \n\nGolden Age Appearances \n\n    Captain Courageous Comics #6\n    Lightning Comics vol.3 #1 \n    Super Mystery Comics vol.3 #3 - vol.5 #3 \n\nSeed for all to enjoy!  Sharing is caring!","torrent":{"xt":"urn:btih:5c98233edc2c8b7011d69cdc47f94fff97a45f05","amp;dn":"The+Sword+Collection+COMPLETE+1942+Ace+Publications","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c98233edc2c8b7011d69cdc47f94fff97a45f05","infoHashBuffer":{"type":"Buffer","data":[92,152,35,62,220,44,139,112,17,214,156,220,71,249,79,255,151,164,95,5]},"announce":[],"urlList":[]}}