{"title":"Encyclopedia of Mongolia And The Mongol Empire","uid":11729826,"size":7665960,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5cdac59da4d3d5fb2c225ce7790cdced43c20d65&amp;dn=Encyclopedia+of+Mongolia+And+The+Mongol+Empire&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1425247743,"description":"From Genghis Khan to the arid wastes of the Gobi desert, from the Soviet Union's most Stalinist satellite to the first Asian communist country to embrace democracy, Mongolia has always been an area of mystery and dread to westerners. Studied in school as part of the core curriculum, the Mongol Empire once stretched across Asia from the Pacific Ocean to Kiev and Baghdad. In modern times, interest in Mongolia has been suddenly sparked by the opening up of the country after 70 years of isolation in the Communist block. This first comprehensive A-to-Z encyclopedia of Mongolia and the Mongols provides up-to-date, accurate, and readable entries on all aspects of this people's turbulent history and rich culture, from prehistory to modern times. While particular emphasis is placed on the Mongol Empire, entries cover the country's entire history and range from geography to culture and religion to personalities, battles, daily life, and folklore. This volume is a great first-stop for research on Mongolia as well as a valuable reference for those wishing to expand their knowledge of a region that is, to most westerners, exotic and relatively unknown","torrent":{"xt":"urn:btih:5cdac59da4d3d5fb2c225ce7790cdced43c20d65","amp;dn":"Encyclopedia+of+Mongolia+And+The+Mongol+Empire","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5cdac59da4d3d5fb2c225ce7790cdced43c20d65","infoHashBuffer":{"type":"Buffer","data":[92,218,197,157,164,211,213,251,44,34,92,231,121,12,220,237,67,194,13,101]},"announce":[],"urlList":[]}}