{"title":"Entwine - Discography (1999 - 2009) 320 k","uid":6710181,"size":600523812,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:5d1aa56ef116ed9ab906aff645ca73b382fe2bbe&amp;dn=Entwine+-+Discography+%281999+-+2009%29+320+k&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":62,"time":1317322518,"description":"The Treasures Within Hearts (1999)\nGone (2001) \nTime of Despair (2002)\nDiEversity (2004) \nFatal Design (2006) \nPainstained (2009)\n\n\n \n\n\n \n\n\nThis Finnish gothic metal supergroup Entwine have travelled a long way from their death metal-ish roots. Founded by Aksu Hanttu (drums), Tom Mikkola (guitar, also vocals at the time) and T.Taipale (bass) in 1995, it did not take long for them to get bored with the limitations the death metal genre imposed on their creativity. About two years later they had evolved into a far more melodic band, and were in need of a good singer, a keyboardist and a second guitarist to finally realize their more emotional musical visions. Shortly after P. Willman joined the band on vocals and on second guitar in Autumn 1997 when Entwine recorded their first demo, &quot;Divine Infinity&quot;. The feedback was extremely positive, and word started spreading around of these new hopefuls that had now replaced death with goth.\n\nAfter Riitta Heikkonen took over the keyboard-duties in February of 1998 Entwine was finally ready for live appearances. In 1999 Spikefarm Records offered Entwine a recording deal, and in September the same year Entwine's debut album &quot;The Treasures within Hearts&quot; was released. Although the debut album gained good reviews and the band grew more and more successful with each gig they played, everything was not working within the group. Soon after &quot;Treasures&quot;' release singer Willman and bass player Taipale left the band. Then it was decided to add the new bassist Joni Miettinen to the line up, and to introduce a new singer, Mika Tauriainen to the band.\n\nThe debut's follow-up album, &quot;Gone&quot;, was released in April of 2002, immediately receiving glowing reviews and praise world-wide; not only was &quot;Gone&quot; named Album Of The Month in Germany's Hammer, but their single &quot;New Dawn&quot; was a permanent resident in German clubs too. Furthermore their success was crowned by New Dawn's Top Ten position on the national Finnish Singles Chart. A new guitar player, Jaani KÃƒÂ¤hkÃƒÂ¶nen, joined the band in 2001 as a live session guitarist but pretty soon found his place as a permanent member of Entwine - filling the gap left by P. Willman. It was obvious that their steadily growing amount of fans were hungry for fresh tunes by Entwine so in early 2002 they hit Finnish Astia Studios with producer Anssi Kippo to record their third full-length album, &quot;Time Of Despair&quot;. Released in the Spring of 2002, Time of Despair was followed by a world tour with Theatre of Tragedy and Ram-Zet.\n\nEntwine's fourth album &quot;DiEversity&quot; was recorded at the famed Finnish Astia Studios as well, and the album was followed by &quot;Sliver&quot; EP which included the captivating hit track &quot;Break Me&quot; that was also made into a video. After the EP release Entwine laid low for a year, but when waking up from their slumber the group put new Entwine hymns together at record speed, during only just few weekends. The new album &quot;Fatal Design&quot; was recorded at Petrax and Groveland studios by Entwine's very own drummer Aksu Hanttu and produced by Janne Joutsenniemi (known to many from the ranks of legendary Finnish metal band Stone and latterly from the line up of Sub Urban Tribe). The tracks were then mixed in subtle care of Finnvox's Mikko Karmila (who is highly appreciated for his work with Nightwish, Children of Bodom, and many others) and mastered at Stockholm's Cutting Room.\n\n&quot;Fatal Design&quot; presents a new, heavier Entwine - a band that makes goth go one step further. The album release was preceded by the release of &quot;Surrender&quot; single.\n\n","torrent":{"xt":"urn:btih:5d1aa56ef116ed9ab906aff645ca73b382fe2bbe","amp;dn":"Entwine+-+Discography+%281999+-+2009%29+320+k","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d1aa56ef116ed9ab906aff645ca73b382fe2bbe","infoHashBuffer":{"type":"Buffer","data":[93,26,165,110,241,22,237,154,185,6,175,246,69,202,115,179,130,254,43,190]},"announce":[],"urlList":[]}}