{"title":"The Bijak of Kabir (e-book, PDF)","uid":6349736,"size":6961712,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5d4d8e31e619685a21f1e4c7573ec44331089cbc&amp;dn=The+Bijak+of+Kabir+%28e-book%2C+PDF%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"inst23","files":-1,"time":1303957887,"description":"The Bijak of Kabir\nby Kabir, Linda Hess, Shukdev Singh (Translators)\n \nOxford University Press | ISBN: 0195148762 | 216 pages | PDF | Language: English\n\nAmazon: &lt;a href=&quot; http://www.amazon.com/Bijak-Kabir-Linda-Hess/dp/0195148762&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.amazon.com/Bijak-Kabir-Linda-Hess/dp/0195148762&lt;/a&gt;\n\n\n\nDescription:\n\nKabir was an extraordinary oral poet whose works have been sung and recited by millions throughout North India for half a millennium. He may have been illiterate and he preached an abrasive, sometimes shocking, always uncompromising message that exhorted his audience to shed their delusions, pretentious, and empty orthodoxies in favor of an intense, direct, and personal confrontation with the truth. Thousands of poems are popularly attributed to Kabir, but only a few written collections have survived over the centuries. The Bijak is one of the most important, and is the sacred book of those who follow Kabir.\n\n\n\nReviews:\n\nMost other books that I've read about Kabir emphasize the devotional (bhakti) side of Kabir. Hess and Singh have done a great service by showing us his wild and crazy side. The rough side. The tell it like it is side. \n\nKabir decried remaining within rigid religious boundaries. God is beyond. And more: beyond beyond. Yet organized religions such as Sikhism and the Sant Mat movement have tried to make Kabir one of their own. This book demonstrates the impossibility of confining Kabir in any theological structure. \n\nHess' Introduction is marvelous. This academic can write clearly and passionately, while still preserving high scholarly standards. I've read most of the English books about Kabir. After finishing &quot;The Bijak of Kabir&quot; I finally feel like I've been given an honest glimpse of this great mystic who fearlessly urges us to experience the wild Mystery that transcends all attempts to cage it within religious conceptual systems.\n\n-\n\nKabir was an extraordinary oral poet whose works have been sung and recited throughout North India for half a millennium. He may have been illiterate (&quot;I don't touch ink or paper, this hand never grasped a pen.&quot;) and he preached an abrasive, sometimes shocking, always uncompromising message that exhorted his audience to shed their delusions, pretensions, and empty orthodoxies in favor of an intense, direct, and personal confrontation with the truth.\n\nThousands of poems are popularly attributed to Kabir, but only a few written collections have survived over the centuries. The Bijak is one of the most important, and sacred book of those who follow Kabir.","torrent":{"xt":"urn:btih:5d4d8e31e619685a21f1e4c7573ec44331089cbc","amp;dn":"The+Bijak+of+Kabir+%28e-book%2C+PDF%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d4d8e31e619685a21f1e4c7573ec44331089cbc","infoHashBuffer":{"type":"Buffer","data":[93,77,142,49,230,25,104,90,33,241,228,199,87,62,196,67,49,8,156,188]},"announce":[],"urlList":[]}}