{"title":"Kingdoms Of Amalur Reckoning XBOX360-iMARS","uid":7003816,"size":8738860330,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:5dec46c57b0f9e9905fffa56e039af66fe218e25&amp;dn=Kingdoms+Of+Amalur+Reckoning+XBOX360-iMARS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"boobsman","files":12,"time":1328192286,"description":"THIS IS AN XGD3 ISO AND IS ONLY BE PLAYABLE WITH LT+2.0 or ABOVE!!!\n\n[IMG]http://www.freeimage.us/image-C881_4F2A8575.jpg[/IMG]\n\nKingdoms Of Amalur Reckoning XBOX360-iMARS\n\nKingdoms Of Amalur: Reckoning is an open-world action role-playing game set in Amalur, \na mysterious and magical new fantasy world created by New York Times bestselling author \nR. A. Salvatore. Brought to life visually through the trademark style of renowned artist \nand Spawn creator Todd McFarlane, Reckoning brings a new level of visual style and visceral \naction combat to the RPG genre. The game is being developed under the leadership of Ken Rolston, \nlead designer of the critically acclaimed RPGs Elder Scrolls 3: Morrowind and Elder Scrolls 4: Oblivion.\n\nKingdoms Of Amalur: Reckoning combines intense third-person action combat with deep exploration, \nexpansive character development and customization, and immersive storytelling in an extraordinarily \ndetailed fantasy universe. Gamers begin their journey when they miraculously rise from the dead, \nwielding dangerous new magic capable of changing the very Fate of Amalur. Thrust into a brutal war \nbetween multiple races, factions, and alliances, players vie for the secrets of their immortality \nand the ancient evil that threatens to consume the world.\n\nThe lore of Kingdoms Of Amalur: Reckoning spans an epic course of 10,000 years of history created by \nR. A. Salvatore. Kingdoms Of Amalur: Reckoning captures a moment in this history, the tale of a singular \nhero capable of reshaping the fate of the world of Amalur. Every building, tree, and creature has a clear \nand defined history within this immersive world filled with extraordinary landscapes, mysterious cities, \ncolorful characters, and fantastic creatures inspired by the legendary art style of Todd McFarlane.\n\nPlatform: XBOX 360\nRegion: Region Free\nFormat: XDG3 (LT2.0 or above)\nSize 1 DVD\nLanguage: English\nGenre: Role Playing\n\nTrailer:\n\nXGD3 BURN GUIDE: http://nickthegr33k.eu/XGD3burn.pdf\n\n[img]http://www.freeimage.us/image-0C57_4F1E8CEB.gif[/img]","torrent":{"xt":"urn:btih:5dec46c57b0f9e9905fffa56e039af66fe218e25","amp;dn":"Kingdoms+Of+Amalur+Reckoning+XBOX360-iMARS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5dec46c57b0f9e9905fffa56e039af66fe218e25","infoHashBuffer":{"type":"Buffer","data":[93,236,70,197,123,15,158,153,5,255,250,86,224,57,175,102,254,33,142,37]},"announce":[],"urlList":[]}}