{"title":"Fault Line","uid":8819616,"size":1460270727,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:5e245bc50b58bb787f63267d47a30ba41cc639ac&amp;dn=Fault+Line&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Atufi","files":124,"time":1376670244,"description":"In Silicon Valley, the eccentric inventor of a new encryption application is murdered in an apparent drug deal.\n\nIn Istanbul, a cynical undercover operator receives a frantic call from his estranged brother, a patent lawyer who believes he is the next victim.\n\nAnd on the sun-drenched slopes of Sand Hill Road, Silicon Valley's nerve center of money and technology, old family hurts sting anew as two brothers who share nothing but blood and bitterness wage a desperate battle against a faceless enemy.\n\nAlex Treven has sacrificed everything to achieve his sole ambition: making partner in his high-tech law firm. But then the inventor of a technology Alex is banking on is murdered... and the patent examiner who reviewed it dies... and Alex himself narrowly escapes an attack in his own home. Off balance, out of ideas, and running out of time, he knows the one person who can help him is the last person he'd ever ask: his brother.\n\nBen Treven is a Military Liaison Element, an elite undercover soldier paid to &quot;find, fix, and finish&quot; high-value targets in America's Global War on Terror. Disenchanted with what he sees as America's culture of denial and decadence, Ben lives his detached life in the shadows because the black ops world is all he really knows--and because other than Alex, who he hasn't spoken to since their mother died, his family is long gone.\n\nBut blood is thicker than water, and when he receives Alex's frantic call, Ben hurries to San Francisco to help him. Only then does Alex reveal that there's another player who knows of the technology: Sarah Hosseini, a young Iranian American lawyer who Alex has long secretly desired... and who Ben immediately distrusts. As these three radically different people struggle to identify the forces attempting to silence them, Ben and Alex are forced to examine the events that drove them apart--even as Sarah's presence, and her own secret wants, deepens the fault line between them.\n\n\nFault Line centers on a conspiracy that has spun out of the shadows and into the\nstreets of America, a conspiracy that can be stopped only by three people--three\npeople with different worldviews, different grievances, different motives.  To survive the forces arrayed against them, they'll\nfirst have to survive each other.\n\n \n\n&quot;The first\nblogosphere thriller...  Eisler's novel,\nwhich turns entirely on a super-secret assassinations program, is looking less\nlike fiction and more like the work of someone who has a firm grip on what's\nreally happening.&quot;\n\n--Scott Horton, Harper's Magazine","torrent":{"xt":"urn:btih:5e245bc50b58bb787f63267d47a30ba41cc639ac","amp;dn":"Fault+Line","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e245bc50b58bb787f63267d47a30ba41cc639ac","infoHashBuffer":{"type":"Buffer","data":[94,36,91,197,11,88,187,120,127,99,38,125,71,163,11,164,28,198,57,172]},"announce":[],"urlList":[]}}