{"title":"Mozart - The Requiem Mass - Marriner","uid":5140390,"size":582269933,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5ef80e473a47c64ca4b950c45d0b05fa8e704419&amp;dn=Mozart+-+The+Requiem+Mass+-+Marriner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":4,"uploader":"eddie1969","files":-1,"time":1256861213,"description":"This is undoubtedly the finest recording of Mozart's Requiem I've heard. Having owned several recordings of the Requiem Mass, each having its own distinct style (Karajan, Hogwood, Pearlman, Spering, Christie, Solti) this release by Sir Neville Marriner is the recording one finds him or herself coming back to often.\n\nIt's a wonderfully dramatic recording. This comes from the same conductor who recorded the soundtrack to Amadeus, of course. It is also a dark sounding record, while most the period-instrument recordings available of KV. 626 are rather light, airy, and superficial for a death mass. While this may be a powerful modern-instrument rendition, it is not a romanticized as Karajan's, which is a good thing.\n\nThe soloists are first rate. McNair's voice is perfect in intoning the &quot;Te Decet&quot; with her explicit calmness, yet tacit darkness and tension that you cannot get from Monica Groop, Ruth Ziesak, or Emma Kirkby.\n\nThe conducting is careful and the tempi are perfect. You never need to worry about Marriner going to slow as other modern-instrument conductors do. I have never heard a &quot;Recordare&quot; more radiantly executed, or a &quot;Kyrie&quot; with such driving force, or even a technically challenging movement such as the &quot;Domine Jesu&quot; handled with such precision.\n\nThe choir is also the strongest choir I've heard sing Mozart's Requiem. This chorus can invoke fear, while other choirs sound either too large or too amateurish for such a piece.\n\nRegarding sound quality, I have never had a problem with the sound as it sounds just as good as any other record in my collection. Maybe it is the resonance of the record, but it does definitely give the recordin a large &quot;ecclesiastical&quot; atmosphere, quite appropriate for the music. \n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:5ef80e473a47c64ca4b950c45d0b05fa8e704419","amp;dn":"Mozart+-+The+Requiem+Mass+-+Marriner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ef80e473a47c64ca4b950c45d0b05fa8e704419","infoHashBuffer":{"type":"Buffer","data":[94,248,14,71,58,71,198,76,164,185,80,196,93,11,5,250,142,112,68,25]},"announce":[],"urlList":[]}}