{"title":"Kik Tracee (2 CDs) Field Trip and No Rules","uid":6064801,"size":225604040,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5f642ff815c691b6813b79dc98c4659ad1dcf8f9&amp;dn=Kik+Tracee+%282+CDs%29+Field+Trip+and+No+Rules&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Crashsq","files":20,"time":1293301920,"description":"KIK TRACEE\nFormed 1988, U.S.A.\n\nAlbums:\n1991 No Rules\n1992 Field Trip\n\nHistory:\nA little impact 90's hard rock band that rode in on the tail end of the glam movement, and didn't stand a chance with the influx of alternative music. Accused, rather unfairly, of being a Gun N'Roses clone, despite being far more in-depth and complex then the average L.A. Strip band.\n  Formed in Los Angeles, California by Stephen Shareaux (vocals), Michael Marquis (guitar), Gregory Hex (guitar), Rob Grad (bass) and Johnny Douglas (drums). Dana Strum produced the debut and it took eleven months and three different states to complete, due to the breaking success of Strum's band Slaughter (and therefore his need to tour). Strum called the band a cross between Living Colour, The Cult and Guns N'Roses. The final release was an EP produced by Chris Goss of cult heroes Masters Of Reality.\n  Shareaux was rumored to have auditioned for Motley Crue in 1992 when they were searching for a new vocalist, prior to recording a second full-length album that was rejected by the music label, and by 1993 the band had fallen apart. Shareaux joined Flipp before creating a new psychedelic band called Revel 8 while Grad is currently fronting the band Superfine and Hex pursued placements in film and TV as well as a project called Deep Audio. If Kik Tracee had debuted in the mid 80's they may have been huge, but instead will remain a forgotten band. ","torrent":{"xt":"urn:btih:5f642ff815c691b6813b79dc98c4659ad1dcf8f9","amp;dn":"Kik+Tracee+%282+CDs%29+Field+Trip+and+No+Rules","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f642ff815c691b6813b79dc98c4659ad1dcf8f9","infoHashBuffer":{"type":"Buffer","data":[95,100,47,248,21,198,145,182,129,59,121,220,152,196,101,154,209,220,248,249]},"announce":[],"urlList":[]}}