{"title":"Landmark Education - Lars Bergwik","uid":4200358,"size":98034623,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:628630a9a9e33f843a0fc8cd0ef23419dc2ac721&amp;dn=Landmark+Education+-+Lars+Bergwik&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"freddym3rc","files":5,"time":1211469415,"description":"Lars talks about Landmark.\n\nI am introducing an antidote to the landmark virus of the mind. Landmark Education Corporation uses very powerful mind control/thought reform methods to implement a \\&quot;technology\\&quot; into unsuspecting participants. I have been there - I was an introduction leader to the forum for 2 years. I was totally into landmark - it was my life...now I have turned into a very disgruntled ex member of the \\&quot;educational cult\\&quot; LEC.\n\nI have a lot of friends and family that have had some good results out of their participation but the evil side of LEC has to be exposed. I think a red guy with horns on his forehead has \\&quot;transformed\\&quot; into Werner Erhard and tried to win the humans of the earth over to the dark side.\n\nWhen entering Landmark it is like selling your mind to the devil...you will get something that seem miraculous but the debt to the devil will be bigger than you thought. Landmark Education forum leaders are very good manipulators and they think they are the masters of the universe.\n\nThe time has come to tell the public of their evil deeds.\n\nI am Lars Bergwik - I am legion - I will never surrender - my goal is to bring the cult of LEC to its knees wherever they show their ugly face.\n\nHere is my possibility \\&quot;to harass the ass of landmark\\&quot;\n\nFor legal contact: Whinnie the Pooh and his assistant Pippi Longstocking (the strongest girl alive)","torrent":{"xt":"urn:btih:628630a9a9e33f843a0fc8cd0ef23419dc2ac721","amp;dn":"Landmark+Education+-+Lars+Bergwik","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"628630a9a9e33f843a0fc8cd0ef23419dc2ac721","infoHashBuffer":{"type":"Buffer","data":[98,134,48,169,169,227,63,132,58,15,200,205,14,242,52,25,220,42,199,33]},"announce":[],"urlList":[]}}