{"title":"Aretha Franklin and George Michael - I Knew You Were Waiting","uid":4753313,"size":149225476,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:62d6930f93ee7da95a306b5a4ff4800244f631c0&amp;dn=Aretha+Franklin+and+George+Michael+-+I+Knew+You+Were+Waiting&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1236308440,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;I Knew You Were Waiting (for Me)&quot; was a song performed by Aretha Franklin and George Michael in a duet in 1987. It was written by Simon Climie and Dennis Morgan.\n\nThe song was a one-off project which helped Michael achieve an ambition by singing with one of his favourite artists, and it reached number one in both the UK Singles Chart and the Billboard Hot 100 upon its release. It was, remarkably, Franklin's first and only UK number-one hit, and only her fourth top ten achievement in the country since &quot;I Say a Little Prayer&quot;, nearly decades earlier. This was also the last, out of eighteen Top 10 hits, for Franklin in the U.S. Billboard Hot 100.\n\nFor Michael, it became his third consecutive number-one in the UK from three releases since going solo, following 1984's &quot;Careless Whisper&quot; (though the single was actually from the Wham! album Make It Big) and 1986's &quot;A Different Corner&quot;. However, as the song was a duet, he was not afforded the same status or level of congratulation as Gerry &amp; The Pacemakers or Frankie Goes to Hollywood, the only two artists to have previously achieved number one with their first three releases. Michael's previous success (with Wham!, which included four number-ones) was also a factor in the watering down of his achievement.\n\nThe single was the first Michael had recorded (as a lead artist) which he had not written himself. The co-writer, Simon Climie, was unknown at the time, although he later had success as a performer with Climie Fisher in 1988.\n\nThe continuous run of UK chart-toppers ended for Michael thereafter, with his next number-one coming in 1991 - again as part of a duet (this time with Elton John) - while his next entirely solo number-one in the UK didn't appear until 1996.\n\nOn the U.S. Billboard Hot 100, &quot;I Knew You Were Waiting (for Me)&quot; debuted at #59, the week of February 21, 1987, reaching #1 in its ninth week, April 18, 1987, and remaining there for two consecutive weeks.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:62d6930f93ee7da95a306b5a4ff4800244f631c0","amp;dn":"Aretha+Franklin+and+George+Michael+-+I+Knew+You+Were+Waiting","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62d6930f93ee7da95a306b5a4ff4800244f631c0","infoHashBuffer":{"type":"Buffer","data":[98,214,147,15,147,238,125,169,90,48,107,90,79,244,128,2,68,246,49,192]},"announce":[],"urlList":[]}}