{"title":"Jonathan Swift - Gulliver's Travels &amp; Political Writings (2 ","uid":10248612,"size":6494972,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:62da632adac0c49f4486916233dc93ea4965dfb8&amp;dn=Jonathan+Swift+-+Gulliver%27s+Travels+%26amp%3B+Political+Writings+%282+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"workerbee","files":-1,"time":1401323143,"description":"\nJONATHAN SWIFT (1667-1745) was an Anglo-Irish writer, essayist, pamphleteer, poet and cleric who is considered the foremost prose satirist in the English language.\n\nGULLIVER'S TRAVELS (1726, amended 1735) is a classic of English literature.  Both a sardonic anatomy of human nature and a parody of the &quot;travellers' tales&quot; literary sub-genre, it is a skilful blend of fantasy and realism.  Each of the four books -- recounting four voyages to mostly fictional exotic lands -- has a different theme but all are attempts to deflate human pride.  The book became popular as soon as it was published.  John Gay wrote in a 1726 letter to Swift, &quot;It is universally read, from the cabinet council to the nursery,&quot; and the book has never been out of print.\n\nThe fully annotated ENGLISH POLITICAL WRITINGS reproduces some of Swift's most brilliant and powerful political pamphleteering between 1711-1714.  Writing for the Tory government, he did more to settle the fate of parties and the nation than any literary figure, before or since.  This volume collects together major defences of the government's position, including &quot;The Conduct of the Allies&quot; and &quot;The Publick Spirit of the Whigs&quot;, vigorous attacks on his opponents, short satirical broadsides, and brief contributions to periodicals.  A comprehensive introduction, drawing on contemporary literary and historical scholarship, is supported by detailed explanatory notes on each text.\n\n\nBoth the following books are in PDF format:\n\n* ENGLISH POLITICAL WRITINGS, 1711-1714: &quot;The Conduct of the Allies&quot; and Other Works (Cambridge UP, 2008).  Edited by Bertrand A. Goldgar and Ian Gadd.\n\n* GULLIVER'S TRAVELS (Oxford World's Classics, 2005).  Edited with an Introduction by Claude Rawson, and Notes by Ian Higgins.\n\n\nSee also:\n\n* THE TALE OF A TUB &amp; OTHER WORKS &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/10241938/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/10241938/&lt;/a&gt;\n\n________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n                                            &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!\n","torrent":{"xt":"urn:btih:62da632adac0c49f4486916233dc93ea4965dfb8","amp;dn":"Jonathan+Swift+-+Gulliver%27s+Travels+%26amp%3B+Political+Writings+%282+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62da632adac0c49f4486916233dc93ea4965dfb8","infoHashBuffer":{"type":"Buffer","data":[98,218,99,42,218,192,196,159,68,134,145,98,51,220,147,234,73,101,223,184]},"announce":[],"urlList":[]}}