{"title":"Planet of Dinosaurs (1978) DVD - James Whitworth, Pamela Bottaro","uid":10863267,"size":4005140480,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:63118062953a55c51f1e6bc762142e109aacf08e&amp;dn=Planet+of+Dinosaurs+%281978%29+DVD+-+James+Whitworth%2C+Pamela+Bottaro&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SaM","files":-1,"time":1408898508,"description":"Planet of Dinosaurs (1978) DVD - James Whitworth, Pamela Bottaro [DDR]\n\n\nPlanet of Dinosaurs (also known as Dinossauros: Planet of dinosaurs) is a 1978 science fiction film. Set in an unspecified future, the film follows the journey of Captain Lee and his crew after they crash land on a planet with similar life conditions as Earth, but millions of years behind in time. Encountering a wide variety of dangerous dinosaurs, the crew decides that its best chance for survival lies on finding higher ground and setting up a defensive perimeter on a higher plateau for refuge to wait for when or if their rescuers arrive. They soon encounter a deadly Tyrannosaurus and must figure out a way to defeat the creature and survive on the planet.\n\nThe film was a low budget endeavor with no major stars; James Whitworth and Max Thayer have the most film experience amongst the actors. Director James K. Shea instructed most of the budget to be spent on the special effects for the film, which included an array of award-winning stop motion dinosaurs, leaving little money for props or even to pay the main actors. Modern reviews have generally been negative, although there is agreement that the stop motion dinosaurs were the most notable and enjoyable aspect of the film.\n\nCAST:-\nJames Whitworth \tJim\nPamela Bottaro \tNyla\nLouie Lawless \tCaptain Lee Norsythe\nHarvey Shain \tHarvey Baylor\nCharlotte Speer \tCharlotte\nChuck Pennington \tChuck\nDerna Wylde \tDerna Lee\nMax Thayer \tMike\nMary Appleseth \tCindy\n\nDirected by James Shea\nProduced by James Shea\nWritten by Jim Aupperle\nMusic by Kelly Lammers\nRunning time 84 mins.\n\nMOVIE PLOT:-\nAfter a mechanical failure aboard the spaceship Odyssey, Captain Lee Norsythe (Louie Lawless) is forced to crash land on a planet with atmosphere and conditions much like that of Earth, although it is many light-years away. As the ship sinks into the lake that it landed in, communications officer Cindy (Mary Appleseth) realizes that she forgot the radio in the ship and attempts to retrieve it, with the assistance of fellow crew-member Chuck (Chuck Pennington). En route, Cindy is attacked and killed by an unidentified aquatic creature, prompting Chuck to return to shore without the radio.\n\nRealizing that they are stranded, the remaining eight people aboard the ship decide that survival is their primary goal and begin to explore the planet that they have landed on. Derna Lee (Derna Wylde) quickly loses one of the laser guns that Mike (Max Thayer) had given her, leaving the stranded individuals with one less weapon. They eventually come across a Brontosaurus, which leads them to deduce that the planet is following a similar evolutionary track as Earth, but is millions of years younger. Later, Charlotte (Charlotte Speer) determines that the plant life, especially the berries, is poisonous. After another dinosaur encounter, Lee decides that the best option is to climb the mountains and reach a higher plateau, where he believes the large creatures will be unable to reach them.\n\nDuring the ascent, Nyla (Pamela Bottaro) slips and loses the entire supply of food rations, which Lee refuses to retrieve. In a cave higher up the mountain, Vice-President of Spaceways Incorporated Harvey Baylor (Harvey Shain) discovers a nest full of eggs. After stealing an egg, Harvey is attacked and killed by a Centrosaurus. Soon after, much to ship engineer Jim's (James Whitworth) dismay, Lee decides to halt the expedition and settle at what he considers to be a defensible area. Lee expects to hold out until they are rescued, but Jim believes them to be trapped forever on the planet, and advises that they begin a new civilization. Lee triumphs and the remaining crew begin to build a defensive stockade around a cave. After several more encounters, a large Tyrannosaurus arrives and kills Derna, demolishing the stockade in the process.\n\nThe crew finally agrees with Jim that the best way to survive is to kill the predator. Their first plan, devised by Lee, is to attempt to poison the dinosaur by smearing berries on a dead Polacanthus and leave it outside of the Tyrannosaurus's lair. The plan backfires when the beast attacks from behind, killing Mike. Jim's plan is to set up large, wooden stakes and coat them in the poison, then lure the predator into them. After some initial troubles, including a fight between the T. rex and Rhedosaurus, the plan works, killing the Tyrannosaurus, which nearly takes Jim with it.\n\nYears pass and the survivors have set up an agricultural settlement. Chuck and Charlotte now have a son. Charlotte wonders if they will ever be rescued, to which Nyla comments that it does not seem important anymore.\n\nPRODUCTION NOTES:-\nPlanet of Dinosaurs was filmed on a significantly limited budget. Most of the budget went towards the special effects, particularly the significant amount of stop motion dinosaurs, which would later win it a Saturn Award in 1980. Including among the dinosaurs was a model that paid homage to Ray Harryhausen's Rhedosaurus from The Beast from 20,000 Fathoms. Since most of the budget had been spent creating the stop motion effects, all of the actors had to sign partial deferments for their contracts and at least one actress (Derna Wylde) claims that she never received the balance of what was owed to her. In addition, the low budget was reflected in many of the props. The &quot;fermented berry juice&quot; used in the film was grape Kool-Aid, but the shoddy props made it taste &quot;like liquid cardboard.&quot; Filming took place in the Vasquez Rocks area of California's desert, in an area previously used to film several episodes of Star Trek: The Original Series.\n\nPlanet of Dinosaurs is registered as copyright to Deathbeast Productions, in the United States Copyright Office database. Works published after 1978 do not need a copyright notice displayed to be considered copyright, so long as there is a registration in the Copyright Office database.\nReception\n\nThe film won the 1980 Saturn Award, presented by the Academy of Science Fiction, Fantasy &amp; Horror Films, in the &quot;Best Film Produced for Under $1,000,000&quot; category, taking specific note of its stop motion effects. Given the nature of the film and the era in which it was released, there were no contemporary reviews of the film. The Bad Movie Report published a review in 2000, calling the film a &quot;sad little wanna-be&quot;, citing the dinosaurs and stop motion animation as the best aspects of the film and giving it 1.5 &quot;stars&quot; out of 5.\n\nThe film garnered more attention upon its first DVD release in 2001, all of it praising the stop motion animation as the most significant and memorable aspect of the movie. The film, released with no additional extra features, was given a grade of &quot;C+&quot; by DVD-rating site Digital Monster Island, while Digital Retribution gave it 2 stars out of 5.[9] Allmovie gave it 2 stars out of 5 as well, and the film maintains a rating of 4.3 out of 10 on the Internet Movie Database. It was released on DVD by Retromedia Entertainment on September 25, 2007 as a &quot;30th Anniversary Edition&quot; in widescreen format and was initially mislabeled as the &quot;20th Anniversary Edition.&quot; It contains bonus features unlike the first DVD release.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate: 4514 kbps\nVideo Resolution: 720x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec:  AC3\nAudio Bitrate: 448kb/s CBR 48000 Hz\nAudio Streams: 6\nAudio Languages: English\nRunTime: 84 mins\nSubtitles: NONE\nRipped by: Trinidad [DDR]   \nDuration: 84 mins","torrent":{"xt":"urn:btih:63118062953a55c51f1e6bc762142e109aacf08e","amp;dn":"Planet+of+Dinosaurs+%281978%29+DVD+-+James+Whitworth%2C+Pamela+Bottaro","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63118062953a55c51f1e6bc762142e109aacf08e","infoHashBuffer":{"type":"Buffer","data":[99,17,128,98,149,58,85,197,31,30,107,199,98,20,46,16,154,172,240,142]},"announce":[],"urlList":[]}}