{"title":"The Inquisition; Religious Persecution - Collection 8","uid":14616485,"size":232222853,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6311a92b356de7a92be10cd0f52489b155c593ac&amp;dn=The+Inquisition%3B+Religious+Persecution+-+Collection+8&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"moman73","files":28,"time":1463201989,"description":"The Inquisition; Religious Persecution - Collection 8:\r\n\r\nWe have 28 titles here:\r\n\r\n-  Aposoles &amp; Ablgren - The Inquisition of Francisca; a Sixteenth-Century Visionary on Trial (2005)\r\n\r\n-  Audisio - The Waldensian Dissent; Persecution and Survival, c. 1170-c. 1570 (1999)\r\n\r\n-  Baer - A History of the Jews in Christian Spain; Vol. I, from the Age of Reconquest to the Fourteenth Century (2001)\r\n\r\n-  Baer - A History of the Jews in Christian Spain; Vol. II, from the Fourteenth Century to the Expulsion (2001)\r\n\r\n-  Caravale - Forbidden Prayer; Church Censorship and Devotional Literature in Renaissance Italy (2011)\r\n\r\n-  Carr - Blood and Faith; the Purging of Muslim Spain (2009)\r\n\r\n-  Forrest - The Detection of Heresy in Late Medieval England (2005)\r\n\r\n-  Garcia-Arenal &amp; Wiegers (Eds.) - The Expulsion of the Moriscos from Spain; a Mediterranean Diaspora (2014)\r\n\r\n-  Givens - Judging Maria De Macedo; a Female Visionary and the Inquisition in Early Modern Portugal (2011)\r\n\r\n-  Harris - From Muslim to Christian Granada; Inventing a City's Past in Early Modern Spain (2007)\r\n\r\n-  Harvey - Muslims in Spain, 1500 to 1614 (2005)\r\n\r\n-  Hunter - Heresy in Transition; Transforming Ideas of Heresy in Medieval and Early Modem Europe (2005)\r\n\r\n-  Kamen - The Spanish Inquisition; a Historical Revision (2014)\r\n\r\n-  Lea - A History of the Inquisition of the Middle Ages, Vol. 1 (1888, 2010)\r\n\r\n-  Lea - A History of the Inquisition of the Middle Ages, Vol. 2 (1888, 2010)\r\n\r\n-  Lea - A History of the Inquisition of the Middle Ages, Vol. 3 (1888, 2010)\r\n\r\n-  Matthews &amp; Stewart - Warriors of Christendom; Charlemagne - El Cid - Barbarossa - Richard Lionheart (1988)\r\n\r\n-  Mayer - The Roman Inquisition; a Papal Bureaucracy and its Laws in the Age of Galileo (2013)\r\n\r\n-  McGlynn - Kill Them All; Cathars and Carnage in the Albigensian Crusade (2015)\r\n\r\n-  Monter - Frontiers of Heresy; the Spanish Inquisition form Basque Lands to Sicily (1990)\r\n\r\n-  Mulsow &amp; Popkin (Eds.) - Secret Conversions to Judaism in Early Modern Europe (2004)\r\n\r\n-  Murphy - Conscience and Community; Revisiting Toleration and Religious Dissent in Early Modern England and America (2001)\r\n\r\n-  Norton - In the  Devil's Snare; the Salem Witchcraft Crisis of 1692 (2012)\r\n\r\n-  O'Shea - The Friar of Carcassonne; Revolt Against the Inquisition in the Last Days of the Cathars (2011)\r\n\r\n-  Pavlac - Witch Hunts in the Western World; Persecution and Punishment from the Inquisition Through the Salem Trials (2009)\r\n\r\n-  Rahn - Crusade Against the Grail; the Struggle between the Cathars, the Templars, and the Church of Rome (2006)\r\n\r\n-  Roth - Conversos, Inquisition, and the Expulsion of the Jews from Spain (2002)\r\n\r\n-  Sullivan - The Inner Lives of Medieval Inquisitors (2011)","torrent":{"xt":"urn:btih:6311a92b356de7a92be10cd0f52489b155c593ac","amp;dn":"The+Inquisition%3B+Religious+Persecution+-+Collection+8","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6311a92b356de7a92be10cd0f52489b155c593ac","infoHashBuffer":{"type":"Buffer","data":[99,17,169,43,53,109,231,169,43,225,12,208,245,36,137,177,85,197,147,172]},"announce":[],"urlList":[]}}