{"title":"Fedora 22 Workstation Live [i686, x86-x64] 2xDVD - AppzDam","uid":11981216,"size":2830106770,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:6338fa3909ce051ae4380f0f480e238b1e51dafe&amp;dn=Fedora+22+Workstation+Live+%5Bi686%2C+x86-x64%5D+2xDVD+-+AppzDam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AppzDam","files":3,"time":1433219872,"description":"Introduction of release Linux-distribution Fedora 22. To download the available 32-bit and 64-bit assembly products Fedora Workstation , Fedora Server and Fedora Cloud, as well as a set of &quot;spin&quot; c Live-assemblies desktop environments KDE, Xfce, LXDE, MATE-Compiz and SOAS (Sugar on a Stick). Additionally, the image comes to Docker and assembly for a variety of devices with processors ARM. In addition, the image comes to Docker and assembly for a variety of devices with processors ARM\n\nWhat's New :\n\nRelease remarkable transition to the package manager DNF, using the default server assembly file system XFS, transfer the login screen on Wayland, delivery KDE Plasma 5 and Xfce 4.12. Besides formation of the spin lab-assemblies in which trained specialized versions for distribution in research, testing, safety, games, design and creation of multimedia content, composition and processing of music, the development of robots.\n\nReplacing YUM package manager for DNF, has significantly higher rate work, low memory consumption and better management of dependencies. DNF is an offshoot of Yum 3.4, was created to develop some new ideas, such as the use of the library as a backend hawkey to resolve dependencies. C point of view of command line options and configuration files, DNF is almost fully compatible with YUM, the main changes incorporated in its internal architecture.\n\ndnf-yum package provides an automatic redirect to the dnf to ensure full compatibility with yum. This yum left in the distribution, but renamed the yum-deprecated. To resolve the dependencies involved in the DNF SAT solver, implemented in the library libsolv (hawkey acts as an add-on libsolv), established within the framework of openSUSE. To extend the functionality DNF provides a fixed API for plug-ins and integration with other applications, such as the installer Anaconda. \nThe distribution server assembly by default enabled filesystem XFS, which allows you to create a larger storage and is considered a better option for server systems. Ext4 support is fully preserved. \nThe login screen is translated by default to use Wayland. The login screen is quite separate system, so moving it to Wayland in the first place, developers will be able to completely ensure that no pitfalls and undetected errors without affecting the applications and the desktop. GNOME user environment by default will continue to work with the X-server, though a full session on the basis of Wayland is provided as a standard option. Go to Wayland default planned for Fedora 23, \nto control input devices in Wayland and X11 enabled library libinput; \ninvolved in the distribution prerelease desktop GNOME 3.16. Because of the improvements can be noted a new theme GNOME Shell, revised notification system output stabilized and modified support Wayland, streamlined interface file manager Nautilus, support for Google Drive; \nachievements included to reduce energy consumption. Added tool to test battery life of the battery; \nThe interface for managing the installation of applications GNOME Software adds support for working with third-party components such as multimedia codecs for GStreamer and fonts \nImproved themes for Qt4 and Qt5, allowing to provide seamless integration with GNOME Qt-applications and programs of KDE, the interface that will be unified with applications GTK. \nImproved GNOME Terminal, including the ability to output the notification provided at the end of long-running tasks such as compilation, which will not be distracted, constantly looking at the terminal to assess the status of completion of the work; \nin tool to automatically send reports of problems ABRT (Automatic Bug Reporting Tool) improved organization output tray and provided enhanced means comply with privacy and control of information sent outside; \nSpin Fedora KDE default translated into environment KDE Plasma 5. Fedora Xfce Spin updated to Xfce 4.12 ; \nThe Rolekit toolkit adds support for the deployment and management of server &quot;roles&quot; based on the database PostgreSQL. Under certain server role implied functionality, which provides a set of work packages (for example, a mail server may require the installation of packages with IMAP and SMTP servers). Rolekit allow time to install and configure all of the packages required to implement the service. \nUpdated Cockpit, web-based interface to configure and monitor one or more servers. Allows administrators to manage storage, running services, analyze logs, inspect and manage containers Docker, including track resource consumption and set limits. \nTo the Editor for the cloud include the latest versions of each package rpm-ostree and rpm-ostree-toolbox, with which you can generate their own stuffing base environment Atomic, containing a set of packages. The structure also includes command-line utilities for managing containers surrounded by Atomic Host and renovation of filling Atomic Host.\n\nRecall that in the framework of developing the concept of minimalist Atomic OS for launching an insulated container, produced and managed using tools Docker. Provided Atomic basic environment (Atomic Host) contains only a minimal set of components (systemd, journald, docker, geard, etc.) required to run and manage an insulated container. To update the system environment uses a technology Atomic OSTree, in which system image atomically updated from Git-like storage, allowing you to apply version control methods to the components of the distribution (for example, you can quickly roll back the system to the previous state). RPM-packages in the repository are broadcast OSTree with a special layer rpm-ostree. \nProvided the image of Fedora Atomic Host and Fedora Cloud tools for use with Vagrant, which can be used for rapid deployment of virtual environments in systems based virtualization KVM and VirtualBox. \nUpdated images that It can be used as a basis for launching applications in containers Docker. The distribution includes a package fedora-dockerfiles, which in combination with a special git-repository allows you to create build applications based on container filling base Fedora 22 packages and more;\n\nPresented Tunir, new lightweight continuous integration tool, aimed at accelerating the test images for the cloud ; \nEngaging Linux 4.0 kernel and a set of compilers GCC 5.1","torrent":{"xt":"urn:btih:6338fa3909ce051ae4380f0f480e238b1e51dafe","amp;dn":"Fedora+22+Workstation+Live+%5Bi686%2C+x86-x64%5D+2xDVD+-+AppzDam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6338fa3909ce051ae4380f0f480e238b1e51dafe","infoHashBuffer":{"type":"Buffer","data":[99,56,250,57,9,206,5,26,228,56,15,15,72,14,35,139,30,81,218,254]},"announce":[],"urlList":[]}}