{"title":"Hilarion Alfeyev St Matthew Passion","uid":9225120,"size":107797110,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:63d17fb17593f90b1289f4d88647effbf33eeb89&amp;dn=Hilarion+Alfeyev+St+Matthew+Passion&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"orthodox.believer","files":48,"time":1384999038,"description":"St Matthew Passion is a monumental work, composed for soloists, choir and orchestra.\n\nThis composition combines a traditional approach with a clarity and originality of presentation. It is the work of a professional composer, seeking inspiration in the traditions of church music of Eastern and Western Christianity, a composer who has also, in many years service as a priest, brought the word of God to His people. This composition is unique in the history of contemporary music, in its musicality, its variety and coherence, and its emotional and spiritual depth.\n\nThe work is based on the description of the passion and death of Christ as told in the Gospel according to St Matthew. This story is divided into sixteen parts and performed in Russian in the style usually adopted for the reading of the Gospel in Orthodox churches. Excerpts from the Gospel are interspersed with music recitative, choruses, fugues and arias the text of which is mostly taken from the services held by Orthodox Christians during Holy Week. Occasionally the text has been simplified or otherwise adapted by the composer. Some pieces are for orchestra alone, others for choir alone, while in many both appear, complementing each other. \nThe work is divided into four thematic parts, each of which has its own composition, including various pieces for choral, orchestral and solo performance. Within each part, the pieces are performed without interruption.\nEach part contains a fugue, which constitutes one of the most important structural elements of the work. \n\nBeautiful and powerful music, full of energy and dynamism. Performances in Moscow (27 March 2007), Rome (29 March 2008), Melbourne (29 September 2007) and Toronto (25 October 2008) received standing ovation.\n\nBishop Hilarion Alfeyev studied composition at Moscow Gnessins School of Music and subsequently at the Moscow State Conservatory. In 1987 he was ordained priest, and since 2002 he is as a bishop of the Russian Orthodox Church. He is the author of more than 600 publications, including 20 books which have been translated into major European languages. His musical compositions include the Divine Liturgy (2006) and All-Night Vigil (2006) for the choir a capella, the Christmas Oratorio for soloists, boys choir, mixed choir and symphony orchestra (2007), A Song of the Ascent , a choral symphony on the Psalms (2008). Bishop Hilarion has been living and working in Austria since 2003.\n\nVladimir Fedosseyev is the foremost conductor of symphony orchestras in Russia and one of the best in the world. Since 1974 he has been the director and chief conductor of the Tchaikovsky Great Symphony Orchestra. From 1997 to 2005 he led the Vienna Symphony Orchestra and he continues to respond to requests to conduct many other symphony orchestras on an occasional basis. His repertoire includes all major works for symphony orchestra, oratorio, opera and ballet.\n\nThe Tchaikovsky Great Symphony Orchestra was created in 1930 as the leading symphony orchestra of the Soviet Union. Its conductors have included some of the world s finest, including Aleksandr Orlov, Nikolai Golovanov, Alexander Gauk, and Gennadiy Rozhdyestvenskiy. The orchestra s finest hour came with the appointment of Vladimir Fedoseyev, who established the distinctive emotional signature of the orchestra and establishing it as a household name the world over. The orchestra was the first to perform works by such famous Russian composers as Prokofiev, Myaskovsky, Khachaturian and Sviridov and brought to life many wonderful pieces by contemporary composers.","torrent":{"xt":"urn:btih:63d17fb17593f90b1289f4d88647effbf33eeb89","amp;dn":"Hilarion+Alfeyev+St+Matthew+Passion","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63d17fb17593f90b1289f4d88647effbf33eeb89","infoHashBuffer":{"type":"Buffer","data":[99,209,127,177,117,147,249,11,18,137,244,216,134,71,239,251,243,62,235,137]},"announce":[],"urlList":[]}}