{"title":"The Weird Torrent","uid":4829606,"size":33473266,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:647cbd8914d8031326224f0bf1a508a42fc1a723&amp;dn=The+Weird+Torrent&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"madziar","files":8,"time":1239080348,"description":"There are many torrents containing strange and unusual books out there. This one is different in that it contains files not part of the usual ones replicated time after time in these things; instead, it contains strange things that are usually looked at as interesting in their own right by people who are afficionadoes of the weird, with some being treated much more seriously by researchers than many of the other strange books out there. Then we have the instructions on how to contact Venus by telepathy. \n\nHere then, is a manifest of what exactly is included:\n\nContents of the Weird Torrent: \n\nThe Ether Ship Mystery, about the connection between the occult and how UFOs are powered.\n\nSecrets of Higher Contact by Michael X, about how to achieve psychic contact with aliens.\n\nMichael X Contact instructions, short file about how to consecrate special stone to use to contact aliens. \n\nJessup_Case_for_the_UFO_Annotated, a rare copy of a book by a scientist theorizing about how UFOs work that was annotated by people suspected of being aliens themselves. Known as the &quot;Varo edition&quot;. \n\nSecret Cipher of the UFOnauts, connections between the occult and UFOs, written by a sympathetic source. \n\nSecret Rituals of the Men in Black, the sequel to Secret Cipher, details human origins, high grade masonry, more occult connections, the idea that Men in Black may be ascended masters. \n\nThe black box and other psychic devices, all about radionics and psionics, in particular how to use radionic devices to amplify occult power.\n","torrent":{"xt":"urn:btih:647cbd8914d8031326224f0bf1a508a42fc1a723","amp;dn":"The+Weird+Torrent","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"647cbd8914d8031326224f0bf1a508a42fc1a723","infoHashBuffer":{"type":"Buffer","data":[100,124,189,137,20,216,3,19,38,34,79,11,241,165,8,164,47,193,167,35]},"announce":[],"urlList":[]}}