{"title":"Matchbox Twenty - Unwell","uid":4724385,"size":131592196,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:66753cb4c750a81ffe38865865c391711c7de7c2&amp;dn=Matchbox+Twenty+-+Unwell&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"2nafish","files":-1,"time":1234670500,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Unwell&quot; is the second single from Matchbox Twenty's third album, More Than You Think You Are. It was written by Matchbox Twenty lead singer Rob Thomas. It was very successful on the radio, spending 20 weeks at the top of the U.S. Billboard Adult Top 40 chart, two weeks atop the Billboard Hot Adult Contemporary Tracks chart, as well as reaching #5 on the Billboard Hot 100 chart. The song was nominated for Grammy Award in 2004 for Best Pop Performance by a Duo or Group with Vocal.\n\nThe song is about a person who claims to not be crazy even though they're suffering from various occurrences that could lead them to be labeled as such. Rob Thomas states on the live DVD Show: A Night in the Life of Matchbox Twenty that he wrote the song to be a metaphor for humanity in general, a song for people who are &quot;screwed up and feel alone like that. We all feel a little screwed up sometimes... you're not alone.&quot; This song is a staple of adult contemporary stations even years after its release. The song also was the second most played song in the United States in 2003 according to Billboard magazine. The music video was #1 on VH1's Top 40 Videos of 2003.\n\nThe song's music video, directed by Meiert Avis, mostly features Thomas seeing various odd occurrences throughout, all the while singing along to the song. The rest of the band only appears in cameos, notably when Thomas boards a subway and they are seen in the background. The appearance of the other band mates is also altered like most of the video (their noses are rather large). The rest of the band is also seen at the end of the video gathered in Thomas' room, and each takes their turn waving goodbye to the camera before Thomas does so as well at the end of the video.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:66753cb4c750a81ffe38865865c391711c7de7c2","amp;dn":"Matchbox+Twenty+-+Unwell","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66753cb4c750a81ffe38865865c391711c7de7c2","infoHashBuffer":{"type":"Buffer","data":[102,117,60,180,199,80,168,31,254,56,134,88,101,195,145,113,28,125,231,194]},"announce":[],"urlList":[]}}