{"title":"HELLFJORD - Episode 1 w/English subs","uid":7942826,"size":347963616,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:66f39e132e428ed5396380506c4af0aaf75b2696&amp;dn=HELLFJORD+-+Episode+1+w%2FEnglish+subs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"manxspike","files":-1,"time":1356038251,"description":"Seven of Norway's finest directors team up for writer/producer Tommy Wirkola's fusion of HOT FUZZ and TWIN PEAKS. A seven part TV series from the director of DEAD SNOW.\n\nFull Description:\n\nPlease do not ask Sergeant Salmander about Gunnar. He loved that horse dearly and nobody feels worse about what happened to Salmander's noble steed than Salmander himself. Yes, he understands that there were children present at the Independence Day parade who may require significant, long term counseling to come to terms with what they witnessed that fateful day but still, he feels bad, okay? Sergeant Salmander's journey may begin with a horse in Oslo, but it ends with a posting in HELLFJORD - a tiny town in the ass end of Norway where Salmander will serve as the district sheriff for the three month notification period  labor law requires before he is summarily fired from the police force. Can he save his job by doing an exceptionally good job during his months in the far north? Probably not, but he intends to give it all he's got.\n\nThe distinctive - and distinctively odd - world of HELLFJORD could only have come from the mind of one man, writer-producer Tommy Wirkola (DEAD SNOW). The seven episode television series introduces a world just slightly out of synch with the one you may know - a world where family restaurants double as strip clubs, the average age is sixty seven and the sun never, ever goes down. Wirkola and his all star team of directors - among them YOU SAID WHAT helmer Patrik Syversen and COLD PREY's Roar Uthaug - have created a world that falls into the sweet spot between HOT FUZZ and TWIN PEAKS.","torrent":{"xt":"urn:btih:66f39e132e428ed5396380506c4af0aaf75b2696","amp;dn":"HELLFJORD+-+Episode+1+w%2FEnglish+subs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66f39e132e428ed5396380506c4af0aaf75b2696","infoHashBuffer":{"type":"Buffer","data":[102,243,158,19,46,66,142,213,57,99,128,80,108,74,240,170,247,91,38,150]},"announce":[],"urlList":[]}}