{"title":"Coast to Coast AM March 10 2013","uid":8243363,"size":58334099,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:670e9709605efbc31acc80a319ae6b39c9fd6b06&amp;dn=Coast+to+Coast+AM+March+10+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"runcdfirst","files":5,"time":1363007324,"description":"#we.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t03-10-13\nHost: \tIan Punnett\nGuests: \tBrian Tuohy\n\nCiting directly from official US govt. documents, author Brian Tuohy joined Ian Punnett (Twitter) to divulge how a set of laws and procedures are waiting to spring into action when a national emergency is declared. Without congressional approval, the President can issue an &quot;executive order&quot; to enact a variety of extreme measures, including the rationing of energy, food and water, the control of the airwaves and transportation outlets, as well as the possible confiscation of people's personal vehicles and electromagnetic devices such as cell phones and computers, he outlined. In the event of such an emergency, citizens can also be forced to work on projects the government deems necessary, he continued.\n\nWhile the US has a number of ongoing national emergencies already declared, they are mainly related to security threats from foreign countries such as Iran, Somalia, Syria, and North Korea, Tuohy explained, adding that the declarations in these cases basically serve as pretexts for war or military actions that could be funded without congressional budget constraints, should the need arise. While the powers of executive orders weren't delineated into the Constitution, Congress hasn't acted to remove them, and thus there is kind of a &quot;slippery slope,&quot; as to how these powers might be used, he pointed out.\n\nTuohy noted that in some cases it makes sense to have certain executive orders in place-- such as if a foreign country suddenly pointed a nuclear missile at the US, there wouldn't be time to call Congress together to make a response. &quot;The irony with it is,&quot; he remarked, &quot;is that many times the Presidents... are going to act outside of the constitutional bounds to respond to an emergency to supposedly ensure constitutional government.&quot; He also detailed the US' continuity of government plans-- each individual federal department supposedly has three different secret relocation sites. Some of these are said to involve well-stocked massive underground facilities, possibly set up to hold 2,000 people for up to 6 months to a year, he said, and this has contributed to the idea of a &quot;shadow government.&quot;\nWebsite(s):\n\n    disastergovernment.com\n\nBook(s):\n\n    Disaster Government: National Emergencies, Continuity of Government and You\n    The Fix is In\n\n","torrent":{"xt":"urn:btih:670e9709605efbc31acc80a319ae6b39c9fd6b06","amp;dn":"Coast+to+Coast+AM+March+10+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"670e9709605efbc31acc80a319ae6b39c9fd6b06","infoHashBuffer":{"type":"Buffer","data":[103,14,151,9,96,94,251,195,26,204,128,163,25,174,107,57,201,253,107,6]},"announce":[],"urlList":[]}}