{"title":"The MOST important book on the planet","uid":3600548,"size":1723033,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:67ae38869c66650c6078c4e270227088798909ed&amp;dn=The+MOST+important+book+on+the+planet&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ya2sin","files":1,"time":1169390308,"description":"People are saying this is the MOST important book on the planet. Is it? You decide.\n-----------------------------------------------------------------------------------\n\nMost people wonder at the purpose of life. Is there a mission or destiny for each of us?\n\nReconciling the claims of science with those of religion often leaves the rational mind confused.\n\nWhether you are alive to these problems or not &quot;The Way Home&quot; is for you. Even if you go through life without considering such matters this book is still for you.\n\nIf you are puzzled, here you will find the answers.\n\nIf you are asleep to the meaning of life this book will rouse you with a jerk for it is dynamic... it?s highly revealing... it is vital.\n\nIt is both unique and exhilarating. It offers an abundance of food for thought and is a tremendous challenge. It has a message too!\n\nA golden message for each one of us, young or old.&quot;\n\nThe Way home or face The Fire explains the Truth about God; the True interpretation of The Holy Bible and The Holy Koran; the True reasons why what is happening now is happening and what is going to happen in the very near future in the world. It also explains the consequences involved in taking each of the two paths - The Way home or the way to The Fire.","torrent":{"xt":"urn:btih:67ae38869c66650c6078c4e270227088798909ed","amp;dn":"The+MOST+important+book+on+the+planet","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67ae38869c66650c6078c4e270227088798909ed","infoHashBuffer":{"type":"Buffer","data":[103,174,56,134,156,102,101,12,96,120,196,226,112,34,112,136,121,137,9,237]},"announce":[],"urlList":[]}}