{"title":"Behind Closed Doors - Radio Drama Trilogy","uid":9041570,"size":126156343,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:68077e70dc33d0a0e98f74d26e87af33212ff0c0&amp;dn=Behind+Closed+Doors+-+Radio+Drama+Trilogy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Pigman58","files":3,"time":1381640158,"description":"Radio Drama - 3 x 45 mins\n\nThree linked dramas, all featuring barrister Rebecca Nyman, who defends 3 people in three different types of tribunal. In none of these instances is the case clear cut and none of those she represents evince a great deal of sympathy, having brought misfortune on themselves and none have a perfect, happy ending, whether Rebecca has been successful or not.\n\n1) One of the Lads - A high flying policewoman claims unfair dismissal from the (fictional) East Yorkshire Police. She claims sexist bullying and her gender were why she was selected for redundancy, but she was not above dirty tricks herself.\n\n2) Tilting the Odds - A vet (who for some reason the author makes a Dutchman called Falco, as per the Roman detective) is accused of doping a race horse, and risks being struck off as a vet. He claims the trainer was responsible, but did the trainer bully him into doing it?\n\n3) Safe House - Akmed Hammen has been charged with no offence, but is suspected of terrorist activities and is under a strict curfew and other, restrictions. He claims he is a family man and an accountant. Rebecca must represent his interests at a panel which is assessing his appeal against the restrictions. Part of that appeal though is held in secret and Rebecca cannot consult with Akmed or tell him or his lawyer anything that is said once the secret part of the tribunal begins.\n\nAn unusual and interesting trilogy.","torrent":{"xt":"urn:btih:68077e70dc33d0a0e98f74d26e87af33212ff0c0","amp;dn":"Behind+Closed+Doors+-+Radio+Drama+Trilogy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68077e70dc33d0a0e98f74d26e87af33212ff0c0","infoHashBuffer":{"type":"Buffer","data":[104,7,126,112,220,51,208,160,233,143,116,210,110,135,175,51,33,47,240,192]},"announce":[],"urlList":[]}}