{"title":"Full.Mojo.Rampage.Early.Access-P2PGAMES","uid":8831139,"size":298151869,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:69ad205d80096749ee79c7addd7d83a58bb9ce96&amp;dn=Full.Mojo.Rampage.Early.Access-P2PGAMES&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AN0NYMOUS142857","files":-1,"time":1376984815,"description":"Full Mojo Rampage is a rogue-like game that takes place within the confines of the Voodoo reality. In this realm only the most powerful rites and powers can provide a safeguard against evil. Dying is not the end, only the beginning to becoming a stronger voodoo soul!\n\nThe game includes several multiplayer cooperative and competitive modes to play with friends.\nKey Features\nRandomly-generated items and levels in beautiful 3D. Not two playthroughs will be the same.\nImprove your character by leveling up and buying voodoo pins that you can use and upgrade to receive special bonuses.\nOnline Co-op: Up to 4 players can play together each campaign.\nMultiplayer VS modes: Play online with up to 8 players in fiersome battles. (Current modes available: deathmatch, team deathmatch, Capture the Flag, King of Mojo). Level up and customize your character to show your friends who is the best!\nTons of items and unlockables: masks, pins, mojos and power-ups.\nUnique  class  system that revolves around choosing a voodoo god each with their own special powers and attributes.\n\n\nThe Quests\nWhen you start a new game you can select which quest you want to do. Each quest has a different story, goal and setting. The quest map and each individual level is randomly generated, so you can replay the game and be challenged each time. In the current version, there is only one quest available: Baron Samedi opened some portals by mistake (he was a bit drunk!) and needs your help to close them again.\nEach quest will have a different set of achievements with unique rewards (new masks, gold, medals). These are not working in the current version, but will be in the next weeks.\nCustomizing Your Character\nAfter choosing a quest you will be able to customize your character.\nIn this screen you can choose a mask, a parent god and the voodoo pins you want to carry.\nEach god has a set of spells that define how you play the game. There are currently only three unlocked gods. Expect new gods and more deep mechanics in the future.\nVoodoo Pins are very important. They provide unique bonuses that will help you in the game. At the beginning you wont have any pins unlocked, but by playing the game you will gain gold that you can use you purchase and upgrade these pins. The number of pins you can choose will also increase with levels e.g. 1 pin at level 1, 2 pins at level 3 and 3 pins at level 5.\nIn this menu you can also level up your character once you have enough experience. Experience is gained by exploring, progressing through the levels and doing challenges.\nThe Dungeon Map\nThe dungeon map is randomly generated. The icons represent cemeteries, swamps, bosses, challenges, vendors and shrines.\nThere are many challenges that are quite fun and have some surprises, so make sure to visit all the &quot;?&quot; icons as those are special events for your current game.\nGameplay\nEach level is randomly generated with enemies and secrets. Levels are filled with equals parts of action and exploration.\nSome levels have doors to vendors and god shrines.\n\nSystem Requirements\nMinimum:\nOS: Windows XP SP3, Windows Vista, Windows 7, Windows 8\nProcessor: Intel Core 2 Duo or AMD equivalent or better\nMemory: 2 GB RAM\nGraphics: Nvidia Geforce 8800GT or ATI Radeon HD 3870 or better\nDirectX: Version 9.0c\nHard Drive: 1 GB available space\nSound Card: DirectX compatible Sound Card","torrent":{"xt":"urn:btih:69ad205d80096749ee79c7addd7d83a58bb9ce96","amp;dn":"Full.Mojo.Rampage.Early.Access-P2PGAMES","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69ad205d80096749ee79c7addd7d83a58bb9ce96","infoHashBuffer":{"type":"Buffer","data":[105,173,32,93,128,9,103,73,238,121,199,173,221,125,131,165,139,185,206,150]},"announce":[],"urlList":[]}}