{"title":"Forks Over Knives PT BR (2011)","uid":7743907,"size":1057131060,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:69bf0e8a79cb0a5b73ea8365d94dcc7bb6ff2597&amp;dn=Forks+Over+Knives+PT+BR+%282011%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xvatox","files":-1,"time":1350703499,"description":"Forks Over Knives (2011)\n\nAudio: English\nSubtitle: Portuguese (BR)\n\nFormat: .AVI\n\nForks over Knives is a 2011 American documentary film directed by American independent filmmaker Lee Fulkerson. Through an examination of the careers of American physician Caldwell Esselstyn and professor of nutritional biochemistry T. Colin Campbell, the film advocates a whole foods, plant-based (vegan) diet as a means of combating a number of diseases. It suggests that &quot;most, if not all, of the degenerative diseases that afflict us can be controlled, or even reversed, by rejecting our present menu of animal-based and processed foods.&quot; [1]\n\nThe film also provides an overview of the 20-year China-Cornell-Oxford Project that led to Professor Campbell's findings, outlined in his book, The China Study (2005) in which he suggests that coronary disease, diabetes, obesity, and cancer can be linked to the Western diet of processed and animal-based foods (including all dairy products). [1]\n\nCast\n\n    Dr. Caldwell Esselstyn Jr.\n    T. Colin Campbell, Ph.D\n    Dr. Neal Barnard\n    Junshi Chen, Ph.D.\n    Connie B. Diekman, MEd, RD, FADA\n    David Klurfeld, Ph.D.\n    Dr. Matthew Lederman\n    Dr. Alona Pulde\n    Doug Lisle, Ph.D.\n    Dr. Terry Mason\n    Dr. John A. McDougall\n    Pam Popper, N.D.\n    Rip Esselstyn\n\nCritical reception\n\nAs of September 16, 2012, on the review aggregator Rotten Tomatoes, Forks Over Knives received a rating of 59% (22 Fresh, 15 Rotten), based upon 37 reviews. Under the &quot;Top Critics&quot; category Forks Over Knives received a rating of 76% (13 Fresh, 4 Rotten).[3] On Metacritic, the film had an average score of 57 out of 100, based on 18 reviews, indicating &quot;mixed or average&quot; reviews.[4] Roger Ebert of the Chicago Sun-Times gave the film three out of four stars and states: &quot;here is a film that could save your life.&quot; He also suggests that &quot;Forks Over Knives is not subtle. It plays as if it had been made for doctors to see in medical school.&quot;[5] Loren King of The Boston Globe gave the film three out of four stars and suggests that, &quot;what An Inconvenient Truth did for global warming, Lee FulkersonÎ“Ã‡Ã–s persuasive documentary does for a vegan diet.&quot; [6] Carrie Rickey of The Philadelphia Inquirer gave the film three out of four stars and describes it as &quot;an earnest and fact-filled work of food evangelism.&quot; [7] Sean O'Connell of The Washington Post gave the film two out of four stars and argues that it is &quot;an interesting and informative health lecture thatÎ“Ã‡Ã–s sandwiched into a dry, repetitive documentary&quot; and said that &quot;it's desperately in need of charisma, humor or personality to balance the steady stream of scientific facts weÎ“Ã‡Ã–re asked to absorb.&quot;[8]\t\t","torrent":{"xt":"urn:btih:69bf0e8a79cb0a5b73ea8365d94dcc7bb6ff2597","amp;dn":"Forks+Over+Knives+PT+BR+%282011%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69bf0e8a79cb0a5b73ea8365d94dcc7bb6ff2597","infoHashBuffer":{"type":"Buffer","data":[105,191,14,138,121,203,10,91,115,234,131,101,217,77,204,123,182,255,37,151]},"announce":[],"urlList":[]}}