{"title":"THE BEST OF ' 60 and ' 70 - part 109","uid":4336298,"size":333455820,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:6a9ef024e703a15ec7ead59a10448900d6ba0325&amp;dn=THE+BEST+OF+%5C%27+60+and+%5C%27+70+-+part+109&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pupovacandrej","files":8,"time":1218330773,"description":"                     \n                       PART  109\n\n\n               BONEY M.  -  Daddy Cool  (1976)\n               ERUPTION  -  I Can&amp;#039;t Stand the Rain  (1977) \n               BONEY M -  Rasputin  (1978)\n               EBONY - Everything Will Turn Out Fine  (1980)\n               SARAGOSSA BAND  - Ginger red  (1980)\n               ERUPTION  -  Runaway  (1981)\n\n\n              &quot;Daddy Cool&quot; is a song recorded by disco band Boney M. and included on their debut album &quot;Take The Heat Off Me&quot;. It was a 1976 hit and a staple in disco music and Boney M.&amp;#039;s first UK hit. It reached #6 in the UK charts and #65 in the United States Billboard Hot 100. The single also topped the German charts.It was the second Boney M. single, released in May 1976 without making any major impact at first. It wasn&amp;#039;t until a spectacular performance in Musikladen in September that the group became their commercial breakthrough, topping most European charts, reaching #6 in the UK and even charting in the US.\n               After a minor hit single with &quot;Party Party&quot;, cover of &quot;I Can&amp;#039;t Stand the Rain&quot; from their first album  &quot;Eruption&quot; (1977) was a big hit, reaching number five in the UK Singles Chart, and number 18 in U.S. Billboard Hot 100. It was followed by the second album &quot;Leave a Light&quot; towards the end of 1978 but the first single &quot;I&amp;#039;ll Keep a Light in My Window&quot; was a surprising flop. Fortunately, the second single, &quot;One Way Ticket&quot;, restored them at the top of the charts (a UK #9 hit). The song is often mistaken for a Boney M. record.\n              &quot;Rasputin&quot; is a 1978 disco hit single by Boney M., the second single off their hugely successful album &quot;Nightflight to Venus&quot;. The song is a semi-biographical song whose subject and namesake is Grigori Rasputin, a friend and advisor of Tsar Nicholas II of Russia and his family during the early 20th century. The song variously sensationalizes Rasputin as a playboy, mystical healer, and political demiurge.The song rose to the top of the charts in Germany and Austria, and went to #2 in the United Kingdom and Switzerland. It was another number 1 hit for Boney M in Australia, providing them a second (and last) chart topper in that country (the other one being &quot;Rivers Of Babylon&quot;).Although the song was written and performed in English , it enjoyed great popularity in Russia and is credited with making Rasputin famous again there although it was omitted from the Russian pressing of the album and Boney M. were forbidden to perform the song during their 10 performances in Moscow in December 1978. \n             &quot;Runaway&quot; was a number one Billboard Hot 100 song in the spring of 1961 by Del Shannon. It was written by Shannon and keyboardist Max Crook, and became a major international hit.  It is #466 on Rolling Stone&amp;#039;s list of The 500 Greatest Songs of All Time. The Disco/Soul band Eruption covered this song in 1981 with new lead singer Jane Jochen.\n\n\n\n\n\n\n                       TOTAL LIST  \n\n\n\n\n Disco is a genre of dance-oriented music whose origins, like other genres of music, are hard to place at a single defining point.Most agree that the first disco songs were released in 1973, but some claim Manu Dibango&amp;#039;s 1972 Soul Makossa to be the first disco record. The first article about disco was written in September 1973 by Vince Aletti for Rolling Stone Magazine. In 1974 New York City&amp;#039;s WPIX-FM premiered the first disco radio show.Well-known  1970s disco performers included Evelyn &quot;Champagne&quot; King, Tavares, Chic, Bee Gees, Donna Summer, Grace Jones, Gloria Gaynor, Diana Ross, the Village People, Sylvester, The Jacksons\nand others .......\n\n\n\n         BONEY M  -  DADDY COOL  (1976)\n         DONNA SUMMER  -  I FEEL LOVE (1977)\n         ERUPTION - I CAN&amp;#039;T STAND THE RAIN  (1977)\n         A TASTE OF HONEY -  BOOGIE OOGIE   (1978)\n         CHIC - LE FREAK  (1978)\n         BONEY M  -  RASPUTIN   (1978)      \n         ROSE ROYCE - LOVE DON&amp;#039;T LIVE HERE ANYMORE  (1978)\n         GREASE  -  MEGA - MIX    (1978)\n         POINTER SISTERS  -  FIRE  (1979)\n         EBONY - EVERYTHING WILL TURN OUT FINE  (1980)\n         SARAGOSSA BAND  - GINGER RED  (1980)\n         ODISSEY - USE IT UP AND WEAR IT OUT   (1980)\n         ODISSEY -  GOING BACK TO MY ROOTS  (1981)\n         ERUPTION  -  RUNAWEY  (1982)\n         DONNA SUMMER  -  I FEEL LOVE  (2005)\n         DONNA SUMMER  -   MacARTHUR PARK  (2005)\n","torrent":{"xt":"urn:btih:6a9ef024e703a15ec7ead59a10448900d6ba0325","amp;dn":"THE+BEST+OF+%5C%27+60+and+%5C%27+70+-+part+109","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a9ef024e703a15ec7ead59a10448900d6ba0325","infoHashBuffer":{"type":"Buffer","data":[106,158,240,36,231,3,161,94,199,234,213,154,16,68,137,0,214,186,3,37]},"announce":[],"urlList":[]}}