{"title":"Law &amp; Order - SVU - Seasons 1-7","uid":8578473,"size":57546927218,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6b372a664c60434ec435c111cea885805b34dcfe&amp;dn=Law+%26amp%3B+Order+-+SVU+-+Seasons+1-7&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":5,"uploader":"Nailit","files":163,"time":1371346459,"description":"The files in this torrent are named and arranged so that XBMC will find them immediately and covers seasons 1-7\n\nLaw &amp; Order: Special Victims Unit (often abbreviated to Law &amp; Order: SVU or just SVU) is an American police procedural crime drama television series set in New York City, where it is also primarily produced. In the style of the original Law &amp; Order, episodes are often &quot;ripped from the headlines&quot; or loosely based on real crimes that have received media attention. Created and produced by Dick Wolf, the series premiered on NBC on September 20, 1999 as the first spin-off of Wolf's successful crime drama, Law &amp; Order. The show started its 14th season on September 26, 2012 and has aired 319 original episodes as of May 22, 2013.\n\nLaw &amp; Order: Special Victims Unit originally centered almost exclusively around the detectives of the Special Victims Unit in a fictional version of the 16th Precinct of the New York City Police Department. As the series progressed, additional supporting characters were added as allies of the detectives in the New York County Manhattan District Attorney's office and the Medical Examiner's office. Typical episodes follow the detectives and their colleagues as they investigate and prosecute sexually based offenses. The show starred Christopher Meloni as Detective Elliot Stabler and Mariska Hargitay as Detective Olivia Benson for its first twelve seasons until the former left the cast, unable to come to an agreement on his contract.\n\nLaw &amp; Order: Special Victims Unit has been nominated for and won numerous awards, including the 2006 Emmy for Outstanding Lead Actress in a Drama Series for Hargitay, the first Emmy to be received by a regular on any Law &amp; Order series.\n\nOn April 26, 2013, NBC renewed Law and Order: Special Victims Unit for a 15th season, which is scheduled to have 22 episodes.","torrent":{"xt":"urn:btih:6b372a664c60434ec435c111cea885805b34dcfe","amp;dn":"Law+%26amp%3B+Order+-+SVU+-+Seasons+1-7","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b372a664c60434ec435c111cea885805b34dcfe","infoHashBuffer":{"type":"Buffer","data":[107,55,42,102,76,96,67,78,196,53,193,17,206,168,133,128,91,52,220,254]},"announce":[],"urlList":[]}}