{"title":"RÃƒÂ¶yksopp - The Understanding (2005) flac","uid":5366694,"size":585450952,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6b426c5ee0467fbbb862e23ed1f69d476a55a89e&amp;dn=R%C3%83%C2%B6yksopp+-+The+Understanding+%282005%29+flac&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"narfdude","files":18,"time":1266284858,"description":"Following up the huge success of debut album Melody AM was always going to be a big ask of Norwegian duo RÃƒÂ¶yksopp. As if its astounding commercial success wasn't enough, many of its components have been played to death on TV as backing for reality, property and DIY programs, reducing its initial appeal somewhat. Anyone looking for a repeat dose of breezy ad soundtracks may have to look elsewhere this time though.\n\nHappily this works to their advantage, as the new material remains inventive and doesn't attempt to cover the same ground. The best ingredients of Melody AM are still present - cool, airy textures, frequent hints of wistful melancholy, warm infusions of synthesized chords. But this time those chords have a darker undertone, their harmonic language taking an uneasy turn.\n\nThis becomes evident in Boys, a difficult track to grasp so far, and the excellent 49 Percent, a stumbling breakbeat rhythm underpinning the lyrics &quot;I know about your little fling, how you hide your ring, you senseless thing&quot; and later, &quot;why won't you try to make this damage better?&quot;. It's fascinating to hear the duo exploring what could almost be the darker side of the Norwegian climate, all those days with very little sun, and, in their native town of Bergen, rain.\n\nDon't let that put you off, though - The Understanding doesn't require a handkerchief at all times! There are also a couple of wonderfully uplifting tracks, from the gushy single Only This Moment to the murmurings of A Beautiful Day Without You and the gorgeous lullaby that is the down tempo Dead To The World, admitting defeat to sleep as the sun comes up. Nor have the duo forsaken their knack for a good groove, Alpha Male building up to a heavier drum sound.\n\nSecond albums are never easy to bring off, but crucially RÃƒÂ¶yksopp don't seem to have been trying too hard, and nor have they made the easy mistake of recruiting starry guest vocalists just because they can. Chelonis R Jones is superb on 49 Percent, Karin Dreijer from The Knife excellent in What Else Is There?, and new vocalist Kate Havnevik on Only This Moment and Circuit Breaker.\n\nThese three add considerable weight to the cause, contributing to an emotional album that is good tochill out too on the surface, but reveals some darker secrets as it grows on the listener. RÃƒÂ¶yksopp have surpassed themselves again, and shown they are in this business for the long haul.\n\n\n\nTrack Listing \n\nCD 1 \nTriumphant\nOnly This Moment\n49 Percent\nSombre Detune\nFollow My Ruin\nBeautiful Day Without You\nWhat Else Is There\nCircuit Breaker\nAlpha Male\nSomeone Like Me\nDead To The World\nTristesse Globale\n\n\nCD 2\nGo away\nClean Sweep\nBoys\nHead\nLoser now","torrent":{"xt":"urn:btih:6b426c5ee0467fbbb862e23ed1f69d476a55a89e","amp;dn":"R%C3%83%C2%B6yksopp+-+The+Understanding+%282005%29+flac","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b426c5ee0467fbbb862e23ed1f69d476a55a89e","infoHashBuffer":{"type":"Buffer","data":[107,66,108,94,224,70,127,187,184,98,226,62,209,246,157,71,106,85,168,158]},"announce":[],"urlList":[]}}