{"title":"The Jewel of the Nile 1985 720p BRRip x264-{Simba}","uid":6059175,"size":825686591,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:6bc1d1c415750295a1560261035b5b7e95c37781&amp;dn=The+Jewel+of+the+Nile+1985+720p+BRRip+x264-%7BSimba%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtSimba","files":5,"time":1293041960,"description":"[center[IMG]http://img23.imageshack.us/img23/6118/thejewelofthenile1985.jpg[/IMG]\n  [IMG]http://img94.imageshack.us/img94/2170/filmicone.gif[/IMG]\n[/color] MPEG-4\n[color=red]FILE SIZE:[/color] 759 MiB\n[color=red]Width:[/color] 1280 pixels\n[color=red]Height:[/color] 544 pixels\n[color=red]ASPECT RATIO:[/color] 2.35:1 \n[color=red]FRAME RATE:[/color] 23.976 fps\n[color=red]VIDEO BITRATE:[/color] 695 Kbps\n[color=red]AUDIO Channel(s):[/color] Front: L R\n[color=red]LANGUAGE:[/color] English\n[color=red]SUBTITLES:[/color] Yes\n[IMG]http://img41.imageshack.us/img41/2716/ccasticons.png[/IMG]\nMichael Douglas as Jack Colton\nKathleen Turner as Joan Wilder\nDanny DeVito as Ralph The Comical Swindler\nSpiros FocÃƒÂ¡s as Omar\nAvner Eisenberg as Jewel\nPaul David Magid as Tarak\nHoward Jay Patterson as Barak\nRandall Edwin Nelson as Karak\nSamuel Ross Williams as Arak\nTimothy Daniel Furst as Sarak\nHamid Fillali as Rachid\nDaniel Peacock as Rock Promoter\nHolland Taylor as Gloria\nGuy Cuevas as Le Vasseur\nPeter DePalma as Missionary (as Peter De Palma)\nMark Daly Richards as Pirate[/color]\n[IMG]http://img209.imageshack.us/img209/5011/storyline.gif[/IMG]\nPlot summary\nSix months after the events in the last film, Romancing the Stone, Joan Wilder (Kathleen Turner) is having trouble writing her next romantic novel while living with Jack Colton (Michael Douglas) on his boat, the Angelina which is currently docked in a South of France port, and she refuses to discuss marriage. Later that afternoon at a book signing engagement held by her publisher, Gloria (Holland Taylor), Joan meets a charming Arab ruler named Omar (Spiros FocÃƒÂ¡s) who has managed to persuade the world that he is the firm, but fair, ruler of Kadir, a fictional nation. Omar offers Joan the opportunity to live like a queen at his palace, while she writes a fluff piece about him. However, as soon as Joan leaves with Omar, Jack runs into Ralph (Danny DeVito). Ralph, a comical swindler from Jack's past, recently out of prison, plans on killing Jack for abandoning him in Colombia to the authorities, but is stopped by an Arab named Tarak (Paul David Magid), who tells Jack of Omar's true intentions. This includes the fact that he has their greatest treasure, the Jewel of the Nile, in his possession. Ralph, immediately interested at the prospect, agrees to help find the Jewel. Jack, however, is less than convinced. But seconds later, the Angelina explodes, having been sabotaged under Omar's orders. He then agrees to team up with Ralph and Tarak in order to track down the lost jewel in Omar's kingdom.\nDuring her stay at his palace, Joan discovers that Omar is a brutal dictator, who imprisons her until she agrees to finish the fluff piece that will introduce him to the world as an enlightened ruler that will unite the Arab world. In the palace jail she meets a holy man, Al-Julhara (Arabic for 'The Jewel'), (Avner Eisenberg), who is in fact the Jewel of the Nile. Realizing that he is the only one who can stop Omar, Joan offers to take Al-Julhara to Kadir herself. The pair escape the palace, and with the help of Jack (who hijacks an F-16 Fighting Falcon fighter jet), are able to flee Omar's army into the desert. Ralph, who provides much of the film's comic relief, is left to fend for himself in the desert and thus joins with the rebel Sufi tribe led by Tarak that has sworn to protect the Jewel so he can fulfill his destiny.\nAfter a battle with a Nubian mountain African tribe, Joan breaks the news to Jack, that the Jewel is in fact Al-Julhara who is the true spiritual leader of the Arab people. Omar plans on using a British rock &amp; roll technician's (Daniel Peacock) smoke and mirrors special effects at an upcoming festival, planned by Omar, to convince the Arab world that he is in fact a prophet that will unite the Arab world under his rule. Jack, Joan and Al-Julhara decide to crash the festival in Kadir and unmask Omar as the fraud that he is. However, they are all captured and Omar sets up an elaborate and fiendish trap from The Savage Secret, Joan's most popular novel. Jack and Joan are suspended over a deep pit, with the ropes holding Jack up are soaked with goat's blood and being rapidly chewed away by rats, while Joan's are slowly being dissolved by drops of acid. Al-Julhara, however is simply locked up in stocks. As Omar leaves them to their fate, they are found later and inadvertently saved by Ralph, who along with Tarak and his Sufi followers have come to rescue Al-Julhara. As Omar takes center stage to address the Arab people, Jack and Joan disrupt the ceremony while Tarak and the Sufi battle Omar's guards below. A fire breaks out when part of Omar's platform apparatus crashes into the stage, engulfing it in flames. Jack and Joan are separated in the chaos and Omar corners her at the top of the burning scaffolding surrounding the stage. With help from Ralph, Jack rides a crane to the top of the scaffolding and knocks Omar over the side and down into the flames below just as he is about to kill Joan. Once Omar is killed, Al-Julhara rises as the real spiritual leader and Jack and Joan are finally married by Al-Julhara himself the following day. While he is genuinely happy for Jack and Joan, Ralph laments sadly that once again, he has nothing to show for his efforts. But he is then acknowledged as being a true Sufi by Tarak, signified by being presented with a priceless jeweled dagger. Ralph is genuinely touched and happily accepts the gift. The film ends with Jack and Joan sailing down the Nile as Al-Julhara and his people, along with Ralph, Tarak, the Sufi and Gloria wave goodbye from the river's dock.[/color]\n[size=7][color=blue][u][i]Production notes[/i][/u][/color][/size]\n[color=brown]As with the first film, the novelization of the sequel was credited to Joan Wilder, the character played by Kathleen Turner.\nApproximately two weeks before principal photography began, a plane carrying Richard Dawking (production designer) and Brian Coates (production manager) crashed during location scouting over the countryside of Morocco, killing all on board.\nThe Jewel of the Nile was the final film released on the SelectaVision video format.[/color]\n[size=7][color=green][u][i]Response[/i][/u][/color][/size]\n[color=violet]While The Jewel of the Nile grossed nearly as much as its predecessor,[1] the film was much less successful critically and helped to effectively kill the franchise[citation needed], although it was said at the time that both Kathleen Turner and Michael Douglas only made the sequel because they were contractually obligated to do so.[2] At one point during pre-production, Turner tried to back out of the project, and Twentieth Century Fox threatened her with a $25 million lawsuit.[3] Turner, Douglas, and DeVito would later reunite in the unrelated film The War of the Roses.[/color]\n[color=orangered]Critics felt the film was loaded with numerous plot holes and that it lacked the first film's original charm. The New York Times opened its review by writing, &quot;There's nothing in The Jewel of the Nile that wasn't funnier or more fanciful in Romancing the Stone.&quot;[4] Roger Ebert agreed that &quot;it is not quite the equal of Romancing the Stone,&quot; but praised the interplay between Douglas and Turner. &quot;It seems clear,&quot; he wrote, &quot;that they like each other and are having fun during the parade of ludicrous situations in the movie, and their chemistry is sometimes more entertaining than the contrivances of the plot[/color][/b] &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0089370&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0089370&lt;/a&gt;\n[IMG]http://img192.imageshack.us/img192/8489/screenshotsicon.png[/IMG]\n[img]http://img213.imageshack.us/img213/7862/68903077.png[/img]\n[img]http://img576.imageshack.us/img576/2147/74217546.png[/img]\n[img]http://img413.imageshack.us/img413/2892/87037783.png[/img]\n[img]http://img156.imageshack.us/img156/4189/16279861.png[/img]\n[size=5][b][color=red]Enjoy Another Release of Simba[/color][/b][/size][/center]","torrent":{"xt":"urn:btih:6bc1d1c415750295a1560261035b5b7e95c37781","amp;dn":"The+Jewel+of+the+Nile+1985+720p+BRRip+x264-%7BSimba%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6bc1d1c415750295a1560261035b5b7e95c37781","infoHashBuffer":{"type":"Buffer","data":[107,193,209,196,21,117,2,149,161,86,2,97,3,91,91,126,149,195,119,129]},"announce":[],"urlList":[]}}