{"title":"Tom Byron`s POV Cocksuckers # 4 (DVD.xvid) - 10 hotties","uid":4611234,"size":1465771673,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:6e3215a782e9686701a1b35c3c7d3a895f4c68e2&amp;dn=Tom+Byron%60s+POV+Cocksuckers+%23+4+%28DVD.xvid%29+-+10+hotties&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pure_screens","files":4,"time":1230645425,"description":"Tom Byron`s POV Cocksuckers # 4\n\n\n\n\n\nscreens CD1/CD2 + DVD-covers:\n &lt;a href=&quot;\nhttp://the.blogbugs.org/4507133/POV-Cocksuckers-4---screens-CD1-CD2.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://the.blogbugs.org/4507133/POV-Cocksuckers-4---screens-CD1-CD2.html&lt;/a&gt;\n\n\n\n\n\n\n\nA camera, my cock, and a hot girl's mouth... \nWhat else do you need?\n\n\n\nActresses\n\n    * Amber Peach [BJOnly Facial]\n    * Kylee King [BJOnly Facial Swallow]\n    * Laurie Vargas [BJOnly Facial]\n    * Lexi Bardot [BJOnly Facial]\n    * Olivia O'Lovely [BJOnly Facial]\n    * Onna Starr\n    * Sinnamon Love [BJOnly Facial IR]\n    * Sunny Lane [BJOnly Facial]\n    * Tia Sweets [BJOnly Facial]\n    * Veronica Rayne [BJOnly Facial Swallow]\n\nActors\n\n    * Tom Byron\n\n \n   \nScene Breakdowns\n\n    * Scene 1. Sunny Lane, Tom Byron\n    * Scene 2. Laurie Vargas, Tom Byron\n    * Scene 3. Kylee King, Tom Byron\n    * Scene 4. Onna Starr, Tom Byron\n    * Scene 5. Tom Byron, Veronica Rayne\n    * Scene 6. Amber Peach, Tom Byron\n    * Scene 7. Lexi Bardot, Tom Byron\n    * Scene 8. Tom Byron, Tia Sweets\n    * Scene 9. Sinnamon Love, Tom Byron\n    * Scene 10. Olivia O'Lovely, Tom Byron\n\n\nCategory: \tOral, P.O.V. - Point of View\nStudio:  \tTom Byron Pictures\nRelease Date:\tJul 31, 2007\nFormat:         Xvid\nLanguage:       English\n\n\n\nREVIEW:\n\n\nScene 1 - Sunny: Sunny, a hot blonde shows off her body while wearing a pink outfit. After stripping naked she drops to her knees and gives a rather typical blowjob. The highlight of the scene comes at he end when Sunny gets absolutely plastered in man gravy.\n\nScene 2 - Laurie: Laurie is an exotic brunette with an amazing pair of tits. While kneeling on the ground Laurie used her moth and hands to satisfy her partner. He jerks off in her face as the scene ends.\n\nScene 3 - Kylee: Kylee is my favorite girl on the disc. Her dark eyes and flawless body make her a winner. While the blowjob was fairly standard I enjoyed every second of the action. With her mouth wide open, Kylee gulps down his batch of baby batter.\n\nScene 4 - Anna: Skipping any kind of intro Anna dives right down on her man. She feverishly sucked his dick often gazing into the camera while deep throating him. After a very intense blowjob Anna allows his to deposit his load all over her face.\n\nScene 5 - Veronica: Veronica is a sexy brunette with her hair pulled into pigtailed. Without wasting a precious second Veronica starts gagging on her man's cock. I really enjoyed all the energy and enthusiasm she showed. She swallows his jizz as the scene closes.\n\nScene 6 - Amber: The sixth scene starts off with Amber striking some sexy poses on a bed. After a while Amber cant control herself and she simply has to have her man's cock in her mouth. She polishes his knob until he jerks off in her hungry mouth.\n\nScene 7 - Lexi: Lexi is a tattooed cutie with long dark hair. After a standard intro Lexi gives her man's cock a good licking. Once again the girl looked into the camera for most of the time. The ending was a little disappointing because most of his cumshot missed her face!\n\nScene 8 - Tia: Tia is another dark-skinned beauty with brown hair. While her man lays back and relaxes, Tia give shim the blowjob of a lifetime. The best part comes at the end with Tia gets a firehose-like blast of jizz all over her face! Bravo!\n\nScene 9 - Sinnamon: Sinnamon is a black vixen with an enormous pooper. After showing it off to the camera Sinnamon gets down to business. She playfully sucks his schlong until he absolutely cover her face with hot cum. Great girl, great scene.\n\nScene 10 - Olivia: Last up is Olivia. She might be the most attractive girl her. Her performance was simply amazing. She sucked, slurped, and spit on his cock for over ten minutes. After he has had his fill, Olivia lets him blast her face with man gravy. Stunning girl.\n\n\nFinal Thoughts: \nThis was my favorite of all the titles in this series. For once, every girl is top-notch and really seems to enjoy sucking cock on film. They all show a lot of enthusiasm which is often an overlooked element in porn. \nAny fans of oral compilation DVDs will, without hesitation, want to add this to your collection.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n.","torrent":{"xt":"urn:btih:6e3215a782e9686701a1b35c3c7d3a895f4c68e2","amp;dn":"Tom+Byron%60s+POV+Cocksuckers+%23+4+%28DVD.xvid%29+-+10+hotties","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e3215a782e9686701a1b35c3c7d3a895f4c68e2","infoHashBuffer":{"type":"Buffer","data":[110,50,21,167,130,233,104,103,1,161,179,92,60,125,58,137,95,76,104,226]},"announce":[],"urlList":[]}}