{"title":"Night Flight From Moscow (aka The Serpent) (Henry Fonda, Yul Bre","uid":4722082,"size":692646464,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6f2f8999e434fdc3358c7390ebbd3cb3fe9847c7&amp;dn=Night+Flight+From+Moscow+%28aka+The+Serpent%29+%28Henry+Fonda%2C+Yul+Bre&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"alien99","files":1,"time":1234564676,"description":"his is not my rip just a great movie (in my opinion)of a spy thriller\ntext in french language in english, tho just about all the languages are\nspoken somewhere in movie\nTalk about international cast, this French film Le Serpent boasts players from America, The United Kingdom, France, Italy, Germany and Russia. It's an espionage story with Yul Brynner as a high ranking KGB colonel defecting to the west and bringing a whole lot of goodies with him.\nWhat Brynner is bringing to CIA chief Henry Fonda is a list of fifth columnists who've been operating for years in the west in all the western allied countries. A lot of deaths start occurring in all these countries as problems are dealt with one way or another.\nOf course this information wreaks havoc with the intelligence services of the west. Which just might have been the desired Soviet intention.\nIn this cast the best performance hands down is that of Dirk Bogarde as a Kim Philby like MI5 man. Somebody's had their eye on him for a long time.\nSpying can be a dirty business and Le Serpent certainly shows the seamier side of it. If you're looking for James Bond like heroics this isn't your film.\nLe Serpent is in the tradition of the Richard Burton classic The Spy Who Came In From The Cold. Not as good but better than a whole lot of stuff these old timers were appearing in during the Seventies.","torrent":{"xt":"urn:btih:6f2f8999e434fdc3358c7390ebbd3cb3fe9847c7","amp;dn":"Night+Flight+From+Moscow+%28aka+The+Serpent%29+%28Henry+Fonda%2C+Yul+Bre","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f2f8999e434fdc3358c7390ebbd3cb3fe9847c7","infoHashBuffer":{"type":"Buffer","data":[111,47,137,153,228,52,253,195,53,140,115,144,235,189,60,179,254,152,71,199]},"announce":[],"urlList":[]}}