{"title":"Genealogical Library - Notable British Families 1600s-1900s","uid":4916642,"size":563681280,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6feecb469400dd379777da940ae3b184bdd2b8ce&amp;dn=Genealogical+Library+-+Notable+British+Families+1600s-1900s&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1243456122,"description":"This is the amazing Genealogical Library CD featuring Notable British Families 1600s-1900s and includes some rare and otherwise hard to find books on the history of British Nobility and how they have spread all over the world, especially to America. Find out how some of the most well known American politicians (including presidents) and other wealthy or famous persons are actually descendants of British noble families and how some of them even relate to the current queen. While many Americans still believe that their Independence war eliminated the tyrannical British influence forever, the impeccable research on family records of the current ruling elite shows quite the opposite, namely that a silent takeover of the British aristocratic families has occured right in front of the naive Americans.\n\nBooks included are:\n* &quot;Burke's American Families with British Ancestry&quot;\n   Author: Sir John Bernard Burke\nThis work ranks as the most authoritative ever published on the subject of notable American families with British ancestry. Documenting hundreds of direct line pedigrees, it provides an honor roll of births, marriages, and deaths in successive generations. \n\n* &quot;A Genealogical History of the Dormant, Abeyant, Forfeited, and Extinct Peerages of the British Empire&quot;\n   Author: Sir John Bernard Burke\nThis work describes the lineages of nearly 2,000 peerages -- Dukes, Marquesses, Earls, Viscounts, and Barons -- that are now extinct. Each article begins with the exact date of the peerage's creation and lists all known representatives of that line up to the time of the title's extinction. Each lineage provides details on births, marriages, and deaths but also includes a wealth of incidental detail (such as  references to military and official service, estates, occupations, and honors). \n\n* &quot;A Genealogical and Heraldic History of the Extinct and Dormant Baronetcies of England, Ireland, and Scotland&quot;\n   Authors: John Burke and John Bernard Burke\nThis work gives the lineages of nearly 1,000 holders of the order of Baronet whose titles were dormant or extinct by 1841. Combined with an illustration of the Baronet's armorial bearings, each article follows the Baronet's lineage from its beginning to its extinction. Arranged in narrative style the lineages also provide details of education, service, occupation, honors, collateral families, places of birth, residence, death, and descriptions of arms. \n\n* &quot;Burke's Family Records&quot;\n   Author: Ashworth P. Burke\nThis work traces the descent of some 300 junior houses of the British nobility. For those families for which clear official authority was forthcoming, coats-of-arms were provided along with details of lineage. \n\n* &quot;A Genealogical and Heraldic History of the Colonial Gentry&quot;\n   Author: John Bernard Burke and Ashworth P. Burke\nA two-volume set, &quot;A Genealogical and Heraldic History of the Colonial Gentry&quot; gives the lineages of many of the leading colonial families of Canada, Australia, New Zealand, the West Indies, South Africa, and other parts of the British Empire. Among the Canadian families covered are a number of American Loyalist families, including the Stocktons of New Jersey, Macnab and Robinson of Virginia, Bayard of New York, and Coffin and Jones of Massachusetts. \n\n* &quot;The General Armory of England, Scotland, Ireland, and Wales&quot;\n   Author: John Bernard Burke\nPerhaps the supreme reference work in British heraldry, the range of this work is encyclopedic. Alphabetically arranged by family name, it contains approximately 70,000 descriptions of British coats-of-arms. In addition, it includes sections illustrating Royal heraldry and the British orders of knighthood, a dictionary of terms, an illustrated glossary, and an extensive list of mottoes.\n\n* &quot;A Genealogical and Heraldic History of the Commoners of Great Britain and Ireland Reprinted with the 'Index to Pedigrees in Burke's Commoners,' by George Ormerod&quot;\n   Author: John Bernard Burke \nFor some time, this four-volume work has been the standard genealogical guide to families in Great Britain and Ireland who held territory or official rank, but who did not hold heritable honors. In the narrative style characteristic of a Burke publication, each genealogical study begins with a brief biographical sketch followed by information about that person's immediate family. From there, the lineage continues, commencing with the earliest ancestor of record and proceeding through successive generations, noting births, marriages, deaths, and other details relevant to the pedigree. \n\n* &quot;The Prominent Families of the United States of America&quot;\n   Author: Arthur Meredyth Burke\nLike other works produced by Burkes, this volume lists the descent of historically prominent American families. Thought to be one of the most authoritative volumes of its kind, it includes hundreds of pedigrees.\n\nInstructions for use:\n1. Use Daemon Tools to mount the ISO image or simply burn the ISO on a new CD\n2. Install the Family Archive Viewer from the newly created virtual cd\n3. Run the viewer\n","torrent":{"xt":"urn:btih:6feecb469400dd379777da940ae3b184bdd2b8ce","amp;dn":"Genealogical+Library+-+Notable+British+Families+1600s-1900s","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6feecb469400dd379777da940ae3b184bdd2b8ce","infoHashBuffer":{"type":"Buffer","data":[111,238,203,70,148,0,221,55,151,119,218,148,10,227,177,132,189,210,184,206]},"announce":[],"urlList":[]}}