{"title":"PRIVATE MOMENTS 2005-by-BLUEAXE.avi","uid":7767974,"size":723651664,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:705ae6079ba1564a5b6656490e1b7724304b6091&amp;dn=PRIVATE+MOMENTS+2005-by-BLUEAXE.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"ricky0657","files":1,"time":1351435173,"description":"In London, Serena is the host of the London Talk Radio. The show is facing low ratings and the studio manager Archie advises that the producers have given two weeks to Serena improve the ratings of the show; otherwise it would be called off and they would be unemployed. The upset Serena goes home, but her friends Grace, Marie and Saira Malik invite Serena to celebrate her birthday with them. They decide to play &quot;Truth and Dare&quot; and each woman selects &quot;Truth&quot; and tells a sexy story of her life: (1) Last Call: Grace tells that she was feeling lonely and without sex for one year. One night, while waiting for the bus after-hours, she receives a phone call in a public phone and the fantasy of having sex with a stranger changed her life for better. (2) Afternoon Delight: Saira tells that she was feeling bored with her relationship with her boyfriend. One afternoon, she receives a binoculars from a stranger in her office and when looks around, she sees a construction worker with a plate with his name. She goes to the place and Damien invites Saira to climb in the construction elevator with him. He blindfolds her and they have sex for her delight. (3) High Art: The boyfriend of agent Marie gives daring pictures from an artist named Lucien Nashews with people having sex in public places. Marie meets Lucien and his wife Jade and they schedule a meeting on the next morning. Marie takes the two floor bus and Jade seduces her and has sex with her on the second floor while Lucien takes pictures of them. Serena selects &quot;Dare&quot; and uses the erotic tales of her friend to improve her show and be confident to talk to her secret crush Bruce.","torrent":{"xt":"urn:btih:705ae6079ba1564a5b6656490e1b7724304b6091","amp;dn":"PRIVATE+MOMENTS+2005-by-BLUEAXE.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"705ae6079ba1564a5b6656490e1b7724304b6091","infoHashBuffer":{"type":"Buffer","data":[112,90,230,7,155,161,86,74,91,102,86,73,14,27,119,36,48,75,96,145]},"announce":[],"urlList":[]}}