{"title":"Bens Menu S02E01-E05 Web-DL.x264-JIVE","uid":12409511,"size":972932974,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:707ef3893f91d18473d9d5f8358550a7bb5e3c6f&amp;dn=Bens+Menu+S02E01-E05+Web-DL.x264-JIVE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"TlanImass","files":5,"time":1442136034,"description":"MasterChef Australia Series 4 favourite Ben Milbourne returns for a second season of Ben's Menu. Ben will be based in his country-style studio kitchen, with its rustic BBQ alfresco area in North West Tasmania; a foodies' paradise. He will be regularly joined in his kitchen by some of his close mates, fresh food producers, talented chefs and local foodie personalities. Travelling around Tasmania again, Ben will explore the best the island has to offer, as well as occasionally venturing onto the Australian mainland to cook at some fantastic locations using the local and seasonal produce.\n\n\n\n\nSeason 2, Episode 1\n\nIn the first episode of Ben's Menu, Ben Milbourne invites fellow Masterchef alumni Emma Dean into his kitchen where she creates an easy breakfast dish.\n\n\n\nSeason 2, Episode 2\n\nBen Milbourne teams up with former Miss Universe Australia, Olivia Wells to cook a succulent chicken dish, before Liv wows Ben with her cupcake recipe.\n\n\n\nSeason 2, Episode 3\n\nBen Milbourne starts the day cooking in his picturesque backyard where he prepares an easy breakfast bruschetta, before Amy Luttrell pops by to share her sweet bread recipe.\n\n\n\nSeason 2, Episode 4\n\nBen Milbourne serves a satisfying and healthy salad, then Lynton Tapp drops in to make a classic outback staple and Ben whips up a handful of Apple and Caramel pies.\n\n\n\nSeason 2, Episode 5\n\nBen Milbourne stirs up a quick and spicy 15-minute pasta, then A Taste of Travel reporter Scott McRae stops by to sample Ben's Tempura Oyster recipe.\n\n\n\n\nOriginal Air Dates: 07-Sep-2015 to 11-Sep-2015","torrent":{"xt":"urn:btih:707ef3893f91d18473d9d5f8358550a7bb5e3c6f","amp;dn":"Bens+Menu+S02E01-E05+Web-DL.x264-JIVE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"707ef3893f91d18473d9d5f8358550a7bb5e3c6f","infoHashBuffer":{"type":"Buffer","data":[112,126,243,137,63,145,209,132,115,217,213,248,53,133,80,167,187,94,60,111]},"announce":[],"urlList":[]}}