{"title":"The Indian Ocean Tsunami of 2004 - (Malestrom)","uid":5294757,"size":8562945,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:723430c393d19b03e12dd0c701a948b4b5d13ad3&amp;dn=The+Indian+Ocean+Tsunami+of+2004+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"malestrom_HH","files":2,"time":1264017842,"description":" &lt;a href=&quot;http://bayimg.com/NAjPjAaCm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/NAjPjAaCm&lt;/a&gt;\n\nThe Indian Ocean Tsunami of 2004 (Great Historic Disasters) By William W. Lace\nPublisher: Chelsea House Publications 2008 | 267 Pages | ISBN: 0791096424 | PDF \n\nOn December 26, 2004, a gigantic earthquake ripped apart the floor of the Indian Ocean off the coast of Sumatra. The force of the quake, transmitted upward to the surface, sent a tsunami, or a series of giant waves, in all directions toward unprotected shores and unwarned populations, many in remote areas or secluded vacation spots. Within 12 hours, more than 200,000 people had been killed, and many more left injured or homeless, their livelihoods destroyed. Cities and villages lay in ruins. Even the geography of the Earth was changed. But as the affected countries, with help from around the world, struggled to recover, scientists warned that the next deadly tsunami could come at any time. The question remains whether the world will be any more prepared for the next one. Read how the Indian Ocean earthquake and tsunami changed the way nations are tracking natural-disaster warnings in an effort to prevent future disasters.\n\nAbout the Author\nWilliam W. Lace is a native of Fort Worth, Texas, where he is executive assistant to the chancellor at Tarrant County College. He holds a bachelor's degree from Texas Christian University, a master's degree from East Texas State University, and a doctorate from the University of North Texas. Prior to joining Tarrant County College, he was director of the news service at the University of Texas at Arlington and a sportswriter and columnist for the Fort Worth Star-Telegram. He has written more than 40 nonfiction books for young readers on subjects ranging from the atomic bomb to the Dallas Cowboys. He lives in Arlington, Texas.\n","torrent":{"xt":"urn:btih:723430c393d19b03e12dd0c701a948b4b5d13ad3","amp;dn":"The+Indian+Ocean+Tsunami+of+2004+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"723430c393d19b03e12dd0c701a948b4b5d13ad3","infoHashBuffer":{"type":"Buffer","data":[114,52,48,195,147,209,155,3,225,45,208,199,1,169,72,180,181,209,58,211]},"announce":[],"urlList":[]}}