{"title":"Maxim India - January 2016 (gnv64)","uid":13269418,"size":38117456,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:73ea3c186f1c8cefaa15f7ca5a4e5efd51798c58&amp;dn=Maxim+India+-+January+2016+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gnv65","files":4,"time":1453379515,"description":"Maxim India - January 2016\r\nEnglish | 108 pages | PDF | 36.3 mb\r\n\r\nFeatures\r\n50 Taapsee Pannu - She’s ruled the fi lm roost in the South and is slowly but surely making her way through B-town\r\n58 BIG POT Can corporate America strip marijuana of its counterculture roots?\r\n64 RIDING HOT AIR The paragliding World Cup and famous locale Bir-Billing come together.\r\n70 EMILY DIDONATO The beyond-gorgeous supermodel steams up our tribute to the sea, sun and sand.\r\n78 MAROONED A big-city journalist heads to a python-fi lled desert island for a crash course in survival.\r\n84 THE COVERGIRL CONTINUUM Celebrating Maxim’s big-boy birthday.\r\n90 TEXTURE TRIPPIN’ Power dressing like you’ve never seen before.\r\n104 24 HOURS TO LIVE WITH ANAND BHUSHAN The fashion designer, trash-talker, dog-lover takes a trip to Hell.\r\n\r\nArena\r\n8 ALL EYES ON TOP Breaking down the new Porsche Cayman GT4.\r\n12 KING OF CUSTOMS How hot-rod guru Bodie Stroud achieved automotive greatness.\r\n16 ARCTIC ICE Why absinthe is the spirit of the season.\r\n17 MARTIN GARRIX We catch up with the Animals producer.\r\n18 STYLE AND TRADITION Don Julio Tequila opens the doors to their production plant, only for Maxim.\r\n19 THE ART OF ENJOYING COFFEE The new caffeine rituals you should be following.\r\n20 GARNISHED WITH OPULENCE The world’s most exotic food served on a platter. Modus\r\n22 NEW YEAR, NEW YOU The fragrances to try this month.\r\n24 HERO THE HAT We’re talking Johnny Depp meets Ranveer Singh inspiration.\r\n25 SWEATER WEATHER Your knits have got to be chunky!\r\n26 TWIST AND TUCK Real men wear scarves, and wear them well.\r\n\r\nAgenda\r\n28 BLOODSPORT Making sense of the most brutal sporting event on Earth.\r\n32 HE SAID, SHE SAID We answer your sex questions from all perspectives.\r\n34 FOOD RULES How to lose weight, boost muscle and strengthen immunity.\r\n36 FAT-BURN 101 Build your core with this superset. Emporium\r\n38 ROAD RUNNERS The next-gen vehicles that are more fun than a hoverboard!\r\n42 MASTERS OF TIME Watches that celebrate the achievement of horologerie.\r\n \nhttp://s13.postimg.org/pmp9y022v/Maxim_India_January_2016.jpg","torrent":{"xt":"urn:btih:73ea3c186f1c8cefaa15f7ca5a4e5efd51798c58","amp;dn":"Maxim+India+-+January+2016+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73ea3c186f1c8cefaa15f7ca5a4e5efd51798c58","infoHashBuffer":{"type":"Buffer","data":[115,234,60,24,111,28,140,239,170,21,247,202,90,78,94,253,81,121,140,88]},"announce":[],"urlList":[]}}