{"title":"Encyclopedia of Explosives (All 10 Volumes)","uid":3999396,"size":348083570,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:751a67947791407f1cd90b8d175273e41951182c&amp;dn=Encyclopedia+of+Explosives+%28All+10+Volumes%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"x_DontTreadOnMe_x","files":12,"time":1201473033,"description":"The most complete, comprehensive, and thorough reference textbook ever written on explosives, propellants, pyrotechnics, and ammunition.   No other work on explosives published after this Encyclopedia even comes close to the level of information it contains.\n\nA &quot;Must Have&quot; for Explosive Engineers, Pyrotechnists, Chemists,\nLaw Enforcement Officers, Safety Experts, and Explosives Manufacturers\n\nIncludes most of the military weapon systems of the 1960s, 70s, and 80s, with detailed material on historical terms, scientists, chemical weapons, analytical procedures, precursors, chemistry, synthesis, manufacture, physical and explosive properties, handling, and other academic citations of interest to scientists.\n\nThis work should be the &quot;first stop&quot; in researching any explosive:  if it doesn&amp;#039;t contain the details you seek, it will certainly hold references to virtually all the published literature.\n\nThis complete, technical reference contains thousands of entries on:\n\n    * Military and industrial explosives, explosive compositions, propellants and pyrotechnic compositions\n\n    * Explosives and explosive compositions which have not been used for military or industrial purposes\n\n    * Analytical procedures for the more common explosives, explosive compositions, propellants and pyrotechnic compositions\n\n    * Compounds which deflagrate or may possibly explode because of the presence of plosophoric groups\n\n    * Ammunition items, such as projectiles, bombs, grenades, detonators, fuzes, etc\n\n    * Calibers of weapons and projectiles used in the US and foreign countries\n\n    * Brief definitions of ordnance terms\n\n    * Names of scientists who made important contributions in the fields of  explosives, ammunition and weapons\n\nEntries also outline the history and background of the development and use of explosives.  Includes references to the parent compounds of azido, nitro, and nitroso derivatives, plus references to intermediate non-explosive derivatives.  (These references are critical for the proper preparation of explosive derivatives.)\n\nAll of the Encyclopedia&amp;#039;s references are well-documented, so you can easily find the original literature cited.   Includes all of the works of both Urbanski and Davis, plus thousands of other key references to additional published sources of chemistry and manufacturing details.\n\nThis is the only source we&amp;#039;ve seen that gives references to pre-1970 patent numbers--essential for finding early patent information.  Also includes the Beilstein Index numbers for thousands and thousands of compounds and explosive chemicals. \n\n~~~\n\nI am always adding new things, so check this account often.\n\nVisit roguesci (dot) org (slash) theforum, and register, for the world&amp;#039;s longest running largest explosives and weapons forum on the web!","torrent":{"xt":"urn:btih:751a67947791407f1cd90b8d175273e41951182c","amp;dn":"Encyclopedia+of+Explosives+%28All+10+Volumes%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"751a67947791407f1cd90b8d175273e41951182c","infoHashBuffer":{"type":"Buffer","data":[117,26,103,148,119,145,64,127,28,217,11,141,23,82,115,228,25,81,24,44]},"announce":[],"urlList":[]}}