{"title":"Supershow - The Last Great Jam Of The 60's (2003)","uid":7941546,"size":1159700542,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:752a59891b8ded4554b1be86ab161bfa234a5062&amp;dn=Supershow+-+The+Last+Great+Jam+Of+The+60%27s+%282003%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"soltic","files":1,"time":1355999936,"description":"In an empty, abandoned linoleum factory, west of London, some of the legends of rock, blues and jazz were brought together for an historic and amazing session. Who was there? Eric Clapton was, and Jack Bruce and Buddy Guy, meeting Eric for the first time in what was to be a long relationship of the two greatest blues guitarists of a generation. Great drummers Buddy Miles and John Hiseman and the enigmatic superstar Stephen Stills. The extraordinary jazz legend Roland Kirk plays with his Quartet and then jams with the rockers. The Modern Jazz quartet, one of the greatest ensembles in the history of modern music, add an ethereal, spacey calm to the proceedings. Only to have it shattered by Buddy, Jack, Buddy, Dick Heckstall-Smith, jumping on Mary Had A Little Lamb! A powerful, haunting recording of one of the last great sixties musical events.\n\n1. Jon Hiseman's Colosseum - Those Who Are About To Die, We Salute You\n2. Buddy Miles et al. - Love Potion\n3. Modern Jazz Quartet - Under The Jasmine tree\n4. Buddy Guy, Jack Bruce, et al. - Mary Had A Little Lamb\n5. Roland Kirk Quartet - Primitive Ohio\n6. Buddy Miles, Glenn Campbell, et al. - Checking on my Baby/Texas Blues\n7. Modern Jazz Quartet - Visitor From Venus\n8. Glenn Campbell with The Misunderstood - Bad Hat\n9. Buddy Guy - Hoochie Coochie Man\n10. Jon Hiesman's Colosseum - Debut\n11. Buddy Guy, Roland Kirk, et al. - Stormy Monday/Kansas City\n12. Roland Kirk Quartet - I Say A Little Prayer\n13. Buddy Guy, Jack Bruce, Buddy Miles - My Time After A While\n14. Steve Stills, Buddy Miles, et al. - Black Queen\n15. Eric Clapton, Roland Kirk, et al. - Slate 27\n16. Eric Clapton, Buddy Guy, et al. - End Jam\n\nFormat: Matroska\nBit rate: 1340 kb/s \nWidth: 720\nHeight: 400\nDisplay aspect ratio: 16:9 \nAudio: Dolby Digital 2.0 ch., Dolby Digital 5.1 ch., Mono 1 ch.\n","torrent":{"xt":"urn:btih:752a59891b8ded4554b1be86ab161bfa234a5062","amp;dn":"Supershow+-+The+Last+Great+Jam+Of+The+60%27s+%282003%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"752a59891b8ded4554b1be86ab161bfa234a5062","infoHashBuffer":{"type":"Buffer","data":[117,42,89,137,27,141,237,69,84,177,190,134,171,22,27,250,35,74,80,98]},"announce":[],"urlList":[]}}