{"title":"And Never See Her Again - Patricia Spinger,Epub, Mobi, KK","uid":7198628,"size":3109229,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:753a42259ec44d744f8e5b31c4754aeda126f1ed&amp;dn=And+Never+See+Her+Again+-+Patricia+Spinger%2CEpub%2C+Mobi%2C+KK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"karaokeking123","files":-1,"time":1334863204,"description":" And Never See Her Again  Epub, Mobi\n\n\nOn March 26 1999, in Saginaw, Texas, 6-year-old Opal Jennings was playing with two other children in her grandmother's side yard when a black car drove up. A man got out and snatched Opal, whisking her away in his vehicle. It all happened in a flash, before her horrified grandparents could react. Local law enforcement and the FBI organized a massive search throughout the Dallas-Fort Worth area, while Opal's photograph was widely circulated in newspapers and on television. A probation officer noted that on March 27 - one day after Opal's kidnapping - ordinarily slovenly sex offender Richard Lee &quot;Ricky&quot; Franks, 30, had cut his long hair and was clean-shaven and neatly dressed. Why had he suddenly cleaned up his act? Franks, who'd been convicted of molesting his brother's 8-year-old daughter, admitted to sexually abusing another young female relative. He confessed to having had Opal in his car, but claimed he'd only been giving her a ride and let her go unharmed. His first trial ended in a hung jury, but at long last, in September 2000, a second jury would determine Franks' guilt in the disappearance of Opal Jennings. Yet it wouldn't be until December 2003 that proof of her fate would be discovered.  \n\n\n\nEnjoy!","torrent":{"xt":"urn:btih:753a42259ec44d744f8e5b31c4754aeda126f1ed","amp;dn":"And+Never+See+Her+Again+-+Patricia+Spinger%2CEpub%2C+Mobi%2C+KK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"753a42259ec44d744f8e5b31c4754aeda126f1ed","infoHashBuffer":{"type":"Buffer","data":[117,58,66,37,158,196,77,116,79,142,91,49,196,117,74,237,161,38,241,237]},"announce":[],"urlList":[]}}