{"title":"powr.broccoli-kopimi_de [GERMAN]","uid":4742312,"size":3864414,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:76728218c76cb2bede5ce73221a5b24a29f55bc1&amp;dn=powr.broccoli-kopimi_de+%5BGERMAN%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"kite23","files":1,"time":1235620410,"description":"Im Schatten der letzten Krise der Unterhaltungsindustrie im 20. Jahrhundert, wÃƒÂ¤chst ein grÃƒÂ¶ÃƒÅ¸eres Bild von MAcht, Broccoli und Kopimi. Der Untergang der Unterhaltungsindustrie wird gefolgt vom unheimlichen Erfolg der diffusen Struktur einer Internet-Elite, die das Wort ÃƒÂ¼ber die gesamte Welt verbreitet. Das Buch, das du gerade gelesen hast hat keinen Autor, keinen Designer, keinen Schriftsetzer, keinen Vertriebskanal. Trotzdem hast du es gerade vor dir. Wie kann das sein?\n\nLies die erschreckenden Anweisungen eines lose verbundenen Kerns von IT-Spezialisten, veredelt zu einer unverdÃƒÂ¤chtigen Generation von Jugendlichen und finde heraus, wie diese Gruppe die Eier, Dollars und JPEGs, vor den Augen des machtlosen Establishments mit seinen groÃƒÅ¸en finanziellen Interessen, gestohlen hat. Lerne, wie Server, Seeder, Tracker, e-Mail, FirmengrÃƒÂ¼ndung, Investoren aus dem Ausland, Ikkos wÃƒÂ¶chentliches Taschengeld, skandalÃƒÂ¶se Werbung, Link- und Suchdienste, eine ganze Welt - die keine FluchtmÃƒÂ¶glichkeit, keinen Ansprechpartner und niemanden VertrauenswÃƒÂ¼rdigen hatte - infiltriert und zerstÃƒÂ¶rt haben.\n\nDie Maschinerie, die stÃƒÂ¤ndig unter dem Radar operiert erstreckt sich vom Dschungel Kambodschas bis hin zur schwulen Nachbarschaft San Franciscos. ÃƒÅ“ber die leeren StrÃƒÂ¤nde von Tel-Aviv und in das Internet der einfachen Leute in den Stadtrand von JÃƒÂ¶nkÃƒÂ¶ping und den Hafen von Gothenburg. Niemand wird ausgelassen und jeder wird mitgerissen. Technisch anspruchsvoll und kÃƒÂ¶rperlich unabhÃƒÂ¤ngig verÃƒÂ¤ndert sie sich stÃƒÂ¤ndig. Sie mutiert und taucht wieder auf - in neuer Gestalt und unter anderen Namen. Sie hÃƒÂ¤lt seinen Gegner im WÃƒÂ¼rgegriff und bleibt selbst unberÃƒÂ¼hrt und sogar mehr - unfassbar.\n\nEs ist richtig, dass dies das erste mal ist, dass Kopimi die Welt zu Eis erstarren lÃƒÂ¤sst und wir kÃƒÂ¶nnen sicher sein, dass es nicht das letzte mal sein wird.\n\n(Releasenotes: Download, share, translate, remix, bend, modify,\ncopy, trash, bash, move, publish, burn, hide, remake, plz KOPIMI!)","torrent":{"xt":"urn:btih:76728218c76cb2bede5ce73221a5b24a29f55bc1","amp;dn":"powr.broccoli-kopimi_de+%5BGERMAN%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76728218c76cb2bede5ce73221a5b24a29f55bc1","infoHashBuffer":{"type":"Buffer","data":[118,114,130,24,199,108,178,190,222,92,231,50,33,165,178,74,41,245,91,193]},"announce":[],"urlList":[]}}