{"title":"Satyarth Prakash in Malayalam-How Hinduis Were Converted Into Is","uid":7697572,"size":7782410,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:77024d22246dbac6e6197c4f79317c260c147f24&amp;dn=Satyarth+Prakash+in+Malayalam-How+Hinduis+Were+Converted+Into+Is&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"donvoldy","files":1,"time":1349405052,"description":"Satyarth Prakash is magnus opus work of Swami Dayanand which had saved lakhs of hindus from conversion to islam and christianity.\n\nEvery hindu must read this book.\nDirect Download - http://agniveer.com/satyarth-prakash-in-malayalam/\nContributed by Aryaveer\n\nOur Motherland is the landof Vedas. Veritably this is a landof Gold. From the time of Ikshvaku to that Pandu of Mahabharatha fame Vedic Dharma guided the lives and activities of the people of Bharath. There was a peace, plenty and contenment everywhere. King Aswapathi proclaimed before the learned Brahmins who had come to discuss Brahm-vidya that there was thief, no miser, no drunkard, no man without fire of worship, none without knowledge of truth, none who was a debauch, and no women of unchaste character[ Chandogya upanishad:5.11.5]\n\nIn this even changing world nothing can maintain itself in a high state. After a period of higher development in Science, art and philosophy a period of decreptitude and decay always follows. Nearly 1000 years before Mahabharatha war the seeds of degeneration began to be sown. Gradually these seeds began to grow till in the fulness of time their fruits dropped a curtain on the great civilization of Bharath in the shape of epic Mahabharath war. In that war not only veteran Soldiers but also learned Brahmins got killed.\n\nRead","torrent":{"xt":"urn:btih:77024d22246dbac6e6197c4f79317c260c147f24","amp;dn":"Satyarth+Prakash+in+Malayalam-How+Hinduis+Were+Converted+Into+Is","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77024d22246dbac6e6197c4f79317c260c147f24","infoHashBuffer":{"type":"Buffer","data":[119,2,77,34,36,109,186,198,230,25,124,79,121,49,124,38,12,20,127,36]},"announce":[],"urlList":[]}}