{"title":"Stevie Wonder - Higher Ground (Beat Club)(2nafish)","uid":5859748,"size":108001284,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:7711146519465450e041a8a84a70924120226c29&amp;dn=Stevie+Wonder+-+Higher+Ground+%28Beat+Club%29%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1285922007,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Higher Ground&quot; is a funk song written by Stevie Wonder and first appearing on his 1973 album Innervisions. The song reached #4 on the U.S. Pop Singles chart and #1 on the U.S. Hot Soul Singles chart. Stevie wrote and recorded the song in a three-hour burst of creativity in May, 1973. The album version of this song contains an extra verse and runs 30 seconds longer than the single version. The unique wah-Clavinet sound in the song was achieved with a Mu-tron envelope filter pedal. The bass is a Moog synthesizer. Via overdubs, Wonder played all instruments on the track, including drums.\n\nIn 2004, Rolling Stone ranked the song #261 on their list of the 500 Greatest Songs of All Time, offering the following explanation: &quot;'Ground' was recorded just before Wonder was involved in a near-fatal accident in August '73 that left him in a coma. Early in Wonder's recovery, his road manager sang the melody of 'Ground' into the singer's ear; Wonder responded by moving his fingers with the music.&quot;\n\nWonder, joined by Alicia Keys and Lenny Kravitz, performed it at the 2004 MTV Video Music Awards. Wonder and Keys sang it again at the 2006 Grammy Awards.\n\nWonder performed it on January 18, 2009 at the Lincoln Memorial festivities in honor of the inauguration of President Barack Obama along with Shakira and Usher.\n\nWonder performed it on October 29, 2009, at the 25th Anniversary of the Rock &amp; Roll Hall of Fame Concert. It was performed with Sting. The song broke into &quot;Roxanne&quot; by The Police in the middle and concluded with a return to &quot;Higher Ground&quot;.\n\nInnervisions is an album by American musician Stevie Wonder, released August 3, 1973 on Motown Records. A landmark recording, it was the third of five consecutive albums widely hailed as his &quot;classic period&quot;, along with Music of My Mind, Talking Book, Fulfillingness' First Finale, and Songs in the Key of Life. The nine tracks that comprise Innervisions encompass a wide range of themes and issues: from drug abuse in &quot;Too High,&quot; social anger in &quot;Living for the City,&quot; to love; in the ballads &quot;All in Love is Fair&quot; and &quot;Golden Lady.&quot;\n\nAs with many of Stevie Wonder's albums the lyrics, composition and production are almost entirely his own work, with the ARP synthesizer used prominently throughout the album. This instrument was a common motif among musicians of the time because of its ability to construct a complete sound environment. Wonder was the first black artist to experiment with this technology on a mass scale, and Innervisions was hugely influential on the subsequent future of commercial black music. He also played all or virtually all instruments on six of the album's nine tracks, making most of Innervisions a representative one-man band.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:7711146519465450e041a8a84a70924120226c29","amp;dn":"Stevie+Wonder+-+Higher+Ground+%28Beat+Club%29%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7711146519465450e041a8a84a70924120226c29","infoHashBuffer":{"type":"Buffer","data":[119,17,20,101,25,70,84,80,224,65,168,168,74,112,146,65,32,34,108,41]},"announce":[],"urlList":[]}}