{"title":"The End of Suburbia [AVI - Oil Depletion - Conspiracy - Sept 11 ","uid":3778729,"size":729927640,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:77593ac0607077e32d5c735429001ab79900f462&amp;dn=The+End+of+Suburbia+%5BAVI+-+Oil+Depletion+-+Conspiracy+-+Sept+11+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"lkobescak","files":1,"time":1187581978,"description":"The End of Suburbia: Oil Depletion and the Collapse of The American Dream\n-------------------------------------------------------------------------\n\n\nSince World War II North Americans have invested much of their newfound wealth in suburbia. It has promised a sense of space, affordability, family life and upward mobility. As the population of suburban sprawl has exploded in the past 50 years, so too has the suburban way of life become embedded in the American consciousness.\n\nSuburbia, and all it promises, has become the American Dream.\n\nBut as we enter the 21st century, serious questions are beginning to emerge about the sustainability of this way of life. With brutal honesty and a touch of irony, The End of Suburbia explores the American Way of Life and its prospects as the planet approaches a critical era, as global demand for fossil fuels begins to outstrip supply. World Oil Peak and the inevitable decline of fossil fuels are upon us now, some scientists and policy makers argue in this documentary.\n\nThe consequences of inaction in the face of this global crisis are enormous. What does Oil Peak mean for North America? As energy prices skyrocket in the coming years, how will the populations of suburbia react to the collapse of their dream? Are today&amp;#039;s suburbs destined to become the slums of tomorrow? And what can be done NOW, individually and collectively, to avoid The End of Suburbia?\n\t\n\nHosted by Barrie Zwicker. Featuring James Howard Kunstler, Peter Calthorpe, Michael Klare, Richard Heinberg, Matthew Simmons, Michael C. Ruppert, Julian Darley, Colin Campbell, Kenneth Deffeyes, Ali Samsam Bakhtiari and Steve Andrews. Directed by Gregory Greene. Produced by Barry Silverthorn. \n\n\n\n\nRun Time: 78 Minutes\n\n\nFor more information or to purchase this film, please visit: http://www.endofsuburbia.com/\n\n\n------------------------------------------------------------------------\n\nAdditional information on September 11th, NWO and the great threat to you can be found ator www.prisonplanet.tv\n\n------------------------------------------------------------------------\n","torrent":{"xt":"urn:btih:77593ac0607077e32d5c735429001ab79900f462","amp;dn":"The+End+of+Suburbia+%5BAVI+-+Oil+Depletion+-+Conspiracy+-+Sept+11+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77593ac0607077e32d5c735429001ab79900f462","infoHashBuffer":{"type":"Buffer","data":[119,89,58,192,96,112,119,227,45,92,115,84,41,0,26,183,153,0,244,98]},"announce":[],"urlList":[]}}