{"title":"Concise Herb Guide (2015).pdf Gooner","uid":12337064,"size":57109617,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:77bb04eeeeb99f9fecc384372af03cf2f8a97713&amp;dn=Concise+Herb+Guide+%282015%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1441250714,"description":"Publisher: Featherstone Education (May 21, 2015)\nLanguage: English\nISBN-10: 1472922352\nISBN-13: 978-1472922359\n\nThis beautifully illustrated mini field guide is packed with information on the most common herbs from around the world. Many of these plants grow wild in Britain and other parts of Europe, and can also be cultivated in gardens. The guide additionally includes exotic but commonly used species such as Vanilla, Cloves, Cinnamon and Star-anise. More than 180 herbs are included, all of which are illustrated with superb full-colour artworks that show details of the flowers and leaves, roots and bark where applicable, and growth habit of each plant. A concise written account covering culinary, medicinal and other uses, size, description, habitat and distribution appears on the same page. The easy-to-follow layouts and superb artworks aid quick and accurate identification, making this book an indispensable reference in the field as well as at home. It is compact enough to fit in the pocket, yet packed with essential information. To protect it against the elements in the field, the book is wrapped in a durable plastic wallet. Also included is a fold-out insert with at-a-glance illustrations showing herbs grouped by colour. Renowned natural history artists Christine Hart-Davis, Bridgette James and David Sutton painted the illustrations","torrent":{"xt":"urn:btih:77bb04eeeeb99f9fecc384372af03cf2f8a97713","amp;dn":"Concise+Herb+Guide+%282015%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77bb04eeeeb99f9fecc384372af03cf2f8a97713","infoHashBuffer":{"type":"Buffer","data":[119,187,4,238,238,185,159,159,236,195,132,55,42,240,60,242,248,169,119,19]},"announce":[],"urlList":[]}}