{"title":"Functional Polymers in Food Science Vol 2","uid":12567201,"size":3530316,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:78ac65d3584559a623b069f1f06e2c72323a360c&amp;dn=Functional+Polymers+in+Food+Science+Vol+2&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1444796027,"description":"Functional Polymers in Food Science From Technology to Biology, Volume 2 - Food Processing(Wiley, Scrivener, 2015).pdf\r\n\r\nISBN 978-1-118-59518-3\r\n\r\nPolymers are an important part in everyday life; products made from polymers range from sophisticated articles, such as biomaterials, to aerospace materials. One of the reasons for the great popularity exhibited by polymers is their ease of processing. Polymer properties can be tailored to meet specific needs by varying the &quot;atomic composition&quot; of the repeat structure, by varying molecular weight and by the incorporation (via covalent and non-covalent interactions) of an enormous range of compounds to impart specific activities.\r\n\r\nIn food science, the use of polymeric materials is widely explored, from both an engineering and a nutraceutical point of view. Regarding the engineering application, researchers have discovered the most suitable materials for intelligent packaging which preserves the food quality and prolongs the shelf-life of the products. Furthermore, in agriculture, specific functionalized polymers are used to increase the efficiency of treatments and reduce the environmental pollution. In the nutraceutical field, because consumers are increasingly conscious of the relationship between diet and health, the consumption of high quality foods has been growing continuously. Different compounds (e.g. high quality proteins, lipids and polysaccharides) are well known to contribute to the enhancement of human health by different mechanisms, reducing the risk of cardiovascular disease, coronary disease, and hypertension.\r\n\r\nThis second volume focuses on the importance of polymers and functional food and in food processing","torrent":{"xt":"urn:btih:78ac65d3584559a623b069f1f06e2c72323a360c","amp;dn":"Functional+Polymers+in+Food+Science+Vol+2","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78ac65d3584559a623b069f1f06e2c72323a360c","infoHashBuffer":{"type":"Buffer","data":[120,172,101,211,88,69,89,166,35,176,105,241,240,110,44,114,50,58,54,12]},"announce":[],"urlList":[]}}