{"title":"Jennifer Lopez feat. Pitbull - Fresh Out The Oven  (2nafish)","uid":5331625,"size":109418500,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:78c02f3176397b535c091ff4929dcd0a1ad59bff&amp;dn=Jennifer+Lopez+feat.+Pitbull+-+Fresh+Out+The+Oven++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1265194520,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Fresh Out the Oven&quot; is a song performed by American R&amp;B singer Jennifer Lopez, featuring additional vocals from American rapper Pitbull. In October 2009, People magazine reported that the song is just a promotional/buzz single and that it will not appear on Lopez's forthcoming seventh studio album titled Love?. However, in November and December 2009, MTV and Rap-Up magazine reported that contrary to previous reports, the song will be included on the album.\n\nThe song is officially titled &quot;Fresh Out the Oven - Starring Jennifer Lopez as Lola and featuring Pitbull&quot; but this has been shortened to &quot;Fresh Out the Oven - Lola featuring Pitbull&quot; which is how it appears on the charts.\n\nOn September 13, 2009, on the red carpet for the 2009 MTV Video Music Awards, Miami-based rapper Pitbull revealed that he recorded a track with Lopez and that it will be released as the first single from her upcoming album. He also said that a music video for the song has already been shot, he described the video as having a sexy Eyes Wide Shut theme. The song, initially confirmed as &quot;Lola&quot;, was produced by The Neptunes. It was later revealed that the song is actually called &quot;Fresh Out The Oven&quot;. People Magazine later reported that, &quot;Fresh Out the Oven&quot;, is just a buzz track, not the first single, and that it will not appear on the new album.\n\nRumors had surfaced that that Lopez had adopted 'Lola', as her alter-ego, however, this was confirmed as false by president of Epic Records, Amanda Ghost. She said &quot;It's something fun. She hasn't become Sasha Fierce (BeyoncÃƒÂ©'s artistic alter ego). There won't be anything to do with Lola on her Love? album&quot;. &quot;This is a hot club record that the label loved and Jennifer thought was fun, Jennifer and Pitbull got together and the record leaked. Lola is a fun character just for this song&quot;. On November 5, 2009, MTV gave a sneak peak of the music video and reported that contrary to previous reports the song will be included on the album.\n\nIn October 2009, a number of viral websites have been set up to promote the song, all under the name of Who is Lola, the websites include WhoisLola.com, a MySpace page, and a Twitter account. They all feature a dancing female figure named Lola. Lopez was in attendance at the LIV Nightclub in Miami on October 24, 2009, where the music video for &quot;Fresh Out the Oven&quot; was previewed with official remix by Hex Hector also being previewed. It was also reported that the production duo and DJs the Jump Smokers had produced an official remix which was also supposed to be previewed but for undisclosed reasons it was shelved.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:78c02f3176397b535c091ff4929dcd0a1ad59bff","amp;dn":"Jennifer+Lopez+feat.+Pitbull+-+Fresh+Out+The+Oven++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78c02f3176397b535c091ff4929dcd0a1ad59bff","infoHashBuffer":{"type":"Buffer","data":[120,192,47,49,118,57,123,83,92,9,31,244,146,157,205,10,26,213,155,255]},"announce":[],"urlList":[]}}