{"title":"Idris Muhammad - House of the Rising Sun (1976) [Soul Jazz][mp3","uid":4879785,"size":108722292,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:79b438e4d59c6a98767677a76420f172fa521fdd&amp;dn=Idris+Muhammad+-+House+of+the+Rising+Sun+%281976%29+%5BSoul+Jazz%5D%5Bmp3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"schon55","files":16,"time":1241320046,"description":"Idris Muhammad - House of the Rising Sun\nYear: 1976\nLabel: CTI (Master Series)\nTotal time: 44:41\nBitrate: 320 kbps\n\nIdris Muhammad's House of the Rising Sun is a legendary soul-jazz album, and for good reason. First there's the fact that, Grady Tate notwithstanding, Idris Muhammad is easily the greatest of all soul-jazz drummers. Next, it is revealed that label boss and producer Creed Taylor was at his most inspired here, and wasn't afraid to err on the rhythm and blues side of the jazz equation. The material is top-notch, and David Matthews, who orchestrated and arranged this date with the exception of one track -- &quot;Sudan&quot; was written by Muhammad and Tom Harrell, and Harrell arranged it -- was on fire. As a bandleader, Muhammad is shockingly effective. Not because one could ever doubt his ability, but because of his reputation as one of the great studio drummers in jazz. Finally, this is the single greatest lineup in Kudu's history, and features the talents of Don Grolnick, Eric Gale, Will Lee, Roland Hanna, Joe Beck, David Sanborn, Michael Brecker, Hugh McCracken, Bob Berg, Fred Wesley, Patti Austin, and a dozen others playing their asses off. From the title track which opens the album, with Austin reaching the breaking point in her delivery, to the stunningly funky groove in Ashford and Simpson's &quot;Hard to Face the Music,&quot; to the minor key funk of the Chopin-adapted theme in &quot;Theme for New York City,&quot; to &quot;Sudan&quot;'s triple-timed drums and killer Eastern-tinged hooks, and a read of the Meters' &quot;Hey Pocky A-Way,&quot; with Eric Gale's dirty finger poppin' bass atop McCracken's bluesed-out slide work, this is a steaming, no let-up album. Add to this a gorgeous version of the Ary Barroso Brazilian jazz classic &quot;Bahia,&quot; and you have the set for a classic jazz album. But the complete disregard for the political correctness of &quot;Jazz&quot; itself, in order to get the deeply funky and soulful grooves across, is what makes this set so damn special and even spiritual in its inspiration. Jazz purists lost all credibility when they slagged this one off, caught as they were in tainted, even racist views of the past that made no allowances for jazz musicians to actually follow their time-honored tradition of mining the pop music of the day to extend the breadth and reach of jazz itself. Anybody who wants to believe that George Gershwin is somehow more important than George Porter Jr. is already lost in his own cultural fascism. Muhammad, who understands this better than anyone, pulled out all the stops here and blasted out one amazingly tough, funky slab. Brilliant. ~ Thom Jurek, AMG\n\nPersonnel:\nIdris Muhammad (Drums and Percussion) \nEric Gale (Guitar and Bass Guitar) \nRonnie Cuber (Baritone Saxophone) \nTom Harrell (Trumpet) \nBarry Rogers (Trombone) \nFred Wesley (Trombone) \nWilbur Bascomb (Bass) - 2,4,5,7 \nWill Lee (Bass) - 1,8 \nDon Grolnick (Piano) - 2,3,6,7 \nLeon Pendarvis (Piano) - 1,8 \nRoland Hanna (Piano) - 4,5 \nGeorge Young (Tenor Saxophone) - 1,3,4,6 \nDavid Sanborn (Alto Saxophone) - 1-6,8 \nGeorge Devens (Percussion) \nJoe Beck (Guitar) - 3 \nFrank Loyd (Vocals) - 1-6 \nAlan Shulman (Cello) - 1-6 \nSeymour Barab (Cello) - 1-6 \nCharles McCracken (Cello) - 1-6 \nHarry Cykman (Violin) - 1-6 \nMax Ellen (Violin) - 1-6 \nPaul Gershman (Violin) - 1-6 \nEmanuel Green (Violin) - 1-6 \nHarold Kohon (Violin) - 1-6 \nCharles Libove (Violin) - 1-6 \nJoe Malin (Violin) - 1-6 \nDavid Nadien (Violin) - 1-6 \nPatti Austin (Vocals) - 2,6 \nHilda Harris (Vocals) - 2,6 \nDebbie McDuffie (Vocals) - 2,6 \n\n Idris Muhammad - House of the Rising Sun Tracks:\n01  House of the Rising Sun (Traditional) 4:42 \n02  Bahia (Boogie Bump) (Ary Barroso/Ray Gilbert) 4:38 \n03  Hard to Face the Music (Nickolas Ashford/Valerie Simpson) 4:48 \n04  Theme for New York City (Based on Chopin's Prelude in E Minor, Op. 28, (Frederic Chopin) 3:25 \n05  Sudan (Tom Harrell/Idris Muhammad) 10:52 \n06  Hey Pocky A-Way (Ziggy Modeliste/Art Neville/Leo Nocenteli/George Porter, Jr.) 6:07 \n07  Pipe Stem (Idris Muhammad) 5:28 \n08  I Know You Don't Want Me No More (Barbara George) 4:41","torrent":{"xt":"urn:btih:79b438e4d59c6a98767677a76420f172fa521fdd","amp;dn":"Idris+Muhammad+-+House+of+the+Rising+Sun+%281976%29+%5BSoul+Jazz%5D%5Bmp3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79b438e4d59c6a98767677a76420f172fa521fdd","infoHashBuffer":{"type":"Buffer","data":[121,180,56,228,213,156,106,152,118,118,119,167,100,32,241,114,250,82,31,221]},"announce":[],"urlList":[]}}