{"title":"Bristow","uid":8198051,"size":275626101,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:79be3fb658d6e565f6bec493dffd4aecb8d871c6&amp;dn=Bristow&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gruntfutock","files":-1,"time":1361959645,"description":"Bristow was a comic strip character whose everyday office life was recorded in over 10,000 &quot;Bristow&quot; strips created and drawn by Frank Dickens. According to Guinness World Records &quot;Bristow&quot; was the &quot;longest running daily cartoon strip by a single author&quot; since its first publication in the Aberdeen Press &amp; Journal in September 1961.\n\nThe cartoons follow the daily life of a buying clerk who works in the monolithic Chester-Perry building. He is a fantasist and has delusions of grandeur, wishing he were a brain surgeon and a writer. His epic tome Living Death in the Buying Department has yet to find a publisher, but he is not discouraged. He lives in a small bedsit in East Winchley and commutes to work by train, invariably arriving late. Bristow is surrounded by co-workers, Fudge (his overbearing manager), Jones, Hewitt, Dimkins, hapless typist Miss Sunman, master chef Gordon Blue, the Postboy and the ever-gossiping Mrs. Purdy the Tealady. Bristow has a crush on routine visitor Miss Pretty of &quot;Kleenaphone&quot;. Another regular visitor is the pigeon who sits on a window ledge. During the winter, the bird travels to a warmer climate where she visits Bristow's counterpart, a black man in a white suit. Bristow invariably holidays at a beach resort known as Funboys Sur La Plage.\n","torrent":{"xt":"urn:btih:79be3fb658d6e565f6bec493dffd4aecb8d871c6","amp;dn":"Bristow","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79be3fb658d6e565f6bec493dffd4aecb8d871c6","infoHashBuffer":{"type":"Buffer","data":[121,190,63,182,88,214,229,101,246,190,196,147,223,253,74,236,184,216,113,198]},"announce":[],"urlList":[]}}