{"title":"10 Minute Solution Yoga for Beginners with Angie Stewart [MP4]","uid":12018598,"size":858385158,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:7ae08f6cb8c0701daaf2eccd4843f29d07f55e67&amp;dn=10+Minute+Solution+Yoga+for+Beginners+with+Angie+Stewart+%5BMP4%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"elessedilgirl","files":6,"time":1434359469,"description":"No time to exercise? We have the solution for you - the 10 Minute Solution! Everyone can find at least ten minutes in their day, and we've developed 5 yoga segments that are just 10 minutes each. The easy to follow workout will show you how to gain all the strength, flexibility, and mind-calming benefits that yoga has to offer. Plus with these mini segments, yoga can fit into even the busiest of schedules. Split the programs into 5 separate routines or do them all together for one incredible, invigorating, mind and body workout!\n\nYoga for Balance &amp; Flexibility: Stretch your muscles and increase your range of motion while improving your balance, posture, and overall confidence.\n\nYoga for Strength &amp; Toning: This total body tone up will strengthen your muscles while increasing flexibility. Over time you will see yourself become noticeably fitter and undeniably firmer.\n\nEnergizing Flow Yoga: Flow through simple, revitalizing yoga movements to add extra energy to your day. It's a great way to begin the morning or to give you that mid-afternoon energy boost.\n\nCore Strength: Learn how to engage core muscles you never even knew you had! After this segment you'll not only feel stronger, but you'll also feel leaner and firmer in your midsection.\n\nStress Relief Yoga: Dissolve tension and relax tight muscles using these soothing, restorative poses. This gentle segment will relieve the effects of everyday stress and leave you feeling calm and refreshed.\n\nVideo; x264; 710*480 (4:3); 1964 kbps; 29.970 fps\nAudio; aac; 160 kbps; 2 ch; 48.0 Khz","torrent":{"xt":"urn:btih:7ae08f6cb8c0701daaf2eccd4843f29d07f55e67","amp;dn":"10+Minute+Solution+Yoga+for+Beginners+with+Angie+Stewart+%5BMP4%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ae08f6cb8c0701daaf2eccd4843f29d07f55e67","infoHashBuffer":{"type":"Buffer","data":[122,224,143,108,184,192,112,29,170,242,236,205,72,67,242,157,7,245,94,103]},"announce":[],"urlList":[]}}