{"title":"Io No Spik Inglish, [DivX - Ita Mp3] Commedia [Tntvillage.Scambi","uid":4939690,"size":728752630,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7cd81bd91827a423bd0ac92b81fe62d65ad584ad&amp;dn=Io+No+Spik+Inglish%2C+%5BDivX+-+Ita+Mp3%5D+Commedia+%5BTntvillage.Scambi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"year2012","files":1,"time":1244400536,"description":"Io No Spik Inglish, [DivX - Ita Mp3] Commedia [Tntvillage.Scambioetico]\n\nVisit this link: http://www.tntvillage.scambioetico.org/?act=allreleases&amp;st=0&amp;filter=Io%20No%20Spik%20Inglish&amp;sb=1&amp;sd=0&amp;cat=0\n\nVisit this link: http://www.tntvillage.scambioetico.org/?act=allreleases&amp;st=0&amp;filter=pir8&amp;sb=1&amp;sd=0&amp;cat=0\n\nIo No Spik Inglish\nby pir8\n\nLocandina &lt;a href=&quot;\nhttp://i54.photobucket.com/albums/g109/pir8/Film/IoNoSpikInglish.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i54.photobucket.com/albums/g109/pir8/Film/IoNoSpikInglish.jpg&lt;/a&gt;\n\nVisit the IMDB link: http://www.Imdb.com/title/tt0113436\n\nTrama\nSergio Colombo (Paolo Villaggio) ÃƒÂ¨ un assicuratore la cui compagnia viene assorbita dalla British Found Insurance, una multinazionale inglese. Ovviamente deve sapere l'inglese, di cui perÃƒÂ² non capisce una parola. Minacciandolo di licenziamento, il padrone lo obbliga a partire per un corso di Full Immersion ad Oxford. In questo modo la moglie Paola (Paola Quattrini) e la figlia Betta sono costrette a trascorrere le vacanze estive in Sardegna senza Sergio. Questi, arrivato ad Oxford, incontra Fred Livingstone (Ian Price) e sua moglie Linda (Carolyn Pickles), i padroni della scuola, che gli mostrano i compagni di corso, i quali sono bambini. Colombo ne passa di tutti i colori: sveglia alle 6, 8 ore di inglese piÃƒÂ¹ compito a giorno, a letto alle 9 di sera. La scuola organizza varie attivitÃƒÂ : alla mostra dell'istituto dove hanno studiato anche i Windsor distrugge una opera di Canaletto da 1 milione di sterline. In seguito, a causa della morte della zia di Linda, viene cancellata l'attivitÃƒÂ  clou della settimana: la visita a Londra e ai suoi monumenti. Sergio si offre allora, data la sua etÃƒÂ , come accompagnatore e la combricola viene autorizzata da Fred e Linda a partire senza di loro. Una volta a Londra perÃƒÂ² Sergio incontra alcuni tifosi sampdoriani in trasferta per la partita Arsenal-Sampdoria di Coppa delle Coppe e non resiste alla tentazione di andare allo stadio portandosi dietro, ovviamente, i suoi giovani compagni di corso. Una volta allo stadio ÃƒÂ¨ obbligato perÃƒÂ² a infiltrarsi nella curva dell'arsenal. La finzione dura solo fino al gol sampdoriano, quando Sergio non si trattiente e esulta da solo quando tutti gli hoolingans, invece, tacciono delusi. Le avventure londinesi continuano con la visita a un locale hard e con l'incontro con Patrizia una giovane bella romana con cui Sergio si illude di avere una intensa quanto breve storia d'amore estiva. In realtÃƒÂ  Patrizia ÃƒÂ¨ una prostituta pagata dai compagni di corso di Sergio, desiderosi di regalare al loro anziano compagno emozioni che la moglie Paola non sembra piÃƒÂ¹ regalargli. Tutto si conclude in realtÃƒÂ  con un nulla di fatto e Patrizia, colpita dalla bontÃƒÂ  e dalla simpatia di Sergio, si rifiuta di ricevere il compenso per un rapporto, peraltro, mai avvenuto. Al ritorno da Londra Sergio viene perÃƒÂ² espulso per il ritardo e la cattiva condotta. Ma ormai Sergio ha imparato l'inglese: all'aeroporto di Heathrow incontra il suo capo e gli mostra le sue nuove conoscenze tanto che Sergio viene reintegrato nella compagnia assicurativa presso la quale lavorava.\n\n\nScreenshots\n Visit this link: http://i54.photobucket.com/albums/g109/pir8/Film/IoNoSpikInglish-1.jpg\n\nScheda tecnica\nNome File:        Io No Spik Inglish.avi\nDimensione:       728,752,630 Bytes\nDurata:           1:27:26\nVideo Codec:      DivX 5.0.5 Beta (Tahanea)\nVideo Bitrate:    973 kb/s\nRisoluzione:      512x288\nFrames/sec:       25.000\nQF:               0.264 b/px\nAudio Codec:      0x0055 MPEG-1 Layer 3\nAudio Bitrate:    128 kb/s\nFreq Audio:       44100 Hz\n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:7cd81bd91827a423bd0ac92b81fe62d65ad584ad","amp;dn":"Io+No+Spik+Inglish%2C+%5BDivX+-+Ita+Mp3%5D+Commedia+%5BTntvillage.Scambi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7cd81bd91827a423bd0ac92b81fe62d65ad584ad","infoHashBuffer":{"type":"Buffer","data":[124,216,27,217,24,39,164,35,189,10,201,43,129,254,98,214,90,213,132,173]},"announce":[],"urlList":[]}}