{"title":"Eye Hate God - Dopesick 320k  mp3  ak2014","uid":10508195,"size":103308175,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7d143d70d01fdee4a7078b843522d6220c0f10be&amp;dn=Eye+Hate+God+-+Dopesick+320k++mp3++ak2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"analogkid6103","files":20,"time":1404812708,"description":"Eye Hate God - Dopesick 320k  mp3  ak2014 What we got Southern Sludge with....  Eyehategod (also abbreviated and referred to as EHG) is an American sludge metal band from New Orleans who formed in 1988.[1] They have become one of the most well known bands to emerge from the NOLA metal scene. Throughout the years, their core line-up has remained, with the exceptions of the bass guitarist, a slot in which several musicians have played, and the death of drummer Joey LaCaze in 2013.\n\nEyehategod have noted Melvins, Carnivore, The Obsessed, Discharge, Black Flag, Corrosion of Conformity, Black Sabbath, Celtic Frost, Confessor and Saint Vitus as key influences to their sound. Heavy, detuned, and bluesy guitar riffs dominate the band's discography. They are combined with walls of feedback and tortured vocals to create a harsh misanthropic vibe. Their records had been released consistently by Century Media Records though the band's most recent output is on Emetic Records, not including the numerous splits released under various labels. The band was friends with Anal Cunt and performed with them for the first show after their frontman Seth Putnam came out of his coma. Anyway this is what I got if you want you know what to do..........","torrent":{"xt":"urn:btih:7d143d70d01fdee4a7078b843522d6220c0f10be","amp;dn":"Eye+Hate+God+-+Dopesick+320k++mp3++ak2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d143d70d01fdee4a7078b843522d6220c0f10be","infoHashBuffer":{"type":"Buffer","data":[125,20,61,112,208,31,222,228,167,7,139,132,53,34,214,34,12,15,16,190]},"announce":[],"urlList":[]}}