{"title":"Ander.2009.DVDSCR.XviD.EspAntAlhO","uid":5413539,"size":736314578,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7d748af42b19dcb7d6bcd328e6e9f8b3f5fe30d9&amp;dn=Ander.2009.DVDSCR.XviD.EspAntAlhO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"noriegaRJ","files":-1,"time":1267827419,"description":"Title: Ander\nYear: 2009\nCountry: Spain\nAudio: Basque and Spanish\nSource: DVDRIP\nSize: 702 MB \nGenre: Drama\nRuntime: 128 min \nVideo Codec: XVID\nAudio Codec: MP3\nIMDB Note: 7.2\nIMDB Link: http://www.imdb.com/title/tt1351734/\nDirected by: Roberto CastÃƒÂ³n\nStarring: Joxean Bengoetxea ...  Ander \n Christian Esquivel ...  Jose\n Pilar RodrÃƒÂ­guez ...  Madre  \n Jose Kruz Gurrutxaga ...  Panadero \n Pedro Otaegi ...  Evaristo \n Mamen Rivera ...  Reme \n Leire Ucha ...  Arantxa\n Eriz Alberdi ...  IÃƒÂ±aki  \n\nSynopis: The valley of Arratia in August 1999. Ander, a farmer well into his forties, lives with his sister Arantxa and his old mother in a remote part of rural Basque country. His is a monotonous life filled with nothing but farm work and a job at the local bicycle factory. It won't be long before Arantxa gets married and leaves home and then Ander will be left to look after their stubborn mother on his own. Then one day Ander has an accident and breaks his leg. His limb will be in a plaster cast for two months. Against his mother's wishes, the family decides to employ a Peruvian immigrant, JosÃƒÂ©, in order to help out. The arrival of the new farm hand has an influence on interpersonal relationships within the family. The old woman, who barely speaks any Spanish, refuses to communicate with JosÃƒÂ©, but Arantxa and Ander soon get to know JosÃƒÂ© quite well. The two men in particular become firm friends. After attending Arantxa's fiancÃƒÂ©s' stag night the men both wind up having sex with a prostitute, Reme. Reme is from Galicia. She is a single mother and very much an outsider, which means that she and JosÃƒÂ© quickly bond. Without realising it, Ander also begins to seek out JosÃƒÂ©'s company more often. When he invites JosÃƒÂ© to Arantxa's wedding this leads to a serious clash with his mother. And then, at a completely unexpected moment, a sexual encounter occurs between the two men... (IMDB)\n\n\nTHIS TORRENT HAS SUBTITLES IN SPANISH (FOR BASQUES DIALOGUES) AND BRAZILIAN PORTUGUESE (COMPLETE, FROM &quot;ESPANTALHO&quot;).\n\n\nThanks to those helping me seed. Leechers remember, the community depends on you. If nobody shares, the freebies go away. Remember, the only reason you can download this free movie is because others are generous enough to keep sharing it with you. If nobody shares, everybody loses, so even if its for an extra hour or two after you get it, remember, others want to see it too, and they can't without you.\n\n\nSEE MY OTHERS UPLOADS:                        &lt;a href=&quot;\nhttp://thepiratebay.se/user/noriegaRJ&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/noriegaRJ&lt;/a&gt;\n","torrent":{"xt":"urn:btih:7d748af42b19dcb7d6bcd328e6e9f8b3f5fe30d9","amp;dn":"Ander.2009.DVDSCR.XviD.EspAntAlhO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d748af42b19dcb7d6bcd328e6e9f8b3f5fe30d9","infoHashBuffer":{"type":"Buffer","data":[125,116,138,244,43,25,220,183,214,188,211,40,230,233,248,179,245,254,48,217]},"announce":[],"urlList":[]}}