{"title":"The Blades Of Grass - Are Not For Smoking","uid":10621609,"size":298628723,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7d7cf2f9c1f46cf930118f25dd4cd4a139f55949&amp;dn=The+Blades+Of+Grass+-+Are+Not+For+Smoking&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Roman_Bornski","files":20,"time":1406172612,"description":"In 1967, one of the most highly competitive periods in popular music, four college students from South Orange and Maplewood, New Jersey were having their own summer of love; one that brought about thrills beyond their wildest dreams. During that monumental year, the Blades Of Grass managed to land a deal with Jubilee Records, tour with some of the biggest names in pop, including the Fifth Dimension, the Dave Clark Five and Neil Diamond, and score a modest hit with a Tony Michaels-Vinny Gormann-penned song called &quot;Happy.&quot; Rev-Ola is proud to present the Blades Of Grass's entire released output on CD for the first time ever. Featuring rare photos, extensive liner notes by Steve Stanley, and commentary from original band members.\n\nAn Interview With Bruce Ames\n\n60sgaragebands.com (60s): How did you first get interested in music?\nBruce Ames (BA): My father and uncle were musicians from when they were in their teens.  My uncle made it a career, forming a small orchestra and playing at various private parties as well as an inaugural ball for President Lyndon Johnson.  My father played in the same orchestra but that career ended with World War II.  He always amazed me, later in his life, with his ability to pick up his trumpet after hearing, e.g., a Beatles' song and then playing it by &quot;seeing/hearing&quot; the notes in his head. I played piano, clarinet and saxophone until I decided I wanted to learn how to play the guitar.  Marc Black helped to teach me.\n\n60s: Was The Furnace Men your first band?\nBA: Yes, The Furnace Men was my first musical group.\n\n60s: According to Marc, Bill and Steve Jerome suggested the name change to The Blades of Grass.  How did you first hook up with the Jeromes?\nBA: Indeed, the Jeromes changed our name to The Blades of Grass.  They thought that our sound was bright and clear, and that The Furnace Men sounded dark and dirty.  As our producers, we had no choice but to reluctantly agree to the name change. My recollection about hooking up with the Jeromes is that they came with Jubilee Records but I'm not sure.  We were simply told that they would be our producers.\n\n60s: How did you hook up with your managers, Frank Latagona and Walter Gollander?\nBA: Walter Gollander approached us at a dance, stating that he could get us a recording contract if we agreed to have him (and his partner, Frank Latagona) be our manager.\n\n60s: We asked Marc this, but would appreciate your thoughts: The Blades Of Grass recorded and released two singles that had to compete against versions by other well know '60s bands: 'Happy' by The Sunshine Company, and 'I Love You Alice B. Toklas' by Harper's Bizarre. What were the band's thoughts at the time, knowing that your singles might not sell as much as they would if there weren't simultaneously competing versions?\nBA: We were blindsided and shocked when we were informed that there was another version of 'Happy.'  As I remember it, our managers were equally surprised and upset.  For 'I Love You Alice B. Toklas,' we were aware of rumors that there might be another version but didn't think too much about it.  With 'Happy' we sincerely believed that our version was far better, having taken the demo of it and reworking it into a much prettier song with an improved tempo (my and my family's opinion).  The other version basically took the demo and recorded it the same way. We toured, did radio and TV, determined to be successful despite the West Coast competition.  We were crushed and frustrated when we realized that our sales and popularity would be limited by the other version.  Nevertheless, we had a great time performing.  For four guys in high school it was quite a hoot.\n\n60s: What were the circumstances leading to the band's opportunity to record your 45s?\nBA: Our first 45 was 'Happy' and with its success we recorded our album plus several singles.  The recording of the Are Not For Smoking album was, also, a direct result of the success we had with 'Happy.'\n\n60s: Do you have any special recollections about your recording session(s)? \nBA: The recording sessions were long and arduous.  We really did strive for perfection and did take after take until we were satisfied.  We had very little input with the arrangements.  The Jeromes would listen to our opinions and then do what they thought was best.\n\n60s: Are there any other Blades Of Grass recordings? Are there any vintage live recordings, or other unreleased tracks?\nBA: One of the best songs that we recorded but that was never released was 'Mary Elizabeth', but, after 'Happy', I really like 'Charlie and Fred.'  Great harmony, acappella sections, and a big orchestra behind us including french horns, kettle drums, bassoons, base clarinets, trumpets, etc.  I would love to get a copy of 'Mary Elizabeth' but I've never heard it outside of the recording studio. On the single, 'You Won't Find That Girl,' all of the vocals in that song are my voice, where I'm singing harmony with myself.  One of our songs, 'Pageant,' was originally recorded by one of my brothers in my parents' living room, and was used, along with live auditions, to get us our recording contract with Jubilee.  Our success with 'Happy' ultimately led to a contract with The William Morris Agency in New York, the largest talent agency in the country back in the day.  I got a kick out of seeing our name on their alphabetized letterhead right in between The Beach Boys and The Buckinghams.\n\n60s: I asked Marc, &quot;Today, you're classified as a &quot;sunshine pop&quot; group. Was there a conscious effort on the part of the band to record music in this vein?&quot;  His answer was no.  Are you aware of the &quot;sunshine pop&quot; genre?  Thoughts?\nBA: I'm aware of the sunshine pop genre now but was not in the '60s.  I believe that the pervasiveness of The Beatles influenced us but, otherwise, we prided ourselves in our work ethic which resulted in a product that was head and shoulders above our competition.  We totally dominated local &quot;battle of the bands&quot; with how polished our performances were.  When we went on tour the feedback we received was very complementary, especially when people realized we were about 18 years old.  We played with some impressive people including Stevie Wonder, The Four Seasons, The Young Rascals, The Fifth Dimension, Van Morrison, Neil Diamond, The Dave Clark Five, Jim Morrison and The Doors, etc.  Our venues varied from a huge outdoor nighttime concert at a race track in Pennsylvania to The Bitter End Cafe in New York City's Greenwich Village to The Steel Pier outside of Philadelphia to Constitution Hall in Washington, D.C.\n\n60s: Do you have any specific recollections on either the Joe Franklin Show or Upbeat TV appearances? \nBA: Joe Franklin's Memory Lane was a venerable TV show from New York City.  The appearance enabled us to talk with a legendary TV personality and for our families to see us on local TV.\n\n60s: What year and why did the band break up?\nBA: The band fell apart after I made the decision to dedicate the out-of-classroom time I had to my studies rather than rehearsing and performing.  Vietnam was raging at the time, and, since I was a boy, I aspired to be, not a musician, but a physician.  So I withdrew from the band, buried my nose in my books, went to medical school, and I'm thoroughly enjoying my wife, my grown children and my 32 years (and counting) in the private practice of medicine.  My experience with The Blades of Grass was a lot of work but the benefits were great with many &quot;once in a lifetime&quot; experiences.  I've got a lot of wonderful memories, and get a kick out of seeing the expressions on my kids' faces when they listen to their dad perform.\n\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n ","torrent":{"xt":"urn:btih:7d7cf2f9c1f46cf930118f25dd4cd4a139f55949","amp;dn":"The+Blades+Of+Grass+-+Are+Not+For+Smoking","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d7cf2f9c1f46cf930118f25dd4cd4a139f55949","infoHashBuffer":{"type":"Buffer","data":[125,124,242,249,193,244,108,249,48,17,143,37,221,76,212,161,57,245,89,73]},"announce":[],"urlList":[]}}