{"title":"TeamViewer 3.8.04 - [Prince.Ariq]","uid":4572071,"size":1652859,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7e29a9468b03929e44662f8b5c5fc339c2b57534&amp;dn=TeamViewer+3.8.04+-+%5BPrince.Ariq%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Ariq","files":3,"time":1229092794,"description":"TeamViewer 3.8.04 - [Prince.Ariq]\n\nDesktop Sharing - Remote Control - Support. Simple - fast - secure.TeamViewer establishes connections to any PC all around the world within just a few seconds. You can remote control your partner's PC as if you were sitting in right front of it. Find out why more than 4.000.000 users trust TeamViewer.TeamViewer is a simple and fast solution for remote control, desktop sharing and file transfer that works behind any firewall and NAT proxy. To connect to another computer just run TeamViewer on both machines without the need of an installation procedure. With the first start automatic partner IDs are generated on both computers. Enter your partner's ID into TeamViewer and the connection is established immediately. With many thousand users worldwide TeamViewer is a standard tool to give support and assistance to people in remote locations. The software can also be used for presentations, where you can show your own desktop to a partner. TeamViewer also is VNC compatible and offers secure, encrypted data transfer with maximum security. TeamViewer is completely free for private use.","torrent":{"xt":"urn:btih:7e29a9468b03929e44662f8b5c5fc339c2b57534","amp;dn":"TeamViewer+3.8.04+-+%5BPrince.Ariq%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e29a9468b03929e44662f8b5c5fc339c2b57534","infoHashBuffer":{"type":"Buffer","data":[126,41,169,70,139,3,146,158,68,102,47,139,92,95,195,57,194,181,117,52]},"announce":[],"urlList":[]}}