{"title":"Tweetbot 2.3.3 [MAC OS X]","uid":13488805,"size":17751803,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:7e7f496d993e598580e81be482a95c52768276fa&amp;dn=Tweetbot+2.3.3+%5BMAC+OS+X%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"iAlexander","files":1,"time":1455104933,"description":"MADE IN UKRAINE\r\n\r\nTweetbot 2.3.3 – Popular Twitter client.\r\n\r\nTweetbot is a full-featured OS X Twitter client with a lot of personality. Whether it’s the meticulously-crafted interface, sounds and animation, or features like multiple timelines and column views, there’s a lot to love about Tweetbot.\r\nFeatures:\r\nMultiple Timelines. Quickly switch between your lists as your main timeline.\r\nMultiple Windows and Columns. Display timelines from different accounts side by side.\r\nNotification Center support.\r\nBeautiful Retina graphics.\r\nMute filters lets you block messages from users without unfollowing them. You can also mute hashtags and specific keywords.\r\nSync timeline position, direct message read statuses, and mute filters between your Mac, iPhone, and iPad via iCloud.\r\nSupport for multiple services like Pocket, Instapaper, Readability, CloudApp, and Droplr.\r\nSave drafts, add locations and POI’s, attach photos/videos, manage your lists, and much more.\r\n\r\nWhat's new in version 2.3.3:\r\n- Stars are now Hearts, Favorites are now Likes. They still behave exactly like they always have, just think of it as quick coat of paint to better match Twitter's display guidelines.\r\n- Better handling of view sizes when using a single column in full screen\r\n- If iCloud Drive isn't enabled, you'll see a warning asking you to enable it.\r\n- If the window is fullscreen and the screen resolution changes, the window will now resize properly\r\n- Copying and pasting an image file from the Finder into a compose window now pastes the image properly\r\n- Better handling of window sizing when dragging multiple images into a new tweet window\r\n- Fixed the issue where using shift-space/page down could scroll past partially visible tweets\r\n- Fixed an issue where double-clicking on a quoted tweet would open the status detail for the quoted tweet and the original tweet\r\n- When posting tweets with large images, you should see less 'Media parameter is invalid' errors\r\n- Other minor stability improvements\r\n\r\nMADE IN UKRAINE","torrent":{"xt":"urn:btih:7e7f496d993e598580e81be482a95c52768276fa","amp;dn":"Tweetbot+2.3.3+%5BMAC+OS+X%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e7f496d993e598580e81be482a95c52768276fa","infoHashBuffer":{"type":"Buffer","data":[126,127,73,109,153,62,89,133,128,232,27,228,130,169,92,82,118,130,118,250]},"announce":[],"urlList":[]}}