{"title":"million.dollar.traders.s01e02.ws.pdtv.xvid-remax.avi","uid":4678311,"size":733960192,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7e8e2e5870e379e5390d97fefd571873e91b563a&amp;dn=million.dollar.traders.s01e02.ws.pdtv.xvid-remax.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tcast","files":1,"time":1232979033,"description":"Eight ordinary people are given a million dollars, a fortnight of intensive training and two months to run their own hedge fund. Can they make a killing?\n\nThe experiment reveals the inner workings of a City trading floor. The money is supplied by hedge fund manager Lex van Dam: he wants to see if ordinary people can beat the professionals, and he expects a return on his investment too. Yet no-one foresees the financial crisis that lies ahead.\n\nThe traders were selected in spring 2008, before the US credit crisis gathered pace. The successful candidates were chosen, trained and dispatched to their specially created trading room in the heart of the Square Mile. Among them are an environmentalist, a soldier, a boxing promoter, an entrepreneur, a retired IT consultant, a vet, a student and a shopkeeper.\n\nAs the novices learn the dark art of trading stocks and shares, the financial markets start to buckle. Making money takes second place to basic survival as the brutal realities of global economics take their toll on the traders. How do they cope? Will they secure themselves a bonus, or walk away with nothing?","torrent":{"xt":"urn:btih:7e8e2e5870e379e5390d97fefd571873e91b563a","amp;dn":"million.dollar.traders.s01e02.ws.pdtv.xvid-remax.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e8e2e5870e379e5390d97fefd571873e91b563a","infoHashBuffer":{"type":"Buffer","data":[126,142,46,88,112,227,121,229,57,13,151,254,253,87,24,115,233,27,86,58]},"announce":[],"urlList":[]}}