{"title":"Todd Rundgren - Liars 2004 TQMP [FLAC]","uid":4519588,"size":549532484,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7f011803a39effd147173a49346d0f66bf60ff03&amp;dn=Todd+Rundgren+-+Liars+2004+TQMP+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Breezin","files":6,"time":1227112503,"description":"Quote from amazon.com (avg 4,5 stars)\n\n&quot;Liars&quot; is, simply, a triumph. After a string of underrated albums in the 90's, an album of bossa nova remixes, and an odds n' ends stopgag, Todd Rundgren has delivered his best album in..well, maybe ever. \n\nThis is not a return to the &quot;Something/Anything?&quot; sound. It still retains the industrial, electronic feel of his TR-i stuff, but he adds a heavy dose of soul, making it a sort of hybrid of old Todd and new Todd. It's mostly synthesizer based (although a guitar pops up on a couple songs), so even when Todd dips into sweet blue eyed soul, it's backed with warm electronics. \n\nAlso, this is a long, dense concept album. Every song deals with the truth of some sort. Whether it's lies about religion, love, politics, or the future. Songs like &quot;Afterlife&quot; and &quot;God Said&quot; (among others) are absolute pinnacles in Todd's songwriting. \n\nThe opener &quot;Truth&quot; (as well as &quot;Living&quot;) straddles the line between intense (the thunderous dance beat, intense synthesizers) and hooky (the pop chorus). It's an entrancing, hypnotic opener. \n\n&quot;Sweet&quot;, on the other hand, is smooth blue eyed soul. The chorus is great, and the bridge is amazing. &quot;Soul Brother&quot; (the most organic sounding thing on here) is a bitter tirade on how phony and pathetic soul music has become in recent years. Although the bitter tone is overshadowed by the incredible catchiness and pop sensibility of the song. \n\n&quot;Stood Up&quot; is both serious and lighthearted, lyrically; if nothing else, it's 5 minutes of lush, electro-pop bliss (with a colorful, almost psychedelic sheen). The industrial rock of &quot;Mammon&quot; attacks organized religion in a harsh way. And &quot;Past&quot; is a gorgeous, heartbreaking ballad, with Todd's vocals oozing soul throughout. \n\nLike &quot;Truth&quot;, &quot;Living&quot; has a pulsating dance beat; it's even more hypnotic than the former, as the chorus hook is to die for (probably the first song on here that really hooked me). All and all, not much else to say but this song ROCKS. There's also a rare guitar solo towards the end! \n\nThe aforementioned &quot;God Said&quot; is another epic ballad with a majestic, ambient feel throughout. As I said, one of Todd's all time greatest lyrical compositions. Just beautiful. Same with &quot;Afterlife&quot;, which has the most euphoric bridge/middle eight I've ever heard. It's truly affecting, emotionally. \n\nOn the closer &quot;Liar&quot;, Todd channels Trent Reznor in the abrasive, metal-like screams on the chorus. Easily the most intense song Todd has done. It was absolutely killer when he did it live, too. \n\nOther highlights include the goofy &quot;Happy Anniversary&quot;, the Prince-like &quot;Flaw&quot; (melodic MF-bombs and all), and the futuristic [duh] &quot;Future&quot;. \n\nBehind &quot;A Wizard, a True Star&quot;, this is my favorite Todd album. And I've heard all of his albums. That's an impressive feat, but this album is *that* good. Don't be put off at first - it's an extremely long album (close to 80 minutes), so it'll take at least 5 listens to sink in. It honestly gets better with each listen - songs I didn't care for the first few times would randomly just 'click', until I got to the point where I loved everything on here! \n\nTruly one of Todd's best, if not *the* best. And that's no lie. \n\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project me and my fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at:  &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\nYou can find all TQMP uploads at: www.thepiratebay.se  (Simply use the TQMP searchtag :)\n\nContact: &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;e5879780809f8c8ba5898c9380cb8b89&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\nGreetings to ya'all from the Breezin Dutchman! d:)","torrent":{"xt":"urn:btih:7f011803a39effd147173a49346d0f66bf60ff03","amp;dn":"Todd+Rundgren+-+Liars+2004+TQMP+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f011803a39effd147173a49346d0f66bf60ff03","infoHashBuffer":{"type":"Buffer","data":[127,1,24,3,163,158,255,209,71,23,58,73,52,109,15,102,191,96,255,3]},"announce":[],"urlList":[]}}