{"title":"Magic Fluids v1.2 apk android {ms5d} [AMRG]","uid":9240999,"size":327326,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:7f05f7bb291a32bad9173df868076b557f3e6dfe&amp;dn=Magic+Fluids+v1.2+apk+android+%7Bms5d%7D+%5BAMRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ms5d","files":4,"time":1385278813,"description":"----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n__________________________________________________________________________________________________________________________\n---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n                 ms5d and Android Mafia Releaser Group AMRG  PROUDLY PRESENTS\n                                                                                   _____________________________________\n\nMagic fluids for Android\n                                                                                   _____________________________________\n\n                                                                                                         File Details:\n                                                                                  ______________________________________\n\nVersion: 1.2\nSize: 314 kb\nRequired: Android 2.2 and up\nPrice: $ 1.94\nRelease time: 2013-October 13\nDevelopers: Mad Scientist,\nGenre: Entertainment\nGoogle Play rating: 4.8/5 \nContent Rating: Everyone                                  \n                                                                               ________________________________________   \n  \nDescription:\n\n\nFluid animation in your pocket! Touch the screen and create beautiful motion of colorful smoke and water.\nKey features of Magic Fluids:\n- Highly configurable fluid behaviour and look\n- 10 configuration presets - if you're lazy\n- You can save your own presets\n- Multitouch controls\n- Smoke (gas) and water (liquid) animation\n- Thousands of particles moving with the fluid\n- You can pause the animation anytime and save screenshots\n- You can use Magic Fluids as a regular app or as a Live Wallpaper\n- Highly optimized, multiple quality settings for wide range of devices\nPossibilities are endless, effects are fantastic.\n\n-------------------------------------------------\n\nDETAILS:\n\nMagic Fluids allows for a great deal of customization. You can modify fluid type, color palette, how long it stays on the screen, when colors should change and much more.\n\nFluid alone is great, but it only gets better. Turn on particles and watch how they move with the fluid and emphasize it's motion. Particles have lots of configuration options as well - shape, size, color and more. You can have more than 15000 particles on the screen, but you better have a strong device if you want to do that!\n\nWhatever configuration you come up with, it would be great to save it and use anytime later. That's what user presets are for - you can store ten fluid presets and load them with a single click!\n\nAre you lazy and don't want to wade through lots of settings? You can use one of ten predefined fluid configurations and still experience a great diversity that Magic Fluids offers! Examples of existing presets are Floating Flames, Wavy Winter or Classy Combination.\n\nMagic Fluids features two fluid animation methods:\n- Smoke - classic gas simulation. Smoke is slow and steady. It's great when you want to slow down and relax\n- Water - uncommon method that makes fluid behaviour more similar to liquid than gas. You can almost feel the pressure propagating through the water while you touch the screen. It's perfect when you want to create dynamic animations and images full of swirls and curls.\n\nWhen you press the Menu Button (hardware button on older devices, three-dot button on newer ones) animation pauses. From there you can clear the screen, go to settings menu or save the screenshot to file on external storage (it goes to /Pictures/MagicFluids/ directory). Note that external storage (which usually means SD Card, but on some devices external storage is actually internal) must be available on your device. You can later use it as a wallpaper or show your friends what you can do with Magic Fluids!\n\nMagic Fluids is primarily intended to be used as a separate application but you can also use it as a Live Wallpaper!\n\nTalking about diversity of devices... Magic Fluids works great on a wide range of them, thanks to multiple quality settings. On first run it will try to guess which is best for your device, but you might want to experiment with them to make sure that your hardware is used to it's limits. Just don't get offended if the most convenient setting turns out to be &quot;I Found My Grandpa's Phone&quot;! :)\n\nWhat's New:\n\nVersion 1.2\nIncludes two new features:\n- Color inversion - gives really interesting color effects and kind of allows to change background color\n- Gravity - makes fluid move when you tilt the device\nThere are two new presets that show the effects in action.\nAdditionaly, a few bugs were fixed, so the app should be more stable now.\n\n\nInstructions:\n\nJust install and play.\n\n\nDon't forget to seed.If you like this then support the developers.","torrent":{"xt":"urn:btih:7f05f7bb291a32bad9173df868076b557f3e6dfe","amp;dn":"Magic+Fluids+v1.2+apk+android+%7Bms5d%7D+%5BAMRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f05f7bb291a32bad9173df868076b557f3e6dfe","infoHashBuffer":{"type":"Buffer","data":[127,5,247,187,41,26,50,186,217,23,61,248,104,7,107,85,127,62,109,254]},"announce":[],"urlList":[]}}