{"title":"Blu Notte - Gianfranco Stevanin [SATrip - DivX - Ita Mp3]","uid":5324454,"size":511251358,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7fa88b4fc27b90b9466ec1a8cd1a8e09882d31a5&amp;dn=Blu+Notte+-+Gianfranco+Stevanin+%5BSATrip+-+DivX+-+Ita+Mp3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Duracell72","files":1,"time":1264969710,"description":"Gianfranco Stevanin nasce il 21 ottobre 1960 a Montagnana, in provincia di Padova da una famiglia di proprietari terrieri, vive i primi anni della sua vita a Terrazzo (VR). Durante questi anni il padre di Gianfranco andrÃƒÂ  spesso a caccia ma il figlio rifiuterÃƒÂ  sempre di scuoiare gli animali insieme al padre provando ribrezzo ad uccidere. All'etÃƒÂ  di 5 anni la famiglia lo manda in un collegio di preti, questo perchÃƒÂ© sua madre attraversa un periodo difficile a causa di una gravidanza che infatti poi non porterÃƒÂ  a termine, dopo l'aborto Gianfranco puÃƒÂ² tornare a casa.\nUna volta cresciuto comincia a dare una mano a suo padre nella gestione delle proprietÃƒÂ  di famiglia, ma un giorno scivola nel fango e sbatte violentemente la testa contro un attrezzo agricolo. In seguito all'incidente i genitori temono che non sia in grado di badare a se stesso in giro per i campi e lo fanno entrare in un collegio di suore, per preservare la sua integritÃƒÂ . Gli anni in collegio sono particolarmente solitari per Gianfranco, non riesce a stringere amicizie e vede raramente i suoi genitori. A 13 anni subisce l'abuso da parte di una donna 24enne sposata e insoddisfatta sessualmente.\nNel 1975 Gianfranco esce dal collegio e solo un anno dopo, il 21 novembre 1976, ÃƒÂ¨ vittima di un grave incidente di moto che comporta un trauma cranico e un grave intervento chirurgico particolarmente delicato. Questo incidente cambia la vita del ragazzo, a causa della degenza perde tutti i suoi pochi amici e come postumi dell'incidente ha un focolaio epilettico. Stevanin trascorre gli anni seguenti tra vari problemi (meningiti e forti emicranie) e cambiamenti comportamentali. Cresciuto comincia ad avere una passione per la pornografia, al punto da fotografare le sue amiche nude o in pose oscene.\n\nInformazioni sul File\n\nTitolo: Blu Notte - Gianfranco Stevanin, Il Mostro di Terrazzo.avi \nDimensione File [in bytes]: 429,191,168\nDurata [hh:mm:ss]: 57:58.040\nNumero di tracce Audio: 1\n\nInformazioni Video\n\nNome Codec Video: DivX 5.1.1 (Maupiti)\nNumero Frame: 86951\nLarghezza Frame [pixels]: 352\nAltezza frame [pixels]: 288 \nDisplay Aspect Ratio [DAR]: 1.222\nFPS: 25.000 \nVideo Bitrate [kbps]: 849\nQF: 0.335\n\nInformazioni Audio Traccia 1\n\nCodec audio: 0x0055 MPEG-1 Layer 3\nFrequenza audio [Hz]: 44100\nBitrate [kbps]: 128","torrent":{"xt":"urn:btih:7fa88b4fc27b90b9466ec1a8cd1a8e09882d31a5","amp;dn":"Blu+Notte+-+Gianfranco+Stevanin+%5BSATrip+-+DivX+-+Ita+Mp3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7fa88b4fc27b90b9466ec1a8cd1a8e09882d31a5","infoHashBuffer":{"type":"Buffer","data":[127,168,139,79,194,123,144,185,70,110,193,168,205,26,142,9,136,45,49,165]},"announce":[],"urlList":[]}}