{"title":"Jello Biafra w/ Melvins -- Never Breathe What You Can't See","uid":4966824,"size":299167464,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:818d66ccfe4f4958a7ce5bb55814df2fadda5d96&amp;dn=Jello+Biafra+w%2F+Melvins+--+Never+Breathe+What+You+Can%5C%27t+See&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"kislithepothead","files":14,"time":1245579704,"description":"For Never Breathe What You Can't See, Jello Biafra has stowed his spoken word pulpit behind the enormous amplifiers of the Melvins. But his reinsertion as a frontman hasn't dulled his political haranguing or biting cynicism -- on the contrary, it seems to have invigorated him. With Buzz Osborne's guitar walking point, the Melvins deploy a hybrid of full-bore Dead Kennedys revivalism and their own brand of sludgy metal. Their fans might wish for a little more of the latter, as the white phosphorous punk/hardcore screeds outweigh the more purely Melvins moments. Still, Osborne does unleash a particularly sticky, damaged blues guitar line on &quot;Caped Crusader,&quot; and there are pieces of the Melvins' signature sound glued cleverly to the beginnings, middles, and ends of all the material on What You Can't See. (The insane, cackling closer, &quot;Dawn of the Locusts,&quot; will be another highlight for Melvins diehards.) And mostly it's just fun to hear the band matching Biafra's bellyful of strident vocals with wrangling, explosive riffs that could have been written in the Reagan era. &quot;Thank you Osama/You are the savior of our economy today,&quot; Biafra spits over the rumbling bass of &quot;McGruff the Crime Dog,&quot; taking governmental war hawks to task. &quot;The Lighter Side of Global Terrorism&quot; begins as a Melvins slow-burn rager before dropping into a classic Kennedys stance; this time around, Biafra imagines the world through the eyes of a fetishistic airport screener. The darkly wry &quot;Plethysmograph&quot; and self-explanatory &quot;Yuppie Cadillac&quot; are also standouts. What you see is what you get with What You Can't See; it's only the latest platform for Biafra's fiery partisan politicking. But it's also an interesting collaboration between veteran musical iconoclasts.\n- reviev by Johnny Loftus@AMG\n\nThanks to the original uploader on torrents-dot-ru\n\nI've split the image to track-per-file, verified AccurateRip (w/ Cuetools), added ReplayGain tags and flac fingerprint.\n\nEnjoy","torrent":{"xt":"urn:btih:818d66ccfe4f4958a7ce5bb55814df2fadda5d96","amp;dn":"Jello+Biafra+w%2F+Melvins+--+Never+Breathe+What+You+Can%5C%27t+See","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"818d66ccfe4f4958a7ce5bb55814df2fadda5d96","infoHashBuffer":{"type":"Buffer","data":[129,141,102,204,254,79,73,88,167,206,91,181,88,20,223,47,173,218,93,150]},"announce":[],"urlList":[]}}