{"title":"Mafia III PC Deluxe Edition","uid":15998369,"size":17064551726,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:83bbe76ba863699a9ee9eedd11166b965b2716ea&amp;dn=Mafia+III+PC+Deluxe+Edition&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":10,"uploader":"SonnyDiaz","files":172,"time":1476096212,"description":"Release Date:7 October 2016\r\nTitle:Mafia III\r\nProtection:Steam\r\nDeveloper 2K games\r\n\r\n\r\nThe third installment in the popular sandbox gangster series, launched in 2002 by Czech studio Illusion Softworks. Newly created Hangar 13 team, assembled within 2K Games, was in charge of this production. The team included the developers who made the first two parts of the cycle. Unlike those installments, this part takes us to America during the second half of the twentieth century; the main characters are of course members of an Italian crime family, operating in the state of Louisiana. In terms of mechanics, the game does not differ significantly from its predecessors, offering an open world bustling with life, and a series of missions that allow us to participate in shootouts, car chases, and other illegal activities that are typical of the criminal underworld. There is also a bunch of side missions and additional activities, which we can take up in between our tasks.\r\n\r\n\r\n\r\n\r\nAlthough Mafia games have always been set in open worlds, in terms of gameplay the third part comes closer to the competing Grand Theft Auto series. The streets of New Orleans are filled with various extra activities, which you are free to complete between main missions. One of the biggest differences between Mafia and GTA is the artificial intelligence of New Orleans' citizens. Similarly to the protagonist, non-player characters can engage in various activities. Therefore, you can come across couples kissing, junkies enjoying their habit, or street musicians.\r\nAnother new element of key importance is the option of taking over hideouts of hostile gangs. \r\n\r\n\r\nInstall game\r\nCopy crack to dir of installed game\r\nPlay","torrent":{"xt":"urn:btih:83bbe76ba863699a9ee9eedd11166b965b2716ea","amp;dn":"Mafia+III+PC+Deluxe+Edition","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83bbe76ba863699a9ee9eedd11166b965b2716ea","infoHashBuffer":{"type":"Buffer","data":[131,187,231,107,168,99,105,154,158,233,238,221,17,22,107,150,91,39,22,234]},"announce":[],"urlList":[]}}