{"title":"Prison.Break.S02.Complete.EN.Audio&amp;Subs.DVDRip-xKoP","uid":4513187,"size":8041970577,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8524346055e8367d2e51095d426ad530d63fdc75&amp;dn=Prison.Break.S02.Complete.EN.Audio%26Subs.DVDRip-xKoP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"xKoP","files":66,"time":1226866746,"description":"*****Please, seed after you have completed the download, until you reach a ratio of at least 1:1. I don't have great upload speed, so if you completed the download, help the others who haven't, to complete.*****\n\n*****Very important, seed for a ratio of at least 1:1!!*****\n\nPrison Break Season 1 complete. DVD-rips, high quality clips (they are downloaded and put together from the LOL releases, which are the best as quality). I have added the English subs for all of them, and also Romanian ones. If you want to watch the clips in English without any subs, then simply delete the .srt files. [For more information about watching with subs or without, contact me and I will gladly assist you].\n\nAn engineer (Michael Scofield) installs himself in a prison he helped design, in order to help his brother (Lincoln Burrows), a death-row inmate who insists he did not commit the crime for which he has been sentenced to die and help him escape. \n\nLincoln Burrows is on death row for the murder of the vice president's brother. He insists he's innocent and only his brother Michael Scofield believes him. As an engineer who helped design the prison where Lincoln is being held, Michael takes drastic measures to help his brother. He gets himself arrested and sent to the same prison so that with his knowledge of the building the two of them can escape together. However, while inside, Michael discovers a massive conspiracy that is determined to see Lincoln's sentence carried out. Breaking out will be more difficult than he thought, but he's still going to try.\n\nWell, that would be all, Enjoy your download and SEED! -xKoP\nPS: Season 1 uploaded as well, click on my name on Uploaded by xKoP at the top of this page, to go to it. Season 3 will also come, in a couple of days. Check regulary for it!","torrent":{"xt":"urn:btih:8524346055e8367d2e51095d426ad530d63fdc75","amp;dn":"Prison.Break.S02.Complete.EN.Audio%26Subs.DVDRip-xKoP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8524346055e8367d2e51095d426ad530d63fdc75","infoHashBuffer":{"type":"Buffer","data":[133,36,52,96,85,232,54,125,46,81,9,93,66,106,213,48,214,63,220,117]},"announce":[],"urlList":[]}}