{"title":"Joint Strike Fighter (PC)","uid":6703274,"size":437565596,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:867474bf3893bf028fca6e282f08c9aa758831ae&amp;dn=Joint+Strike+Fighter+%28PC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Smoggy_Hamster","files":1,"time":1317061609,"description":"Joint Strike Fighter is a 1997 combat flight simulator designed by Innerloop and published by Eidos Interactive. The game engine was later adapted to Project I.G.I.: I'm Going In.\nThe game lets the player assume the role of wing commander of an unnamed western alliance campaigning in four different (fictional) war scenarios taking place in Afghanistan, Colombia, Korea and the Kola Peninsula. The player may pilot either of the two prototype multi-role combat aircraft that contended in the Joint Strike Fighter Program: the Lockheed Martin X-35 (later selected for production) and the Boeing X-32. The player is accompanied in air combat by up to three AI-controlled wingmen. Alternatively, the player can engage in pure dogfighting against either the computer or human opponents through online multiplayer and spawn installation modes.\n\nI have tested this game and it does work with XP, Vista and Windows 7. If you have any problems try running the program in different compatibility modes and as an administrator. \n\nMount or burn and install. No key required. Virus and Spyware tested.\n\nHINT: If you hold down both CTRL keys when choosing your aircraft, you can pilot any aircraft in the game, but does not include a virtual cockpit!\n\nEnjoy, and don't forget to seed!","torrent":{"xt":"urn:btih:867474bf3893bf028fca6e282f08c9aa758831ae","amp;dn":"Joint+Strike+Fighter+%28PC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"867474bf3893bf028fca6e282f08c9aa758831ae","infoHashBuffer":{"type":"Buffer","data":[134,116,116,191,56,147,191,2,143,202,110,40,47,8,201,170,117,136,49,174]},"announce":[],"urlList":[]}}