{"title":"GMail Drive 1.0.16 Virtual Disk Storage","uid":5627048,"size":863218,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8760e15e88546aeced21f41abe555713c578fbf5&amp;dn=GMail+Drive+1.0.16+Virtual+Disk+Storage&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"konejo7","files":-1,"time":1276522156,"description":"GMail Drive 1.0.16 No zip no rar.\n\nGMail Drive creates a virtual filesystem around your Google Mail account, allowing you to use Gmail as a storage medium.\n\nGMail Drive creates a virtual filesystem on top of your Google Gmail account and enables you to save and retrieve files stored on your Gmail account directly from inside Windows Explorer. GMail Drive literally adds a new drive to your computer under the My Computer folder, where you can create new folders, copy and drag'n'drop files to it.\n\nEver since Google started to offer users a Gmail e-mail account, which includes storage space of 6000 megabytes, you have had plenty of storage space but not a lot to fill it up with. With GMail Drive you can easily copy files to your Google Mail Account and retrieve them again.\n\nWhen you create a new file using GMail Drive, it generates an e-mail and posts it to your account. The e-mail appears in your normal Inbox folder, and the file is attached as an e-mail attachment. GMail Drive periodically checks your mail account (using the Gmail search function) to see if new files have arrived and to rebuild the directory structures. But basically GMail Drive acts as any other hard-drive installed on your computer.\n\nNow includes a Windows 64-bit version, and FileOpen dialog support has returned. Remember to reboot Windows after installation. \n\n\nIpod, Ipad, Iphone: Music Movies Apple Lossless ALAC, FLAC, Vinyl:  &lt;a href=&quot;\nhttp://thepiratebay.se/user/konejo7/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/konejo7/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:8760e15e88546aeced21f41abe555713c578fbf5","amp;dn":"GMail+Drive+1.0.16+Virtual+Disk+Storage","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8760e15e88546aeced21f41abe555713c578fbf5","infoHashBuffer":{"type":"Buffer","data":[135,96,225,94,136,84,106,236,237,33,244,26,190,85,87,19,197,120,251,245]},"announce":[],"urlList":[]}}