{"title":"The Training Of O--ToO-31160 Allie James","uid":8798632,"size":3057981643,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:87d0d52f548df25b811bb08400a79ae63a84e324&amp;dn=The+Training+Of+O--ToO-31160+Allie+James&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"merzedes","files":-1,"time":1376140287,"description":"\nThe Making of a Perfect Little Slut, Day One\n\nAug 9, 2013 - Performers: Allie James \n\n\nMP4 and WMV + Pics. \n\n\nThis girl is hot, hot, fucking hot. She is tall, blonde, pretty face, nice ass and great tits. Oh, and she is a filthy fucking slut. An unrefined slut, but filthy nonetheless. I ask her what she wants to learn. She says she wants to be &quot;a perfect slut&quot;. A typical broad answer. Well, the raw material is definitely there. I check my dick and get the rope. \n\nI tie her tits tight and sling some rope around her round ass. It's nice. Real nice. And she knows it. She is used to easily seducing boys and with her mischievous little cunt. She has been eyeing me like I'm some half drunk frat boy who is going to fall all over himself trying to get with her. I smirk as my fingers dig into her soft flesh and test her nipples. She winces. What makes a slut perfect, I ask. She gets a dumbstruck look on her face like she never expected to have to actually participate in her own training on an intellectual level. This might be a long day. I start to crop and vibe her till I get answers. She squirms and squeals like a sorry ass sorority girl and I smile. \n\nI want to feel her up from the inside. I hang her pussy out in a lewd suspension and hook my fingers tight against her spongy wet g-spot. I make her sweat like a perfect little pig, and tease her to orgasm while drilling her on what she really wants from me. \n\nI am a sadistic bastard with a hard dick, and I want that slutty fucking clit of hers to suffer for my twisted pleasure. I bind her into a compromising position and clamp her cunt wide open. Now is the time to get some answers.\n\nScreens &lt;a href=&quot;\nhttp://www.thetrainingofo.com/site/shoot.jsp?shootId=31160&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.thetrainingofo.com/site/shoot.jsp?shootId=31160&lt;/a&gt;\n\n11 000 uploads and counting, 12k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:87d0d52f548df25b811bb08400a79ae63a84e324","amp;dn":"The+Training+Of+O--ToO-31160+Allie+James","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87d0d52f548df25b811bb08400a79ae63a84e324","infoHashBuffer":{"type":"Buffer","data":[135,208,213,47,84,141,242,91,129,27,176,132,0,167,154,230,58,132,227,36]},"announce":[],"urlList":[]}}