{"title":"Marvel NOW! Week 79 (5/21/2014) (darkhomr) [ALL]","uid":10208165,"size":703313790,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:88c5bcbf109a27c0c7fadcf4ca83deb203c743d7&amp;dn=Marvel+NOW%21+Week+79+%285%2F21%2F2014%29+%28darkhomr%29+%5BALL%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dadrkhomr","files":17,"time":1400879537,"description":"Welcome to the 2014 version of Marvel NOW!  Week after week I will be bringing you the latest in comics in the Marvel NOW universe as well as the All-New Marvel NOW stories.  Can you believe we are 79 weeks in the Marvel NOW and they are putting out an ALL NEW version of the titles?  What will NOT be included is Disney stuff, TV stuff, Ultimate Universe, and kids books. Those will be included (when available) in my Total Marvel pack.\n\nThis weeks' release (May 21, 2014) includes 17 issues with 0 new #1's.   This pack does NOt include Savage Wolverine #19 which was not scanned as of release of this pack\n\nMy release packs are as follows: \n\nDC Universe 52 (Wednesdays based on scanners release times, but not later than Friday morning)\nMarvel NOW! (Marvel Comics in the NOW! universe will be released Wednesdays, based on scanners release times)\nTotal Marvel (All Marvel Universe comics, released on Friday, based on scanners release times)\nIndependent Comics (Non-DC Universe and Major Independent comics, released between Sunday and Monday morning) \nTotal DC (all DC comics released for the current week.  Released by Saturday each week.  Does not include digital only releases)\nDC Monthly (all DC Universe comics for the month, released the first Friday after the end of the month)\nTotal Marvel Monthly (all Marvel Universe comics, released the first Tuesday after the end of the month)\n\n\n\n\n\nAll New Doop #2 (of 5) (CBR 5/21/2014)\n\nDoop takes Kitty Pryde for the trip of her life! See the treasures DOOPSPACE has to offer! \n\nAll New X-Factor #8 (CBR 5/21/2014)\n\nOne of the country's most outspoken anti-mutant leaders...has a mutant daughter? It's up to X-Factor to rescue this young girl from her father! Serval Industries brings you the heroes you need in any situation! \n\nAmazing Spider-Man #2 (CBR 5/21/2014)\n\nElectro's power is out of control! And only one person can fix it . . . the Superior Spider-Man! Wait. This book's the AMAZING Spider-Man now. So we're probably out of luck. Plus: That thing that freaked you out last issue? There's more on that. The return of you-know-who? There's MUCH more on that. Action! Drama! Surprises! There's MORE OF EVERYTHING! \n\nAmazing X-Men #7 (CBR 5/21/2014)\n\nGuest-starring THE AMAZING SPIDER-MAN! Iceman, Firestar and Spider-Man renew their amazing friendship to save New York City. \n\nAvengers World #6 (CBR 5/21/2014)\n\nThe Avengers launch a desperate rescue mission. Hyperion confronts the man who pulled him back from the nothing between universes. In the birth of AIM Empire, a glimpse of a lost world. \n\nDaredevil #3 (CBR 5/21/2014)\n\nThe Owl is back! But old enemies aren't nearly as much of a problem for Matt Murdock as his new friend: The Shroud. Kirsten and Matt are sharing a very volatile secret -- who'll be the first to crack? \n\nDeadpool Annual #2 (CBR 5/21/2014)\n\nHang on...is that Deadpool or Spider-Man? YES. Deadpool 'helps out' his 'friend' Spider-Man by donning his webs! Think Spidey will appreciate it? \n\nElektra #2 (CBR 5/21/2014)\n\nElektra braves the dangers of Monster Island and a rival assassin in her search for the elusive assassin known as Cape Crow! The psychotic killer Bloody Lips closes in on Marvel's deadliest femme fatale! Haden Blackman and Mike Del Mundo bring you a hauntingly beautiful tale about honor and redemption. \n\nHulk #3 (CBR 5/21/2014)\n\n'BANNER D.O.A' GETS READY TO TAKE YOU INTO A NEW TWIST IN HULK HISTORY! BANNER goes to a dark place and could take the AVENGERS with him. Only HULK can save Banner...but will he? After last issue's surprise resurrection, a new threat enters the scene. \n\nMagneto #4 (CBR 5/21/2014)\n\n'PROFILE OF A SUPREMACIST' In the most brutal issue yet of this new noir/horror series, Magneto ruthlessly dismantles the latest threat to mutantkind...and we gain a greater understanding of why his mission is so important to him.\n\nNova #17 (CBR 5/21/2014)\n\nSam is back from outer-space and discovers his greatest threat right on his doorstep! When the Alexander home is threatened, this time there may not be anything that Nova can do to help out. \n\nOriginal Sin #2 (of 8) (CBR 5/21/2014)\n\nWHO HOLDS THE EYE? WHO KNOWS ITS SECRETS? The cosmic manhunt for the Watcher's killer continues. More bodies are discovered. The killer's trail leads to the far corners of the universe and beyond. And just when Nick Fury and the Avengers think they've cornered their murderer . . . EVERYTHING EXPLODES, unleashing the Marvel Universe's greatest secrets. \n\n\nThor God Of Thunder #22 (CBR 5/21/2014)\n\nTHE LAST DAYS OF MIDGARD - Part Four Thor and SHIELD agent Roz Solomon vs. Ulik the troll! ROXXON vs. Broxton, Oklahoma! And in the far future, the Goddesses of Thunder take on Old Galactus! But wait, where's King Thor. . .? \n\nUncanny X-Men #21 (CBR 5/21/2014)\n\nThe Cyclops Revolution marches on! Who is the mysterious figure building Sentinels for SHIELD? Find out what happened to Dazzler since Mystique took her down back in UNCANNY X-MEN #9! \n\nWolverine and the X-Men #4 (CBR 5/21/2014)\n\nTOMORROW NEVER LEARNS - Part 3! Storm, Idie and the kids make a stand against the Phoenix Corporation while Wolverine clings to life! Meanwhile, Quentin Quire, on the run, finds a new ally in...Cyclops? Jason Latour (WINTER SOLDIER) and Mahmud Asrar (X-MEN) continue the ALL NEW MARVEL NOW smash hit! \n\nX-Men #14 (CBR 5/21/2014)\n\nThe Jean Grey School is under attack, leaving a young X-Man dead on the school's front lawn. Jubilee's worst nightmare has come to pass... and the future's being rewritten. Clay Mann (GAMBIT) joins Brian Wood for a terrifying new chapter in X-Men history! \n\n\n\n\n","torrent":{"xt":"urn:btih:88c5bcbf109a27c0c7fadcf4ca83deb203c743d7","amp;dn":"Marvel+NOW%21+Week+79+%285%2F21%2F2014%29+%28darkhomr%29+%5BALL%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88c5bcbf109a27c0c7fadcf4ca83deb203c743d7","infoHashBuffer":{"type":"Buffer","data":[136,197,188,191,16,154,39,192,199,250,220,244,202,131,222,178,3,199,67,215]},"announce":[],"urlList":[]}}