{"title":"[SoM]La tela di Carlotta[DvdRip-Divx-Ita-Mp3]","uid":4732321,"size":735184896,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:894b9059719715225197e55348d5b6d706a5bb4f&amp;dn=%5BSoM%5DLa+tela+di+Carlotta%5BDvdRip-Divx-Ita-Mp3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"mitimex","files":1,"time":1235090714,"description":"Sono passati 11 anni da quando il maialino parlante Babe convinse pubblico e critica ad appassionarsi alla sua commovente storia. Oggi sul grande schermo ÃƒÂ¨ la volta di un suo simile, il tenero Wilbur, frutto della fantasia dello scrittore E.B. White che giÃƒÂ  lo aveva reso protagonista di &quot;La tela di Carlotta&quot;, da piÃƒÂ¹ di cinquant'anni favola amatissima dai bambini di tutto il mondo.\nProprio la storia della dolce e singolare amicizia tra il gentil porcellino con i giorni contati e un ragno dal forte spirito materno (la Carlotta del titolo) ÃƒÂ¨ al centro del bucolico racconto che il regista Gary Winick (&quot;30 anni in un secondo&quot;) ha deciso di portare sul grande schermo per farla conoscere alle nuove generazioni, per sensibilizzare e al tempo stesso incantare grandi e piccini con quella che si puÃƒÂ² definire una delicata parabola sull'intramontabile valore dell'amicizia e su quanto importante sia lo spirito di sacrificio.\nLa bambina prodigio Dakota Fanning nonostante la giovane etÃƒÂ  ÃƒÂ¨ abituata a recitare con star del calibro di Tom Cruise, Michelle Pfeiffer e Robert De Niro, ma per la prima volta se la deve vedere con partner del mondo animale, dato che interpreta Fern, la piccola che vive con la famiglia in una classica fattoria che piÃƒÂ¹ classica non si puÃƒÂ² e che, &quot;adottando&quot; il maialino Wilbur, lotta disperatamente per sottrarlo ad un crudele ma inevitabile destino.\nL'iniziale diffidenza con cui il nuovo arrivato viene accolto dagli altri &quot;inquilini&quot; della stalla (potete immaginare di chi stiamo parlando: pecore, mucche, un cavallo e due oche!) presto si trasforma in spirito di solidarietÃƒÂ , grazie al coinvolgimento che &quot;tesse&quot; con il suo prodigioso filo il ragno Carlotta, sensibile da subito alla causa del dolce Wilbur, ignaro di poter diventare di lÃƒÂ¬ a breve una succulenta pietanza del desco natalizio.\nCon la valida collaborazione di Templeton, sorcio paffuto cui spetta il compito di far ridere con le sue comiche battute e la sua goffa ingordigia (ma uno spassoso duo di corvi non gli ÃƒÂ¨ da meno), l'originale tentativo di salvataggio di Carlotta porterÃƒÂ  naturalmente ad un felice epilogo, non privo di qualche sana lacrimuccia di commozione.\n","torrent":{"xt":"urn:btih:894b9059719715225197e55348d5b6d706a5bb4f","amp;dn":"%5BSoM%5DLa+tela+di+Carlotta%5BDvdRip-Divx-Ita-Mp3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"894b9059719715225197e55348d5b6d706a5bb4f","infoHashBuffer":{"type":"Buffer","data":[137,75,144,89,113,151,21,34,81,151,229,83,72,213,182,215,6,165,187,79]},"announce":[],"urlList":[]}}