{"title":"[DVD-Rip ENG ITA] Doctor Who Classic ~ S.01 ep.05-07","uid":4885408,"size":1100640256,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:897f21e8c1891944cf33b9c878c42220d5b01750&amp;dn=%5BDVD-Rip+ENG+ITA%5D+Doctor+Who+Classic+%7E+S.01+ep.05-07&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"egalean","files":3,"time":1241715712,"description":"Doctor Who is a British science fiction television programme produced by the BBC. The programme depicts the adventures of a mysterious alien time-traveller known as &quot;the Doctor&quot; who travels in his space and time-ship, the TARDIS, which normally appears from the exterior to be a blue 1950s police box. With his companions, he explores time and space, solving problems, facing monsters and righting wrongs.\n\nThis story introduces two plotlines in Doctor Who, that of the TARDIS' navigational circuits malfunctioning and that of the supposed destruction of the Dalek race. In this case, instead of bringing its crew back to Earth, the TARDIS lands in a petrified jungle, and the Doctor has to try to fix their position by taking a reading of the stars. The Doctor insists they explore a futuristic city they spot beyond the forest but Ian Chesterton and Barbara Wright are not convinced. To force his companions to do so, the Doctor sabotages the TARDIS by emptying the mercury fluid links (a ruse he later admits to), forcing the crew to travel to the city in search of more mercury.\n\nInside the city, Barbara becomes separated from her colleagues, and is, in the iconic first episode cliffhanger, threatened by an unseen creature with a metal arm - the first appearance of a Dalek. Before long, the entire crew is captured by the Daleks. Susan is eventually sent to retrieve anti-radiation drugs from the TARDIS, where she encounters a second species, the Thals, who are at war with the Daleks. Susan attempts to broker peace between the two groups, and while it appears to work, the Daleks eventually betray the Thals, opening fire on them at what was supposed to be a peaceful exchange of food.\n\nIn the ensuing chaos, the Doctor and his companions escape with the Thals, and learn their version of the history of their planet. They also learn that the Thals are avowed pacifists. In order to save them from the Daleks, the TARDIS crew convinces the Thals of the importance of aggression and warfare, and manages to lead the Thals in a successful genocide against the Daleks. At the end, it is believed the Dalek race has been destroyed.","torrent":{"xt":"urn:btih:897f21e8c1891944cf33b9c878c42220d5b01750","amp;dn":"%5BDVD-Rip+ENG+ITA%5D+Doctor+Who+Classic+%7E+S.01+ep.05-07","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"897f21e8c1891944cf33b9c878c42220d5b01750","infoHashBuffer":{"type":"Buffer","data":[137,127,33,232,193,137,25,68,207,51,185,200,120,196,34,32,213,176,23,80]},"announce":[],"urlList":[]}}