{"title":"Sexually Broken--Nice Midwestern girl Cassandra Nix  Matt Willia","uid":8889760,"size":848141802,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:89c3abc96eb1363b56f95a04f3adf6c2105329f0&amp;dn=Sexually+Broken--Nice+Midwestern+girl+Cassandra+Nix++Matt+Willia&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"merzedes","files":-1,"time":1378553531,"description":"Nice Midwestern girl Cassandra Nix turned cocksucking porn star skullfucked into a drooling mess! | Cassandra Nix | Matt Williams\n\nSeptember 6, 2013 \n \n\nMP4 only. \n \n \nThey breed them nice out in the Midwest. With nothing else to do out there in farm country, you get really really good at sex. Cassandra Nix took all that time she spent becoming a cocksucking expert and moved to LA to properly show off her skills as a porn star. Today we take that long lean model body and pretty face and take her apart with dick. A pretty face doesn't give you a pass on the Sexuallybroken stage, you still are going to get turned into a well used bag of holes.\n\nUsing a custom made bondage device, we weave her long limbs into the bars and shackle the slut into place. Her perfect ass pokes on one end, her perfect face pokes out on the other. Now all we have to decide is what end we are going to use first. You can't bring puffy nipples like Cassandra is rocking to the stage and think they are going to get ignored. Some nipple clamps and weights ensure that they are painfully tugged and squeezed with every stroke of the cock. She can't move, she can't escape, all she can do is endure. The weights bounce off her sensitive nipples, the pain complimenting the pleasure her pussy feels. A Japanese tongue trap keeps her pink little tongue out and knowing its place. \n\nRamming into her whets our appetite and we quickly shift sides. Back and forth, both ends open and available for our use. The cock slides down her open mouthhole and owns her throat meat. She drool helplessly, a fucktoy for our pleasure. Pretty girls wear cock so well, don't they? The more the cock owns her holes, the fast her brain melts and her eyes glaze over. She checks out and slides into subspace. Now she is just an animal, an animal with a sole purpose of worshipping cock. Throwing in a vibrator to the mix causes massive orgasms to start rippling through her bound body. She strains against the wooden slats, but she can not break free. Sweat and cum and drool coat her heaving flesh. \n\nWe drill her down into a broken heap of well-fucked flesh. By the time we are done with her, the only thing left holding her up is her bondage, as her muscles have given up long ago. Using a pulley, we yank her up and leave her spinning in the bondage ladder, liquid seeping from every hole. Until next time, little Midwestern girl.... \n \nScreens  &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/09_06cnix5/SexuallyBroken-Cassandra-Nix-Matt-Williams-Nice-Midwestern-girl-Cassandra-Nix-turned-cocksucking-porn-star-skullfucked-into-a-drooling-mess.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/09_06cnix5/SexuallyBroken-Cassandra-Nix-Matt-Williams-Nice-Midwestern-girl-Cassandra-Nix-turned-cocksucking-porn-star-skullfucked-into-a-drooling-mess.php&lt;/a&gt;\n\n11 000 uploads and counting, 12k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n\n","torrent":{"xt":"urn:btih:89c3abc96eb1363b56f95a04f3adf6c2105329f0","amp;dn":"Sexually+Broken--Nice+Midwestern+girl+Cassandra+Nix++Matt+Willia","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89c3abc96eb1363b56f95a04f3adf6c2105329f0","infoHashBuffer":{"type":"Buffer","data":[137,195,171,201,110,177,54,59,86,249,90,4,243,173,246,194,16,83,41,240]},"announce":[],"urlList":[]}}