{"title":"Alex Jones Show - 2012 Apr 29 SU [sebaygo1]","uid":7228579,"size":42719361,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:8a6720f5b64ad9aad97ac54906a786e8a38049b0&amp;dn=Alex+Jones+Show+-+2012+Apr+29+SU+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sebaygo1","files":8,"time":1335756641,"description":".\n\t\t\t\t\t\t\t\nThe Alex Jones Show\nSunday, 29 April 2012\n\n\n[sebaygo1]\n\n\nThe 2 hour Sunday show is typically a review of the past week's news and a look forward to the coming week's events. The Infowars web site describes today's broadcast as follows.\n\nToday on this live Sunday edition, Alex Jones focuses in on the crumbling government narratives and the known liars patching them together, including the on-going hoax surrounding the account we've been given of boogie man Osama's demise. Barack Obama is poised to grandstand over the alleged death of Bin Laden on the May Day anniversary celebrations traditionally shared by pagans, socialists and the Illuminati in a lead up to his re-election bid for 2012. Meanwhile, House committee members led by Rep. Darrell Issa are making preparations to slap contempt charges on Attorney General Eric Holder over his role in covering up the Fast &amp; Furious scandal and providing Congress with false information and misleading statements. Also, even establishment lapdog publications like the New York Times now admit the extensive role of the FBI in setting up alleged terror plots, often admittedly using entrapment to frame patsies as would be bombers in the public's mind.\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n \n It is my opinion that in this time it is virtually essential \n to seek information from a variety of sources, to listen to a\n spectrum of voices in order to better  understand the &quot;big \n picture.&quot; A reliance solely upon mainstream corporate media \n for news and info is a prescription for ignorance. I try to\n share information that counters the monotone of mainstream\n corporate media. \n\n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents.\n\n Think for yourself! To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n \n !! please try some of the other shows I upload too !! \n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n..........\n\nfolder.jpg courtesy of commenter &quot;Nighted&quot; at the sebaygo1 blog\n..........\n","torrent":{"xt":"urn:btih:8a6720f5b64ad9aad97ac54906a786e8a38049b0","amp;dn":"Alex+Jones+Show+-+2012+Apr+29+SU+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a6720f5b64ad9aad97ac54906a786e8a38049b0","infoHashBuffer":{"type":"Buffer","data":[138,103,32,245,182,74,217,170,217,122,197,73,6,167,134,232,163,128,73,176]},"announce":[],"urlList":[]}}