{"title":"Planescape: Torment (2CDs)-Kindo","uid":3798438,"size":1243822159,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8aea4e9f8817bab1bd187b3c47ce467d5faf1129&amp;dn=Planescape%3A+Torment+%282CDs%29-Kindo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Kindo","files":48,"time":1189170722,"description":"Brought to you by: Kindo\n\nIMDb: http://imdb.com/title/tt0187405/\nWikipedia: http://en.wikipedia.org/wiki/Planescape:_Torment\n\nTitle: Planescape: Torment\nGenre: Computer Role-Playing Game\nType: Game\nPlatform: PC\nYear: 1999\nNumber of discs: 2\nFiles: torment.cd1-Kindo.iso; torment.cd2-Kindo.iso (both compressed into multiple files using WinRAR) and a folder with Extras (3,52 MB)\n\n\nThis is a proper, fully working version of Planescape: Torment. It comes in the most recently released 2 CD-version and is therefore much smaller than the original 4 CD-version, and it is also already patched with the official patch. I have followed all the instructions below, step-by-step, to make sure it all works as it should, and so far I have not encountered any problems. In other words: it should work. I hope you will enjoy the, in my opinion, best game ever made. (And please help me seed, I only have a 24/1 line.)\n\n\nInstructions\n------------\n\nQuick:\n1. UnRAR CD1 and CD2\n2. Mount/burn CD1 and install game\n3. Mount/burn CD2 and start the game (use the same drive as you used for CD1)\n4. Ready to play!\n\nDetailed: \nWhen finished downloading, extract using the program of your choice. I use WinRAR (http://www.rarlab.com). Then proceed to either burn the two images to CD&amp;#039;s, or simply mount them using a program like DAEMON Tools (http://www.daemon-tools.cc) and install the game with CD1. Then mount CD2 (or insert it, if you chose to burn the images onto CD&amp;#039;s), and you&amp;#039;ll be ready to play. If you were mounting, make sure you mount CD2 to the same drive as you used when you installed the game with CD1. You won&amp;#039;t need CD1 anymore, anyway, since the game will read all future data from CD2. This is enough for you to launch the game and start playing. Read on if you want optional, more advanced information.\n\n\nFull installation\n-----------------\n\nIf you are like I am and don&amp;#039;t want to bother with CD&amp;#039;s or images at all once a game is installed, there is a way to manually make a full installation of the game and then apply a crack in order to be completely rid of any need for either CD1 or CD2. After installing the game, copy the entire folder you find on CD2 to the game directory (by default this is C:\\Program\\Black Isle\\Planescape - Torment). Now we need to instruct the program to read information from that folder, rather than a CD-drive. To do this, open up the Torment.ini file located in the game directory. At the very top there is a section called [Alias], under which the paths to the CD&amp;#039;s are stored. Since you don&amp;#039;t want it to read from the CD anymore, you need to change those paths to lead to where you put the folder you copied from CD2 instead. You only need to do this for the CD2, CD3, and CD4 lines. It should look something like this when you&amp;#039;re done:\n\n[Alias]\nHD0:=C:\\Program\\Black Isle\\Planescape - Torment\\\nCD1:=J:\\CD1\\\nCD2:=C:\\Program\\Black Isle\\Planescape - Torment\\cd2\nCD3:=C:\\Program\\Black Isle\\Planescape - Torment\\cd2\nCD4:=C:\\Program\\Black Isle\\Planescape - Torment\\cd2\n\nWe all have different drive names and possibly different game directories, so make sure to keep that in mind as you tamper with this, and make the appropriate changes. When it&amp;#039;s done, the game will now go to the path you have specified above whenever it needs data from CD2, rather than one of your CD-drives.\n\nNow we just need to get rid of the disc check by using a No CD-crack. I have included a working one I found, and put it in the Extras folder. UnRAR it and put it in your game directory, then run it. If all goes well, it will not encounter any errors and you should now be able to run the game completely without the use of any CD&amp;#039;s.\n\n\nOptional fixes and the extras\n-----------------------------\n\nDisabling Electronic Registration: \nDelete the folder called &amp;#039;ereg&amp;#039; in the game directory in order to get rid of that annoying &quot;Register Now!&quot; message you receive whenever you start the game.\n\nIncrease Cache Size: \nIn the Torment.ini file in the game directory, the second section is called [Config], under which you can specify the cache size. It is capped at 999, so there is no point in changing the number to anything higher than that. Having a larger cache size will allow the game to store more area data in the game&amp;#039;s cache, and thus decrease loading times when you revisit old areas. The improvement might be marginal if you are running a full install, and the game doesn&amp;#039;t have very long load times to begin with, but I thought I&amp;#039;d include it here anyway.\n\nIncrease Game Speed:\nYou may also increase the game speed by increasing Maximum Frame Rate under [Program Options] in the Torment.ini. By default this is set to 30, and the game is designed to run at that exact speed, meaning it may look weird in some places if you increase the number, but if you really want to, go ahead. A number like 35 or 40 should be fine.\n\nUnofficial Fix Pack:\nIn the Extras folder you can also find two unofficial fixes. The first one is a Fix Pack, which acts as a sort of patch that solves things the official patch didn&amp;#039;t. The fixes are mostly minor, but there are plenty of them, so you might as well install it if you want to. To do so, extract the contents of the archive into the override folder in your game directory (by default: C:\\Program\\Black Isle\\Planescape - Torment\\override) and overwrite files if prompted.\n\nUnofficial Restoration Pack:\nThe second pack is a restoration pack, meant to restore some of the things that were cut out in the final release of the game. These include certain beastiary entries, a couple of minor quests, some spoken dialogue, and a ton of other miscellaneous things. Nothing major, but I still recommend it for an even &quot;fuller&quot; experience. To do so, extract the contents of the override folder in the archive, to the override folder in your game directory (same procedure as you did with the above fix pack), and the other 5 files directly into your game directory. Overwrite files when prompted.\n\nDISCLAIMER: As with anything unofficial, you are recommended to first backup the override folder before applying the fixes, as well as the 4 files being replaced by the restoration pack. Although I have never experienced any problems with this myself, nor have I heard of anyone else encountering errors, it&amp;#039;s always better to be safe than sorry. Also, if you intend to use both packs, install the Fix Pack first and the Restoration Pack second. Otherwise many of the fixes of the Restoration Pack will be overwritten by the Fix Pack.\n\nFonts:\nI have also included some fonts used in the game, just for fun.\n\nOther:\nThere are a couple of other files to get for the game, but they are mostly for customization, so their usefulness varies between player and player, and they also have different installation procedures. I will include some links to sites below, and I&amp;#039;m sure you can find something suiting your own needs if you wish to look further, but I personally think it&amp;#039;s about time you start playing the game!\n\n\nLinks\n-----\n &lt;a href=&quot;\nhttp://www.gamefaqs.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.gamefaqs.com/&lt;/a&gt; -- If you get stuck or need some tips, GameFAQs is filled with various walkthroughs and other documents.\n &lt;a href=&quot;\nhttp://www.gibberlings3.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.gibberlings3.net/&lt;/a&gt; -- A modding community dedicated to games using the Infinity Engine. Here you can find a nice tweak pack for Torment.\n &lt;a href=&quot;\nhttp://www.planetbaldursgate.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.planetbaldursgate.com/&lt;/a&gt; -- Covers Planescape: Torment as well as the Baldur&amp;#039;s Gate- and Icewind Dale-series.\n &lt;a href=&quot;\nhttp://sorcerers.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sorcerers.net/&lt;/a&gt; -- A great source for downloadable content and information for most Black Isle/Bioware/Interplay games.","torrent":{"xt":"urn:btih:8aea4e9f8817bab1bd187b3c47ce467d5faf1129","amp;dn":"Planescape%3A+Torment+%282CDs%29-Kindo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8aea4e9f8817bab1bd187b3c47ce467d5faf1129","infoHashBuffer":{"type":"Buffer","data":[138,234,78,159,136,23,186,177,189,24,123,60,71,206,70,125,95,175,17,41]},"announce":[],"urlList":[]}}