{"title":"Boz Scaggs - Same (1969) MP3@256","uid":9623206,"size":84297280,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8ba47de4f90c69088280a07a445628b52db19fd7&amp;dn=Boz+Scaggs+-+Same+%281969%29+MP3%40256&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AaronVincent","files":10,"time":1392548846,"description":"Boz Scaggs is the second album by Boz Scaggs; it was released in 1969. After two years with the Steve Miller Band, Scaggs once again set out on his own, recording at Muscle Shoals Sound Studio in Sheffield, Alabama. The other musicians on the album include Duane Allman, Eddie Hinton, Jimmy Johnson, Barry Beckett, David Hood, Roger Hawkins and Al Lester. It was produced by Rolling Stone founder and editor Jann Wenner, Scaggs, and Marlin Greene.\n\nThe album (SD-8239) sold slowly despite positive reviews. Originally mixed by Stax Records' engineer Terry Manning, it remained in the catalog for a number of years and was deleted around 1974 or 1975.\n\nIn 1977 the album was remixed in Los Angeles by Tom Perry and was released by Atlantic (SD-19166) in 1978 to spotlight Duane Allman's guitar playing, with the same cover art. As well as the guitar, the remix brings several things forward in the mix such as horns, background voices and keyboards; there is also an odd 30 second volume drop at the end of &quot;Finding Her&quot;. This remix was the only complete version of the album available on CD until the Audio Fidelity remastered release of December 2013, which restored the original master mix in its entirety.[1]\n\nIn 2008, the album was reissued by Friday Music on a 180 gram vinyl LP using the original mix for the first time since the album was originally released.[2]\n\nIn a 2012 updated list, the album listed at #496 on the Rolling Stone's The 500 Greatest Albums of All Time.\n\n","torrent":{"xt":"urn:btih:8ba47de4f90c69088280a07a445628b52db19fd7","amp;dn":"Boz+Scaggs+-+Same+%281969%29+MP3%40256","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ba47de4f90c69088280a07a445628b52db19fd7","infoHashBuffer":{"type":"Buffer","data":[139,164,125,228,249,12,105,8,130,128,160,122,68,86,40,181,45,177,159,215]},"announce":[],"urlList":[]}}