{"title":"Struggle for the Middle Sea by Vincent P. O'Hara","uid":10076326,"size":10030372,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8bd59649dc4d225d32fd3b2b55a356bd44a7fdbd&amp;dn=Struggle+for+the+Middle+Sea+by+Vincent+P.+O%27Hara&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"PirateBook","files":1,"time":1398924552,"description":"\nStruggle for the Middle Sea: The Great Navies at War in the Mediterranean Theater, 1940-1945 by Vincent P. O'Hara\n\n\nThe Mediterranean Sea is the maritime crossroads where Europe, Asia and Africa meet. It was the most intensely contested body of water in World War II. More major naval actions were fought in the Mediterranean than in the Atlantic or Pacific. Its waters witnessed carrier strikes, battle-line shootouts, cruiser-destroyer engagements, convoy attacks, coastal actions, amphibious assaults, and bitter submarine campaigns. Despite the importance of the Mediterranean war, however, its recent literature is remarkably sparse and largely one-sided. \n\nThe Struggle in the Middle Sea is a fresh study of the Mediterranean naval war. It analyses the actions and performances of each of the five major navies, the British, Italian, French, German, and American within a chronological, operational narrative of the entire five year campaign, and examines, without partisanship, the national imperatives that drove much of the action. \n\nThe Struggle in the Middle Sea sidesteps the myths that haunt this campaign, like Great Britain enjoyed a moral advantage over Italy, or the French were Germans puppets, or the North African campaign contributed to the eventual Allied victory. \n\nThe book documents how the British Royal Navy, despite brilliant victories, was bled white in a campaign with questionable strategic goals; how Italy followed its own coherent naval strategy, much to the frustration of its German ally; how the Marine National was the strength of the independent French state and how it fought the Allies--and rejected the Axis--to maintain that independence. Finally, while the book concentrates on the 1940 to 1943 period, it also covers Germany's improvised and remarkably successful fighting withdrawal at sea from 1943-1945.\n\nGenre: Non Fiction, History, Military","torrent":{"xt":"urn:btih:8bd59649dc4d225d32fd3b2b55a356bd44a7fdbd","amp;dn":"Struggle+for+the+Middle+Sea+by+Vincent+P.+O%27Hara","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8bd59649dc4d225d32fd3b2b55a356bd44a7fdbd","infoHashBuffer":{"type":"Buffer","data":[139,213,150,73,220,77,34,93,50,253,59,43,85,163,86,189,68,167,253,189]},"announce":[],"urlList":[]}}