{"title":"The Prisoner's Dilemma by Sean Stuart O'Connor (retail) {dwg}","uid":11008935,"size":6747384,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8c96386c1079e760ac6285cb1d3e5219316f46cb&amp;dn=The+Prisoner%27s+Dilemma+by+Sean+Stuart+O%27Connor+%28retail%29+%7Bdwg%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gratefuldawg77","files":6,"time":1410301103,"description":"The far north coast of Scotland. Spring 1745. It begins with a murder. But is it a murder when someone is forced to kill his brother, so that he might save his own life? The guilty man is a nobody, a poor fisherman. The person who arrogantly and unthinkingly makes him commit this terrible act, simply to see how he behaved, is the richest man in Scotland, one of Europe s leading astronomers, a great aristocrat and clan chief the Earl of Dunbeath. How this opening scene unfolds leads Dunbeath to invent his game of life the Prisoner s Dilemma. He invites his old friend, David Hume, to Caithness to play the new game with him to prove to you mathematically and empirically the interaction of good and ill, of co-operation and selfishness. But into their planned discussions blow two survivors from a shipwreck who will turn their thoughts and their lives upside down - the beautiful and brilliant Sophie Kant and the calm, charismatic captain, Alexis Zweig. What follows, as the greatest political, scientific and philosophical questions of the age sluice wildly through their tiny speck on the map, is a claustrophobic and fast moving game of cat and mouse as the characters drive relentlessly towards their destinies in life and death, love and betrayal and the passion they each have to achieve their different ambitions. As the pace of the narrative quickens the scene is set for the final astonishing and unexpected outcome. Under the game playing, the deceits and feints, the science and the philosophy, is a simple tale of three utterly determined and ruthless men struggling to the death to succeed in the race for an extraordinary woman. Which of them will win? How? And why? Cover photograph by Stephen Cochrane. Come and play my game of life with me! I call it The Prisoner s Dilemma.","torrent":{"xt":"urn:btih:8c96386c1079e760ac6285cb1d3e5219316f46cb","amp;dn":"The+Prisoner%27s+Dilemma+by+Sean+Stuart+O%27Connor+%28retail%29+%7Bdwg%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c96386c1079e760ac6285cb1d3e5219316f46cb","infoHashBuffer":{"type":"Buffer","data":[140,150,56,108,16,121,231,96,172,98,133,203,29,62,82,25,49,111,70,203]},"announce":[],"urlList":[]}}