{"title":"Chicory Tip - The Best Of Chicory Tip","uid":4673958,"size":99655066,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8e0e3e408f51de69499c88839db0db696fec4262&amp;dn=Chicory+Tip+-+The+Best+Of+Chicory+Tip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Iron_Horse","files":25,"time":1232830082,"description":"Chicory Tip - The Best Of Chicory Tip 1970-1974\nMp3 192 mbit/s\n\nChicory Tip were a British pop group from Maidstone, Kent, comprising Peter Hewson (vocals), Rick Foster (guitar), Barry Mayger (bass guitar), Brian Shearer (drums) and Rod Cloutt (guitar, keyboard.\n\nThey formed around 1969, and signed to CBS Records. Their first few singles flopped, although &quot;Excuse Me Baby&quot; in 1971 secured them their first appearance on the BBC Television pop music programme, Top of the Pops. Their finest moment came after studio manager Roger Easterby came across an advance copy of &quot;Son of my Father&quot;, a song written by Giorgio Moroder and Pete Bellotte. Convinced of its potential, he secured them the option to rush record their own cover version in competition with the original. The result was a Number One hit in the UK Singles Chart for three weeks in February 1972. it was one of the first hit singles to prominently feature a moog synthesizer (in this case played by studio engineer and record producer, Chris Thomas).\nTwo further Top 20 hits in similar vein followed, &quot;What's Your Name&quot;, and &quot;Good Grief Christina&quot;. Another release, &quot;Cigarettes, Women and Wine&quot; was heavily played on Radio Luxembourg but failed to chart, probably due to a BBC Radio 1 ban because of its references to smoking.\n\nThe group released one album, also entitled Son Of My Father.\n\nAlthough it brought them success, they resented their image as a pure pop band, and on stage their sound was much closer to heavy rock, and they claimed they were more like Deep Purple. However they never succeeded in broadening their appeal to an older audience. They disbanded in 1975, but later reformed to play gigs on the 1970s revival nostalgia circuit.\n\nTracklist:\n01_Son Of My Father\n02_What's Your Name\n03_Future Is Past\n04_Good Grief Christina\n05_Cigarettes Women &amp; Wine\n06_I.O.U.\n07_Take Your Time Caroline\n08_Big Wheels Rolling\n09_Join Our Gang\n10_Me And Stan Foley\n11_Move On\n12_I See You\n13_Memory\n14_What She Thinks About\n15_I Can Hear You Calling\n16_Marianne\n17_Arizona\n18_Sweat Dust And Red Wine\n19_Pride Comes Before A Fall\n20_Friend Of Mine\n21_Excuse Me Baby\n22_Lodi\n23_I Couldn't Spend Another Day Without You","torrent":{"xt":"urn:btih:8e0e3e408f51de69499c88839db0db696fec4262","amp;dn":"Chicory+Tip+-+The+Best+Of+Chicory+Tip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e0e3e408f51de69499c88839db0db696fec4262","infoHashBuffer":{"type":"Buffer","data":[142,14,62,64,143,81,222,105,73,156,136,131,157,176,219,105,111,236,66,98]},"announce":[],"urlList":[]}}