{"title":"Angus Trumble - A Brief History of the Smile [2004][A]","uid":10476709,"size":48059589,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8fe7761f5bb09cd09d4da4e43645ea525d2d8d99&amp;dn=Angus+Trumble+-+A+Brief+History+of+the+Smile+%5B2004%5D%5BA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anette14","files":-1,"time":1404344559,"description":"Description\nProduct Details\nBook Title: A Brief History Of The Smile\t\nBook Author: Angus Trumble (Author)\nHardcover: 272 pages\nPublisher: Basic Books (January 6, 2004)\nLanguage: English\nISBN-10: 0465087779\nISBN-13: 978-0465087778\n\n===================================================================================\nBook Description\nIt has been said that supreme enlightenment is reflected in the holy smile of the Buddha. Yet, the Victorians thought of open-mouthed smiling as obscene, and nineteenth-century English and American slang equated &quot;smiling&quot; with drinking whisky. Every smile is the product of physical processes common to all humans. But since the dawn of civilization, the upward movement of the muscles of the face has carried a bewildering range of meanings. In A Brief History of the Smile, Angus Trumble deftly weaves art, poetry, history and biology into an intriguing portrait of the many nuances of the human smile. Elegantly illustrating his points with emblematic works of art, from 18th and 19th century European paintings to Japanese woodblock prints, Trumble explores the meanings of smiling in a variety of cultures and contexts. But he also asks key questions about the behavioral and psychological aspects of smiling: When and how in infancy does human smiling become a profound act of communication? Is smiling unique to human beings? How does smiling function to foster our attachments to each other? Effortlessly mingling erudition, wit, and personal anecdote, Trumble weaves a seamless interdisciplinary tapestry.An established talent in the art worlds of Europe, Europe and Australia, Trumble challenges our most deeply held assumptions about smiling. In his analysis of Jusepe de Ribera's Girl Playing a Tambourine, Trumble explores the sinister side of the smile-the leer, the snarl, the lewd grin. And from J.A. Ingres' portrait of the Princesse de Broglie, he extracts the implications of &quot;public&quot; smiling, the tension between decorum and beauty. Trumble brings his expertise as a writer, historian and thinker to bear on the art of smiling in this charming and distinctive work.\n\n===================================================================================\nEditorial Review\nFrom Publishers Weekly\nAll smiles may be triggered by an &quot;instantaneous chemical reaction in the brain,&quot; but that's where their similarities end, says art historian and curator Trumble in this eclectic and engaging look at the phenomenon throughout art and history and across cultures. He breezily traces the representation of the smile, from its mild, mask-like expression in early Greek sculpture to its ever-debated, enigmatic presence on da Vinci's Mona Lisa, to its gaping glory days in 17th-century Dutch and Flemish painting. Unabashed tooth display in formal portraiture was frowned upon right up to the 20th century, when sufficient progress had been made in the fields of photography and dentistry to usher in the wide-mouthed grin. Trumble travels east to explain the Indonesian smile, often misread by Westerners as unconditionally welcoming, and to present the evolutions of the Muslim concept of purdah, &quot;the most obvious form of modesty or physical concealment,&quot; as well as the Japanese custom of tooth-blackening, which coyly flirted with Oriental notions of &quot;exposing and concealing.&quot; Readers learn that Buddha's transcendent beam represents intelligence, compassion and ethereality, while the fleeting appearance of the &quot;Gothic smile&quot; in 12th-century Christian iconography is considered a departure from more characteristic Jesus imagery. Trumble also tackles a bit of science, detailing the smile's physiological mechanisms; child development, explaining the involuntary radiance of infants; and trends, examining our celebrity-crazed, Angelina-lipped pop culture. Since Trumble sets out to tackle &quot;the smile in the broadest possible sense,&quot; his resulting chronicle, while packed with factoids and whimsy (who knew George Washington wore a makeshift bridge of carved hippopotamus teeth?) feels fun but diffuse.\n\n===================================================================================\nReviews\n&quot;'Satisfyingly rich, consistently surprising and gloriously irreverent'. The Daily Telegraph\n\n'A beautifully written book'. New Scientist\n\n'Thanks to Trumble's curiosity, breadth of knowledge and naughty sense of humour, the overall effect is delightful'. Psychology Today\n\n===================================================================================\nAbout the Author\nAngus Trumble is a graduate of the University of Melbourne and of New York University's Institute of Fine Arts. He has worked for Christie's in New York, and has been curator of European paintings and sculpture at the Art Gallery of South Australia in Adelaide. He is currently curator of paintings and sculpture at the Yale Center for British Art. He has written seven books, and lives in New Haven, Connecticut.\n===================================================================================","torrent":{"xt":"urn:btih:8fe7761f5bb09cd09d4da4e43645ea525d2d8d99","amp;dn":"Angus+Trumble+-+A+Brief+History+of+the+Smile+%5B2004%5D%5BA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8fe7761f5bb09cd09d4da4e43645ea525d2d8d99","infoHashBuffer":{"type":"Buffer","data":[143,231,118,31,91,176,156,208,157,77,164,228,54,69,234,82,93,45,141,153]},"announce":[],"urlList":[]}}