{"title":"Waste Electrical and Electronic Equipment","uid":8222377,"size":8393569,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:909e07340aea3b24f406f24c154d6d5f2d73295a&amp;dn=Waste+Electrical+and+Electronic+Equipment&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1362506229,"description":"Waste Electrical and Electronic Equipment (WEEE) Handbook By Vannessa Goodship, Ab Stevels\n2012 | 752 Pages | ISBN: 0857090895 | PDF | 8 MB\n\n\n\nElectrical and electronic waste is a growing problem with the amount of waste quickly increasing. Rapid product innovation and replacement, especially in information and communication technologies (ICT), combined with the migration from analog to digital technologies and to flat-screen televisions and monitors has resulted in some electronic products quickly reaching the end of their life. The Europeean Union (EU) directive on waste electrical and electronic equipment (WEEE) aims to minimize WEEE by putting organizational and financial responsibility on producers and distributors for collection, treatment, recycling and recovery of WEEE. Therefore all stakeholders need to be well-informed about their WEEE responsibilities and options. While focusing on the EU, this book draws lessons for policy and practice from all over the world.\n\nThe book is divided into six sections: Legislation and intiatives to manage WEEE; Technologies for refurbishment, treatment and recycling of waste electronics; Electronic products that present particular challenges for recyclers; Sustainable design of electronics and supply chains; National and regional WEEE schemes; Corporate WEEE management strategies. Part one covers the problems of e-waste from a strategic perspective covering both legislation and international initiatives, while chapters in the second part take a more technical approach by discussing best practice approaches. Chapters 13-17 highlight some waste streams that present particular challenges due to complexity, toxicity, lifetimes and technological developments. This covers relevant chapters on printed circuit boards, liquid crystal displays, refrigerators, batteries and printed electronics. Section four looks at how design can reduce the cost and environmental impacs of electronic products. The final two parts look at e-waste from a reginal perspective, with contributors considering practices in Europe, China, India, Japan and Africa, and at waste management from the companies' perspective, such as Hewlett Packard and Siemens and Philips. ","torrent":{"xt":"urn:btih:909e07340aea3b24f406f24c154d6d5f2d73295a","amp;dn":"Waste+Electrical+and+Electronic+Equipment","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"909e07340aea3b24f406f24c154d6d5f2d73295a","infoHashBuffer":{"type":"Buffer","data":[144,158,7,52,10,234,59,36,244,6,242,76,21,77,109,95,45,115,41,90]},"announce":[],"urlList":[]}}