{"title":"King.Kong.PS2DVD-Allstars","uid":3405224,"size":1259062887,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:90a4687412ba314b57aee97ebd9129d49af17441&amp;dn=King.Kong.PS2DVD-Allstars&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"yiuloan","files":28,"time":1131136490,"description":"NFO:\n------\n\n.. Allstars present :\n\n    King Kong\n\n.. iNFOS :\n\n    Rel.Date.: 11/04/05\n    Platform.: PS2\n    Genre....: Action/Adventure\n    Source...: PAL\n    Languages: DE/DK/ES/FR/FI/IT/NL/NO/SE/UK\n    Format...: .iso\n    Size.....: 1 DVD\n\n\n.. gAME iNFOS :\n\n    Acclaimed game creator Michel Ancel and the Montpellier studio\n    collaborate with triple Academy Award-winning filmmaker Peter Jackson\n    and visual-effects company Weta Ltd. to develop Peter Jackson's\n    King Kong, a video game that will capture the imagination, vision and\n    emotion of the epic film.\n\n    Delve deeper into the film experience through alternative viewpoints\n    designed to immerse the player into the action and truly &quot;feel&quot; the\n    tension of the adventure.\n\n    Key Features\n\n    * Unprecedented Alternating Gameplay\n      Battle for survival on Skull Island in first-person as Jack Driscoll\n      AND experience the staggering power of King Kong in third-person taking\n      on massive beasts.\n    * Cinematic Quality\n      By integrating Weta assets directly into the game engine, and taking a\n      true cinematic approach, from both a visual and audio perspective,\n      players are thrust directly onto the Skull Island where the dark\n      jungles, over-sized environment and lurking danger become reality.\n    * Cooperate with Your Expedition Team\n      Each team member plays a crucial role and complements each other with\n      valuable skills and abilities. The player relies on them and vice-versa\n      to succeed. The unique resource management system keeps the action\n      seamless and plausible while keeping items, weapons and assets readily\n      available.\n    * The Power of King Kong\n      King Kong is one of the most powerful of all the creatures on Skull\n      Island and players will learn first-hand what it means to be feared,\n      respected and dominant. Kong will use both his agility and his raw,\n      brute strength by any means necessary to battle enemies and navigate\n      though the perils of Skull Island.\n    * Experience All Key Movie Moments and More\n      Journey through the explosive action of all the key movie moments, as\n      Jack and Kong, and even explore the beautifully-rendered mysterious\n      jungle environments not seen in the film.\n    * Engage in Climactic Battles\n      Intense and unbelievable battles with all creatures featured in the\n      film challenge players' nerves and skills in fighting the savage beasts\n      created by Weta - some of which are exclusive to the game.\n    * Film Cast Likeness and Voice\n      Full immersion into the dynamic King Kong universe realized via\n      inclusion of film cast member's likenesses and voice-over.  \n\n   Enjoy!\n\n   - Allstars\n","torrent":{"xt":"urn:btih:90a4687412ba314b57aee97ebd9129d49af17441","amp;dn":"King.Kong.PS2DVD-Allstars","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90a4687412ba314b57aee97ebd9129d49af17441","infoHashBuffer":{"type":"Buffer","data":[144,164,104,116,18,186,49,75,87,174,233,126,189,145,41,212,154,241,116,65]},"announce":[],"urlList":[]}}