{"title":"Los.Ojos.Vendados.1978.TVRip.DivX5","uid":5428643,"size":1005075898,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:90d1491f3277b2bae7de754612642305c309925f&amp;dn=Los.Ojos.Vendados.1978.TVRip.DivX5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ab-resende","files":3,"time":1268335364,"description":"Practically unseen Carlos Saura film deserves resurrection, 26 April 2007\n\n\nSaura's collaborations with Geraldine Chaplin are the shining lights of his career and LOS OJOS VENDADOS is no exception. Her presence in this film is indispensable to its success, and she is never less than mesmerizing. I would need at least another viewing to begin to appreciate fully the film's layers and nuances -- the ways it links falling in love with the disintegration of existing relationships; persistence of memories with dreams and nightmares; persecution by self, others and society with political terrorism.\n\nThe film is filled with unforgettable imagery and haunting moments. Except for two overlong and overdone sequences (ironically, one of which is a dance scene given that Saura's reputation today rests mostly on his dance films), LOS OJOS VENDADOS is one of Saura's strongest films. The final 5 minutes are unforgettable.\n\nUnseen in New York for 28 years, LOS OJOS VENDADOS drew only a handful of viewers at the showing I saw. The film cries out for restoration (the print the Film Society managed to unearth was faded pink and had a botched subtitling job). It is perhaps an even more relevant and powerful film now than it was in 1978.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0078021/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0078021/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:90d1491f3277b2bae7de754612642305c309925f","amp;dn":"Los.Ojos.Vendados.1978.TVRip.DivX5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90d1491f3277b2bae7de754612642305c309925f","infoHashBuffer":{"type":"Buffer","data":[144,209,73,31,50,119,178,186,231,222,117,70,18,100,35,5,195,9,146,95]},"announce":[],"urlList":[]}}