{"title":"Brian Jonestown Massacre - Bravery Repetition and Noise (2001) [","uid":4657313,"size":247918015,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:915e9f9ea36a0904bce4ec4f2a3647a2754582b8&amp;dn=Brian+Jonestown+Massacre+-+Bravery+Repetition+and+Noise+%282001%29+%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sjbnj","files":13,"time":1232247169,"description":"The Brian Jonestown Massacre - Bravery Repetition and Noise  (2001)\nFLAC rip from 180g vinyl\n\nHaving long explored the ins and outs of psychedelia, the Brian Jonestown Massacre now delve deep into the gloaming world of pop. Bravery, Repetition and Noise is a darkly dreamy album, rich in atmospheres, layered in waves of sound, moody pop for disillusioned people. The album's antecedents are clear, the gloomy post-punk Brit bands whose angst shuddered out across the airwaves in the late '70s through the early '80s. Of course, many of those groups were as inspired by psychedelia as they were by punk's nihilism, pulling both strands into a doom-laden, experimental sound quite distinct from anything that had come before or since. BJM uses this as their touchstone, lovingly re-creating the moods and atmospheres of the past. The vast vistas of &quot;Open Heart Surgery,&quot; for example, is so Cure-esque that it seems to have been ripped right out of the hands and mouth of Robert Smith. &quot;Just for Today&quot; is Echo and the Bunnymen transplanted to San Francisco circa 1967, which is where they really wanted to be half the time anyway. Brighter numbers are still capped by dark clouds, musically and lyrically, poppier melodies are snatched out of the sun to bask in the shadows, while there's even a handful of more acoustic ballads to give the whole concept a twist. Bravery may have started at post-punk's knees, but by the end shimmers into a category all its own, and its all the more enjoyable for it.\n\n\nTrack Listing:\n1. Just For Today\n2. Telegram\n3. Stolen\n4. Open Heart Surgery\n5. Nevertheless\n6. Sailor\n7. You Have Been Disconnected\n8. Leave Nothing for Sancho\n9. Let Me Stand Next To Your Flower\n10. If I LoveYou?\n11. (I Love You) Always\n12. If I Love You (New European Gold Standard Secret Babylonian Brotherhood Cinema Mix)\n\nForgive me Anton.  I love you.","torrent":{"xt":"urn:btih:915e9f9ea36a0904bce4ec4f2a3647a2754582b8","amp;dn":"Brian+Jonestown+Massacre+-+Bravery+Repetition+and+Noise+%282001%29+%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"915e9f9ea36a0904bce4ec4f2a3647a2754582b8","infoHashBuffer":{"type":"Buffer","data":[145,94,159,158,163,106,9,4,188,228,236,79,42,54,71,162,117,69,130,184]},"announce":[],"urlList":[]}}