{"title":"Phil Heath - Becoming Number 13.mp4","uid":7545762,"size":1469548968,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:9166434488643708544bfe130e03c92d4aac6886&amp;dn=Phil+Heath+-+Becoming+Number+13.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SAMSON4X","files":1,"time":1345343386,"description":"Workout chronicle starts at 42 days out of the O 2 265lbs. Phil is sporting Vibram shoes and Bose headphones as he describes the upcoming workout and narrates throughout the exercises.\n\nworkout 1: Quads\nLeg Extensions, Squats(Nice to see there are still Pros out there who are willing to squat), vertical leg presses and Lunges outdoor a la Coleman.\n\nUnfortunately Phil picked up the bad habit of screaming and grunting from Jay from rep one, something i am personally not a fan of so I am biased.\n\nPhil then travels to the Arnold in Columbus where we see cameos from Jay, Cedric McMillan who looks huge, Johnnie Jackson and Branch Warren. His personality comes through as he interacts with fans which is nice to see considering most pros have the personality of protein pancakes. Phil gets it, and he is quite humble which will make him very marketable.\n\nIn between each segment , he also pays tributes to past Olympia winners by showing quotes of the past.\n\nWorkout #2: Delts\nHammer strength presses, seated laterals, seated rear laterals, barbell front raises, cable high rows, cybex shoulder presses\n\nPhil then travels to the FIBO Expo in Germany and interacts with fans. There is a cameo appearance by Dennis James sporting a porn stache.\n\nWorkout #3: Back\nChin ups, reverse grip bent rows, Dumbbell Rows, Seated Row Nautilus, Machine Pullovers.\n\nFlashback to the FIBO again as Phil pumps up in front of spectators before guest posing.\n\nWorkout #4: Hamstrings &amp; Calves\nlying leg curls, standing leg curls, seated leg curls Hammer strength, stiff legged deadlifts dumbbells, seated calf raises, seated calf extensions, standing calf raises.\n\nThen onto Ontario for a Training Camp with the fans\n\nWorkout #5: Chest-Phil looks very flat and depleted 14 days from the O, could pass for a CrossFitter on this one, weird.\nhammer strength chest presses, dbell flyes, leverage chest presses, incline cable flyes.\n\nWorkout #6: Arms...7 days out of the O. I have never seen a pro so flat, makes him look the total opposite of his stage presence.\nstanding barbell curls, iso machine curls, spider curls barbell, hammer curls\nsingle arm rope pushdowns, incline skull crushers w/close grip presses, dips\n\nOnto the O, start with meeting the Olympians. Phil talks about the gratitude he has for his support group and the fans that spend their hard earned money to come see bodybuilding and how much of an honor it is.Backstage footage with Phil narrating everything he felt at each step of the journey was enlightening. Phil then enters the stage from the compulsory poses looking shredded then comparisons with Ja\ny.\nO Expo Footage follows...\n\nFinal showdown footage was shown with Phil's routine and comparisons again with Jay and the declaration of the new O.\nBackstage footage after the win, greeting the crowd as the new Mr. O and finally celebrating with his support group and onto club Xcess at the Encore Hotel.\nIf you like narrative dvds then this is the one for you, if you like more workout vids then go for Journey to the O or the gift unwrapped.","torrent":{"xt":"urn:btih:9166434488643708544bfe130e03c92d4aac6886","amp;dn":"Phil+Heath+-+Becoming+Number+13.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9166434488643708544bfe130e03c92d4aac6886","infoHashBuffer":{"type":"Buffer","data":[145,102,67,68,136,100,55,8,84,75,254,19,14,3,201,45,74,172,104,134]},"announce":[],"urlList":[]}}