{"title":"Mesut Kurtis Discography","uid":6038951,"size":193039460,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:91bffa452c92d3a1ec74486afb936f0a43347e4d&amp;dn=Mesut+Kurtis+Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"kamshufna","files":32,"time":1292324815,"description":"Mesut Kurtis Discography\n\n--------------------------------------------------\n2005 Salawat [192 Kbps, Stereo]\n1. Mesut Kurtis - No One But Allah (5:18)\n2. Mesut Kurtis - Salawat (4:16)\n3. Mesut Kurtis - Burdah (4:45)\n4. Mesut Kurtis - Never Forget (4:53)\n5. Mesut Kurtis - Ya llahal Kawni (4:39)\n6. Mesut Kurtis - 'Alayka (4:42)\n7. Mesut Kurtis - Tala 'al Badru 'Alayna (5:28)\n8. Mesut Kurtis - O Allah (featuring Sami Yusuf) (6:42)\n\n--------------------------------------------------\n2009 Beloved [192 Kbps, Stereo]\n1. Mesut Kurtis - Rabbi Sally (Beloved) (3:35)\n2. Mesut Kurtis - Ya Allah (3:21)\n3. Mesut Kurtis - I Think Of you (Sobhan Allah) - Featuring Irfan Makki (4:11)\n4. Mesut Kurtis - Waddily Salamy (4:32)\n5. Mesut Kurtis - Dhikru Allah (3:56)\n6. Mesut Kurtis - Every Breath is a Blessing (3:22)\n7. Mesut Kurtis - Anty (Al-Hijab) (4:12)\n8. Mesut Kurtis - Badr El-Medina (3:29)\n9. Mesut Kurtis - Never Forget featuring Maher (5:06)\n10. Mesut Kurtis - My Wish for the World (2:59)\n11. Mesut Kurtis - Fi Jawf El-Lail (3:58)\n12. Mesut Kurtis - Rabbi Sally (Beloved) 'Remix' (3:42)\n\n--------------------------------------------------\n2009 Sevgili [192 Kbps, Stereo]\n1. Mesut Kurtis - Sevgili (3:36)\n2. Mesut Kurtis - Varligin Asikar (3:22)\n3. Mesut Kurtis - Seni Hatirlarim (featuring Irfan Makki) (4:11)\n4. Mesut Kurtis - Ey Yolcu (4:34)\n5. Mesut Kurtis - Bismillah (3:57)\n6. Mesut Kurtis - Arkadasim (3:24)\n7. Mesut Kurtis - Zulme Feryad (4:14)\n8. Mesut Kurtis - The Full Moon of Medina (3:31)\n9. Mesut Kurtis - Never Forget featuring Maher (5:08)\n10. Mesut Kurtis - Ozlemim (3:01)\n11. Mesut Kurtis - Yaradana (4:00)\n12. Mesut Kurtis - Sevgili (Remix) (3:40)\n\n--------------------------------------------------\nVocal extraordinaire Mesut Kurtis is now being called one of the biggest stars of nasheed and Islamic Music. His unforgettable rendition of the Burdah and the music video for it have become modern-day classics, and his new album &quot;Beloved&quot; has been a groundbreaking phenomenon in this genre of music across the Muslim world.\n\nMesut Kurtis was born in 1981 in Skopje, Macedonia to a family of Turkish origin. He found in himself a deep-seated connection with music at a very early age. From there he went on to perform with groups in the local social clubs, mosques, and conferences. He went onto study at an College of Skojpe and then traveled to the UK to study for a degree in Human Sciences at the University of Lampeter.\n\nMesut's first album &quot;Salawat&quot; was very warmly received by listeners around the world. His uniquely strong voice and soulful songs gave Mesut a large and loyal fan-base which multiplied manifold after the release of his well-known and much-loved music video Al-Burdah which was filmed on location in the islands off the coast of Turkey.\n\nMesut would describe his music as having a mix influences of Eastern and Western styles. He sings mainly about putting love into people's hearts towards Allah and his beloved Prophet Muhammad, peace be upon him. He likes to send out a positive and hope-filled message despite all the bad things that are happening in the world today. Mesut wants to share with his listeners a message of peace, harmony and love and to always look at the bright side of things.\n\nMesut has performed to sell out crowds in some of the most prestigious concert halls the UK, Australia, Germany, Switzerland, France, Belgium, Macedonia, Turkey, Saudi Arabia, Bahrain and Kuwait to mention just a few. His ringtones feature in the top selling ring tones in the GCC. Mesut recently launched his new album at the Virgin Megastore in Jeddah and was a guest artist / performer in the world's biggest operetta on the Prophet's life.\n\nIt is possible that there are singers alive today with more passion, conviction and beauty than Mesut Kurtis singing nasheeds today, but it's doubtful. Ever since the release of his debut album &quot;Salawat&quot; and his second album &quot;Beloved&quot; the glory-giving soprano has built for himself a very wide fan-base, being a favorite of listeners of all ages.\n","torrent":{"xt":"urn:btih:91bffa452c92d3a1ec74486afb936f0a43347e4d","amp;dn":"Mesut+Kurtis+Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91bffa452c92d3a1ec74486afb936f0a43347e4d","infoHashBuffer":{"type":"Buffer","data":[145,191,250,69,44,146,211,161,236,116,72,106,251,147,111,10,67,52,126,77]},"announce":[],"urlList":[]}}