{"title":"VA-Dance and House Music(2011)MP3 Nlt-release","uid":6921378,"size":1746597857,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:93a45018655e62522b529860b5e1e96cef1a4d88&amp;dn=VA-Dance+and+House+Music%282011%29MP3+Nlt-release&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"hopyxxx","files":-1,"time":1325237565,"description":"\n\nVA-Dance and House Music(2011)MP3 Nlt-release\n\n\nTracklist:\n\n\nDEpeche Mode - Behind The Wheel (Mark Picchiotti Re-Edited Vince Clarke Dub)\n\n2. RJ ft. Pitbull - U Know It Ain-t Love (DJ Rebel Remix)\n\n3. Yolanda Be Cool ft. Crystal Waters - Le Bump (Dj C!ub Bootleg)\n\n4. Black Legend - You See the Trouble With Me (Lissat &amp; Voltaxx Remix)\n\n5. Deadmau5 - Brazil (Zappaz Extended 2012 Remix)\n\n6. Dacav5 - Dirty Style (Wideboys Dub)\n\n7. Dada Life - Happy Violence (Cat Skillz Remix)\n\n8. Rizzle Kicks - Mama Do The Hump (Freemasons Radio Edit)\n\n9. Kim Sozzi - Crystallized (Ron Reeser Radio Mix)\n\n10. Maroon 5 feat. Christina Aguilera vs. Dave Kurtis - Moves like Killer (DJ Favorite &amp; Ian Deluxe Mash Up)\n\n11. Nicki Minaj - Super Bass (Tommy Love House Mix)\n\n12. Emile - Heaven (Freemasons Booty)\n\n13. David Guetta &amp; Usher - Without You (Dj Shakey Remix)\n\n14. Avenue D - Do I Look Like A Slutt (Seductive Remix)\n\n15. Coldplay - Paradise (Mike Foyle &amp; X-Vertigo ft Raphael Pujol Vocal Mix)\n\n16. RAW Feat. Amanda Wilson - Intoxicated (Dan Grooves 'Intoxicated Dizco' Mix)\n\n17. Erika Jayne - Party People (Ignite The World) (DJ Irene Party Club Remix)\n\n18. Beyonce - Countdown (Edson Pride Futuristic Lover Mix)\n\n19. David Guetta feat. Nicki Minaj - Turn Me On (Mikael Wills Bootleg)\n\n20. Michel Telo \\u2013 Ai Se Eu Te Pego (Afro Bros Bootleg)\n\n21. Dirty South &amp; Thomas Gold feat. Kate Elsworth - Alive (Alesso Remix)\n\n22. Eric Saade - Hearts In The Air (The Alias Radio Edit)\n\n23. Jamie Woon - You Are Not Alone (Mike Newman White Label Mix)\n\n24. LMFAO vs Zoe Badwi - In The Party Rock Moment (Argonaut Remix)\n\n25. John Debo &amp; Mezo - Living It Up (Jeziel Quintela, Jquintel &amp; Manufactured Superstars Remix)\n\n26. DJ Ozeroff &amp; DJ Sky feat. Sax Delight &amp; Roma - Happy Jingle Bells 2012 (Original Vocal Mix)\n\n27. David Guetta feat. Sia &amp; Mary J. Blige - Titanium (Nylson Wash Anthem Mix)\n\n28. Third Party vs Justice vs Congorock vs SHM - Save The Duel Babylon Friends (Ken Loi Bootup)\n\n29. Adele - Rolling In The Masons (Freemasons Booty)\n\n30. Masters at Work - Works the Spell (Funk D Bootleg)\n\n31. Katy Perry - The One That Got Away (E-Thunder Remix)\n\n32. Haji &amp; Emanuel vs. Belocca &amp; Soneec - Weekend Someday (Mike Mildy Mash Up)\n\n33. Rihanna - Where Have You Been (Sweet Beatz Project Rework)\n\n34. Fedde Le Grand Vs De Boss - So Much Love On The Run (Stereo Palma Mashup)\n\n35. Britney Spears - Inside Out (Martin &amp; Souza Remix)\n\n36. Gloria Estefan - Hotel Nacional (The Thin Red Men Extended Mix)\n\n37. Laidback Luke Feat. Jonathan Mendelsohn - Timebomb (Tony Tweaker &amp; Flat Basse Remix)\n\n38. Hardwell vs. Nero - Cobra Promises (Denzal Park Mash)\n\n39. Rolling Stones vs. Benny Benassi - Satisfaction (Dj's From Mars Mashup)\n\n40. Claudia feat. Fatman Scoop - Just A Little Bit (Andrew Carrige &amp; Palace Remix)\n\n41. David Guetta feat. Sia - Titanium (MiikeBeatz Bootleg)\n\n42. Cosmic Funk vs. Edwin Starr - War (Cosmic Funk Bootleg)\n\n43. Andrew Spencer - Hippie Dreams (Thomas You Remix)\n\n44. Benni Benassi Feat. Chris Brown - Beautiful People (Funk D mts Ludovika Bootleg)\n\n45. Adele - Rolling in the deep (Funk D's Reworked Bootleg)\n\n46. Cover Drive - Twilight (Fasano &amp; Forest Dirty Shade Mix)\n\n47. One Direction - Gotta Be You (Steve Smart &amp; WestFunk Radio Edit)\n\n48. EDX feat. John Williams - Give It Up For Love (Original Club Mix)\n\n49. Nightcrawlers - Push the Feeling (Freemasons Booty)\n\n50. Roll Deep - Picture Perfect (Dave Silcox &amp; Matt Nash Radio Edit)\n\n51. Kelly Clarkson - Mr. Know It All (Audio Assembly Radio Edit)\n\n52. 50 Cent ft. Drake &amp; Quincy Jagher - Be My Girl (Dmitry Truntov Bootleg)\n\n53. Sean Paul ft Alexis Jordan - Got 2 Luv U (Funk D Bootleg)\n\n54. Kimps vs. Ian Carey - Clonus On Rising (Dj Flight Airwave Mash)\n\n55. Inna feat. Vintazh &amp; Dj Kerimov - Bigroom Club Rocker (DJ Favorite &amp; Ian Deluxe Mash-Up)\n\n56. September - Cry For You (Gordon &amp; Doyle Bootleg)\n\n57. Richard Grey ft. Gosha - Falling Down (Instrumental Mix)\n\n58. The Killers - Somebody told me (Sebastien Benett Remix)\n\n59. Hoxton Whores vs Chris Lake - Devil Toy &amp; Changes (Freemasons Booty)\n\n60. Dada Guetta - Without The Epic Motherfucker (DJs From Mars Mashup)\n\n61. David Puentez feat. Max C. - Things We Do 4 Love (Original Mix)\n\n62. Rihanna - Where Have You Been (Edson Pride Reconstruction Mix)\n\n63. Daft Punk - Harder Better Stronger (Freemasons Booty)\n\n64. Donaeo - Party Hard (Genairo Nvilla &amp; Chuckie Amazone Project Remix)\n\n65. Afrojack - Lionheart (Delicious Layzas Moombahton)\n\n66. Mord Fustang - We Are Now Connected (Sound Remedy Remix)\n\n67. John Dahlback - Grunge (Kevin Aye Edit)\n\n68. Stonebridge, Funky Junction &amp; Chris Kaeser - MDF (Fred Lilla Remix)\n\n69. Remady, Mike Candys vs. Captain Hollywood Project - Do It On My Over (Bikini DJs Mash Up)\n\n70. Jay Lumen vs. Jon Cutler feat. E-Man - It's All I Want (Mike Mildy Mash Up)\n\n71. Yolanda Be Cool - Le Bump (feat. Crystal Waters) (Lockout's Big Bump Mix)\n\n72. The Ian Carey Project - Get Shaky (Daav One Remix)\n\n73. Bob Sincler vs Karlos Kastillo - Far Lamor Back (Deejay LilBoy Bootleg)\n\n74. Alice Deejay - Better Off Alone 2012 (AlexSander Private Mix)\n\n75. Adele - Someone Like You (Arias Vision)\n\n76. Sean Paul - She Doesn't Mind (Funk D Bootleg)\n\n77. Avicii &amp; Nicky Romero vs. Bjornberg vs. Justice - Fuck Absolut Dance (Pixel Cheese Knockout Bootleg)\n\n78. Jason Rivas - The Rhythm of the Night (Zonum Remix)\n\n79. Prince - When Doves Cry (Freemasons Booty)\n\n80. Rihanna vs Funk D - Me Energy (Funk D's Bootleg Mix)\n\n81. Raph Solo - Finally (Ruff Loaderz Club Mix)\n\n82. The Sharp Boys vs. Madonna - Hung Right (DJ Slider Mashizz)\n\n83. Muzzaik vs. Laurent Wolf vs. Spankox - Feelin Club (Mike Mildy 'Sax' Mash Up)\n\n84. Rikah \\u2013 Missing 2012 (Tale &amp; Dutch Edit)\n\n85. DJ Tiesto - Traffic (Bart &amp; Nexboy Remix)\n\n86. Inna - Endless (Phonk D'Or Mix)\n\n87. Pixie Lott - Kiss The Stars (Doman &amp; Gooding Extended Mix)\n\n88. K.C. &amp; The Sunshine Band vs. Plastik Funk &amp; Dave Kurtis - That's The House Music (Mike Mildy Mash Up)\n\n89. Chizzo And Maxim Feat. Amanda Wilson - Runaway (Radio Edit)\n\n90. Cascada - Night Nurse (Christian Davies Remix)\n\n91. Taio Cruz - Troublemaker (Moombahton Remix)\n\n92. Serge Devant Feat Coyle Girelli - On Your Own (Club Edit)\n\n93. 50 Cent - Candy Shop (DJ V1t &amp; DJ Johnny Clash Remix)\n\n94. Warp Brothers - Phat Bass (Funk D's Remastered Bootleg)\n\n95. Delivio Reavon &amp; Aaron Gill feat. Phatt - Dancing (Mitchell Niemeyer Remix)\n\n96. Steve Aoki &amp; Zuper Blahq - I'm In The House (R3hab's Surrender Remix)\n\n97. Cold Blank - 2012 (Distantt Remix)\n\n98. Rogerio Lima - You Said (Edson Pride Remix)\n\n99. Ida Corr vs. Fedde Le Grand vs. Lmfao - Let Me Think About Party Rock (Anton Tochka Mash-Up Ver.2)\n\n100. David Guetta &amp; Avicii - Sunshine (Pedro Henriques ReWork)\n\n101. Avicii - Levels (Funk D Bootleg)\n\n102. Rhianna - Only Girl (Freemasons Booty)\n\n103. Tom Wax vs Jerome Isma - Welcome Back 959 (fLex Bootleg)\n\n104. Afrojack feat. Eva Simons - Take Over Control (Arthur Dutch Bootleg)\n\n105. Beyonce - End Of Time (Manny Lehman Club Mix)\n\n106. Red Hot Chili Peppers - Otherside (DJ Newklear &amp; Proxy Figura Mashup Mix)\n\n107. Lady Gaga - Marry The Night (Dimitri Vegas &amp; Like Mike Remix)\n\n108. Brian Kent - Su-Su-Su-Superstar (Loverush UK! Club Mix)\n\n109. Switch vs David Guetta - Patchy World (Freemasons Booty)\n\n110. Rihanna feat. Calvin Harris - We Found Love (Bocchetti Remix)\n\n111. Traci Lords - Last Drag (Alex MORPH Club Mix)\n\n112. Ivan Project &amp; Chriz Samz - Beautiful Morning (Ruben Amaya Remix)\n\n113. Katy Perry vs. Freemasons - Firework &amp; Believer (Freemasons Booty)\n\n114. Kelis - Acappella (Freemasons Booty)\n\n115. Gers Pardoel - Ik neem je mee (Martin Garrix &amp; Funk D bootleg)\n\n116. D-Unity - Subterraneo (Vlada Asanin Remix)\n\n117. Rihanna - You Da One (Linuxis1994 Remix)\n\n118. Ice MC - Think About The Way (Maxi Groove Remix)\n\n119. Benni Benassi &amp; Skrillex - Cinema (Funk D Bootleg)\n\n120. Kaskade vs. Laidback Luke - All That Disaster (Kaskade Mash Up)\n\n121. DJ Antoine - Welcome To St.Tropez (Mike Candys After Summer Bootleg Mix)\n\n122. Kaskade With Rebecca &amp; Fiona - Turn It Down (Christian Luke Remix)\n\n123. Housemaxx &amp; Crystal Rock - You (Club Mix)\n\n124. Lopes Twins vs. Afro Medusa - La Noche Pasilda (DJ Flight Secret Mash)\n\n125. Nero - Crush On You (Sound Remedy Remix)\n\nPostinfo:\n\nCategory : Sound \n  Format : MP3 \n  Source : Compilatie  \n  Bitrate :320kbps  \n  Genre : Dance/House\n  Tag(s) : NLT\n\nEnjoy,\n\nNLT_RELEASE  IS WEER TERUG KOM SNEL NAAR:\n &lt;a href=&quot;\nhttp://www.nlt-release.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.nlt-release.nl&lt;/a&gt;\n\nBy Hopy\n\n","torrent":{"xt":"urn:btih:93a45018655e62522b529860b5e1e96cef1a4d88","amp;dn":"VA-Dance+and+House+Music%282011%29MP3+Nlt-release","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93a45018655e62522b529860b5e1e96cef1a4d88","infoHashBuffer":{"type":"Buffer","data":[147,164,80,24,101,94,98,82,43,82,152,96,181,225,233,108,239,26,77,136]},"announce":[],"urlList":[]}}