{"title":"So.You.Think.You.Can.Dance.S04E14.HDTV.XviD-ORENJi","uid":4287401,"size":732589439,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:94c1133ec285e80dcc07e4118c4290143d0ddbbc&amp;dn=So.You.Think.You.Can.Dance.S04E14.HDTV.XviD-ORENJi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"circlensess","files":2,"time":1215776789,"description":"So.You.Think.You.Can.Dance.S04E14.HDTV.XviD-ORENJi\ndate: Thu Jul 10 2008\nSo You Think You Can Dance\nGenre: Reality\nYear of Production: 2008\nRuntime: 84 min\n\nPlot:So You Think You Can Dance is an American dance reality show and competition that is broadcast on the Fox Network in the U.S. and Japan, on CTV and MuchMusic in Canada, on Living in United Kingdom and Ireland, on Network Ten in Australia sponsored by Optus, on AXN in India, on MBC 4 in the Middle East and on TVN in Poland.\n\nThe series premiered on July 20, 2005 and has a similar premise to the American Idol series of singing competitions, with nationwide auditions leading to the discovery of the next big star. The show was created by Idol&amp;#039;s Simon Fuller and Nigel Lythgoe and is produced by 19 Entertainment and Dick Clark Productions. A mixture of contestants is chosen for the show, ranging from unknown street dancers to winners of national championships. All contestants have to work their way through a rigorous audition process, and, over the course of the show, are assigned different dance styles and partners each week to test their versatility.\n\nIt was the #1 rated show in summer 2006 for adults aged 18-49, and in July 2007, while still in production of its third season, it was renewed for its fourth season. The first season was hosted by Lauren Sa&amp;#039;nchez; the show is currently hosted by Cat Deeley. In August 2006, it was also announced that there are now spinoff versions of the show in New Zealand, Turkey, Israel, Canada, Germany, Greece, Poland, Malaysia, Norway, and Australia, with several other countries in the works.\n\nSo You Think You Can Dance holds auditions in major cities across the U.S., looking for the top dancers in each city. All types of dance backgrounds are encouraged to audition. Salsa, ballroom, hip hop, street dancing, contemporary, jazz, ballet and many other types of dancers can be seen auditioning for a chance to win the grand prize?which, in the past, has included a new Hybrid SUV, $100,000 in cash, and a dancing role in Celine Dion&amp;#039;s Las Vegas show?of US$250,000 and the title of &quot;America&amp;#039;s favorite dancer.&quot;Kutcher and Jason Goldberg, and co-executive produced by Barbie Adler and creator Caroline Williams. &quot;Miss/Guided&quot; is produced by 20th Century Fox Television and ABC Studios.","torrent":{"xt":"urn:btih:94c1133ec285e80dcc07e4118c4290143d0ddbbc","amp;dn":"So.You.Think.You.Can.Dance.S04E14.HDTV.XviD-ORENJi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94c1133ec285e80dcc07e4118c4290143d0ddbbc","infoHashBuffer":{"type":"Buffer","data":[148,193,19,62,194,133,232,13,204,7,228,17,140,66,144,20,61,13,219,188]},"announce":[],"urlList":[]}}