{"title":"The Extended Mind","uid":6525859,"size":16883540,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:953bec37489eb47cb719f783bf59666abb3413f3&amp;dn=The+Extended+Mind&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"_F1_","files":-1,"time":1310155345,"description":"Robert K. Logan, &quot;The Extended Mind: The Emergence of Language, the Human Mind, and Culture (Toronto Studies in Semiotics and Communication)&quot;\n Publisher: University of Toronto Press, Scholarly Publishing Division | ISBN 10: 0802093035 | 2007 | PDF | 284 pages | 26.2 MB\n\n The ability to communicate through language is such a fundamental part of human existence that we often take it for granted, rarely considering how sophisticated the process is by which we understand and make ourselves understood. In The Extended Mind, acclaimed author Robert K. Logan examines the origin, emergence, and co-evolution of language, the human mind, and culture.\n\n Building on his previous study, The Sixth Language (2000) and making use of emergence theory, Logan seeks to explain how language emerged to deal with the complexity of hominid existence brought about by tool-making, control of fire, social intelligence, coordinated hunting and gathering, and mimetic communication. The resulting emergence of language, he argues, signifies a fundamental change in the functioning of the human mind - a shift from percept-based thought to concept-based thought.\n\n From the perspective of the Extended Mind model, Logan provides an alternative to and critique of Noam Chomsky's approach to the origin of language. He argues that language can be treated as an organism that evolved to be easily acquired, obviating the need for the hard-wiring of Chomsky's Language Acquisition Device. In addition Logan shows how, according to this model, culture itself can be treated as an organism that has evolved to be easily attained, revealing the universality of human culture as well as providing an insight as to how altruism might have originated. Bringing timely insights to a fascinating field of inquiry, The Extended Mind will be sure to find a wide readership.","torrent":{"xt":"urn:btih:953bec37489eb47cb719f783bf59666abb3413f3","amp;dn":"The+Extended+Mind","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"953bec37489eb47cb719f783bf59666abb3413f3","infoHashBuffer":{"type":"Buffer","data":[149,59,236,55,72,158,180,124,183,25,247,131,191,89,102,106,187,52,19,243]},"announce":[],"urlList":[]}}