{"title":"An Empire of Memory - Gabriele, Matthew [Non-Fiction] Mobi/Epub/","uid":8853156,"size":3459652,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9835a9b0b35eb6a47af8f6c06041f2059ffa92bd&amp;dn=An+Empire+of+Memory+-+Gabriele%2C+Matthew+%5BNon-Fiction%5D+Mobi%2FEpub%2F&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"K-Slender","files":5,"time":1377583326,"description":"\nBeginning shortly after Charlemagne's death in 814, the inhabitants of his historical empire looked back upon his reign and saw in it an exemplar of Christian universality - Christendom. They mapped contemporary Christendom onto the past and so, during the ninth, tenth, and eleventh centuries, the borders of his empire grew with each retelling, almost always including the Christian East. Although the pull of Jerusalem on the West seems to have been strong during the eleventh century, it had a more limited effect on the Charlemagne legend. Instead, the legend grew during this period because of a peculiar fusion of ideas, carried forward from the ninth century but filtered through the social, cultural, and intellectual developments of the intervening years.\n\nParadoxically, Charlemagne became less important to the Charlemagne legend. The legend became a story about the Frankish people, who believed they had held God's favour under Charlemagne and held out hope that they could one day reclaim their special place in sacred history. Indeed, popular versions of the Last Emperor legend, which spoke of a great ruler who would reunite Christendom in preparation for the last battle between good and evil, promised just this to the Franks. Ideas of empire, identity, and Christian religious violence were potent reagents. The mixture of these ideas could remind men of their Frankishness and move them, for example, to take up arms, march to the East, and reclaim their place as defenders of the faith during the First Crusade.\n\nAn Empire of Memory uses the legend of Charlemagne, an often-overlooked current in early medieval thought, to look at how the contours of the relationship between East and West moved across centuries, particularly in the period leading up to the First Crusade. ","torrent":{"xt":"urn:btih:9835a9b0b35eb6a47af8f6c06041f2059ffa92bd","amp;dn":"An+Empire+of+Memory+-+Gabriele%2C+Matthew+%5BNon-Fiction%5D+Mobi%2FEpub%2F","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9835a9b0b35eb6a47af8f6c06041f2059ffa92bd","infoHashBuffer":{"type":"Buffer","data":[152,53,169,176,179,94,182,164,122,248,246,192,96,65,242,5,159,250,146,189]},"announce":[],"urlList":[]}}