{"title":"WikiLeaks vs Visa-Mastercard.pdf","uid":6510503,"size":207823,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9875140ff7eb0ebc62d9c05b4e285c3e17fcd90d&amp;dn=WikiLeaks+vs+Visa-Mastercard.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":1,"time":1309601741,"description":"LEGAL ACTION BY WIKILEAKS AND DATACELL AGAINST VISA AND MASTERCARD\n\n\nWikiLeaks and Datacell (a service provider assisting WikiLeaks) are to sue Visa &amp; MasterCard for engaging in an unlawful, U.S. influenced, financial blockade.\n\nOn June 9th a the law firms Bender von Haller Dragested in Denmark and Reykjavik Law Firm in Iceland acting on behalf of DataCell and WikiLeaks told the companies that if the blockade is not removed they will be litigated in Denmark and a request for prosecution will be filed with the EU Commission. Visa Europe, MasterCard Europe, and Teller (a Danish company licensed to process transactions on behalf of the card companies) are the subjects of the complaint.\n\nIt was pointed out to these companies that their coordinated action on December 7th last year to block all credit card transactions to WikiLeaks and DataCell constituted a serious violation of the Competition Rules of the EU (Article 101(1) and 102). Furthermore, that the actions of these companies have violated Danish merchant laws when they terminated the payment services and by refused to reinstate them.\n\nVisa Europe, Master Card Europe, Teller and Korta where told that if the payment services would not be reinstated and liability for the damages accepted, DataCell and WikiLeaks would file a complaint to the European Commission regarding violation of EU competition laws and file a lawsuit with Danish Maritime and Commercial Court (So- og Handelsretten &quot;).\n\nTeller has acknowledged that it is ready to reinstate the services as due diligence by the company has not found any violations by DataCell, but, despite this, the company has been ordered by Visa and MasterCard to keep the payment services closed. Visa and Master Card (which have 70 and 25 percent market share in Europe respectively) have not answered the demands or shown willingness to negotiate a settlement.\n\nIn light of this outcome DataCell and WikiLeaks will instruct their international legal team to take actions against these companies in the coming days as outlined above. Further actions in other jurisdictions will follow.","torrent":{"xt":"urn:btih:9875140ff7eb0ebc62d9c05b4e285c3e17fcd90d","amp;dn":"WikiLeaks+vs+Visa-Mastercard.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9875140ff7eb0ebc62d9c05b4e285c3e17fcd90d","infoHashBuffer":{"type":"Buffer","data":[152,117,20,15,247,235,14,188,98,217,192,91,78,40,92,62,23,252,217,13]},"announce":[],"urlList":[]}}