{"title":"Blacksite Area 51 [FULL 2 DVD][Multi 5]","uid":5485480,"size":12084166504,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9886e5d59a13a5e89c837fbc8efafea2235ea735&amp;dn=Blacksite+Area+51+%5BFULL+2+DVD%5D%5BMulti+5%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"webchella","files":3,"time":1270684029,"description":"Platform: PC\nGenre: Action-Science Fiction - Shooter\nLanguage: Multi 5\n\nAfter two long years with respect to the predecessor title of the same series, Midway returns again to sumergirnos squarely on the mysteries inherent in the known Area 51. Under an initial proposal to drink directly from science fiction, the developer located in Chicago is willing to improve seen in the previous title, all without losing an iota of identity in terms of unexplained events, government conspiracies and aliens concerns .\n\nIn contrast to what we saw back in 2005 at Area 51, the whole lot of action which will parade BlackSite not limited to the remote locations of the underground facilities in southern Nevada. This time, and in order to achieve development with a much more varied and entertaining, travel to various points of their own Nevada, also passing through the desert of Iraq, and battling, not as in the ubiquitous military base that gives its name to the title.\n\nBlackSite: Area 51 is shaping up as an action game in the first person with a clearly defined identity. Under the halo of the mysteries that scattered everything related to the famous military base, lovers UFO phenomenon and science fiction will appreciate the return of inexplicable events that will shape the essence of the title, and that was so characteristic in the previous delivery. Improving everything seen in the original Area 51, and without losing a adarme in terms of spectacle and conspiracy theories are concerned, waiting to return to experience the horrors confined in facilities in southern Nevada will extend until September.\n\nRequirements Recommended\nOS: Xp, Vista\nProcessor: Intel Pentium or equivalent to 3Ghz\nRam: 2GB\nHardDrive: 15GB\nVideo: 256MB Pixel Shader 3.0","torrent":{"xt":"urn:btih:9886e5d59a13a5e89c837fbc8efafea2235ea735","amp;dn":"Blacksite+Area+51+%5BFULL+2+DVD%5D%5BMulti+5%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9886e5d59a13a5e89c837fbc8efafea2235ea735","infoHashBuffer":{"type":"Buffer","data":[152,134,229,213,154,19,165,232,156,131,127,188,142,250,254,162,35,94,167,53]},"announce":[],"urlList":[]}}