{"title":"[PDF] [1996] The Practice of Dzogchen (Buddhayana series)","uid":6464673,"size":18142316,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:989d6037371eeedc93b439fb483186cb4e716c6f&amp;dn=%5BPDF%5D+%5B1996%5D+The+Practice+of+Dzogchen+%28Buddhayana+series%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lyndavilla","files":2,"time":1307918762,"description":"DOWNLOAD MORE EBOOKS, MAGAZINES, &amp; PDFS:\n   &lt;a href=&quot;\nhttp://buyabook.ws/download-ebooks-magazines-pdfs-more/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://buyabook.ws/download-ebooks-magazines-pdfs-more/&lt;/a&gt;\n\nBOOK INFO:\n\nThe Practice of Dzogchen (Buddhayana series)\nBy Longchen Rabjam\n\n\nPublisher: Snow Lion Pubns\nNumber Of Pages: 370\nPublication Date: 1996-01\nISBN-10 / ASIN: 1559390549\nISBN-13 / EAN: 9781559390545\nBinding: Paperback\n\n\nProduct Description: \nOne of the most comprehensive works on the Dzogchen tradition of Tibetan Buddhism.--Glenn H. Mullin, Tibetan Review\n\n\n\n\nSummary: The Practice of Dzogchen\nRating: 3\nThe first part is very boring, and massive. Written in a style that makes it very very hard to follow the meaning. But, afterwards the book becomes very clear. Definetely a great book on dzogchen once you get past the first parts. \n\n\nSummary: Naturally Liberated Mind, the Great Perfection\nRating: 5\nThe excerpt of this book provided on Amazon only has portions from the introductory material by Tulku Thondrup, none of the words of Longchempa are included. The following excerpts are all from chapter 7, the Sems-Nyid Rang-Grol, which is the heart of the volume. I have provided these for those who may be curious as to what this book is really about. My own views on this book are well known (q.v.).\n\n&quot;Phenomenal existences are unborn, of equal nature;\nIn which the originally liberated appearances and mind prevail evenly without apprehensions;\nConcerning that marvelous sovereign, Naturally Liberated Mind,\nListen while I tell you what I have realized.\n\n&quot;All phenomena are primordially pure and enlightened, so it is unborn and unceasing, inconceivable and inexpressable.\nIn the ultimate sphere purity and impurity are naturally pure and\nPhenomena are the great equal perfection, free from conception.\n\n&quot;There is no separate emptiness apart from apparent phenomena.\nThe notion of their distinctness is a division made by the mind.\n\n&quot;In the mind which has no essence, various things\nArise because of the objective conditions,\nLike reflections appearing in a mirror or in the ocean.\nThe emptiness essence, unceasing nature, and\nVariously appearing characteristic, the magical display, is\nThe dual projection of samsara and nirvana within a single Mind.\n\n&quot;The primordially empty Mind, which has no root,\nIs not defiled by the phenomenal appearances of samsara and nirvana.\n\n&quot;The nature of samsara is the essence of the mind,\nWhich is primordially unborn and enlightened,\nSo by seeing the Mind, realization of the nature of existence is attained.\n\n&quot;For the Buddhahood which is totally and naturally pure,\nDo not search anywhere but in your own mind.\n\n&quot;For people who want enlightenment, the meaning of the unmodified absolute\nIs to let the mind be at ease without effort.&quot;\n\n\n\nSummary: Advanced Dzogchen study\nRating: 5\nThere are lots of introductory Dzogchen books (as there are for Mahamudra, Kabbalah, etc.). This is NOT one of them. There are also pure scholarly works with a small, fervent readership. This isn't one of those either, though scholars may certainly find it very valuable. The commentator/translator excerpts from many of Longchenpa's (Longchen Rabjam's) various texts which would be virtually impossible to access in English otherwise. Longchenpa is one of, if not THE, greatest Dzogchen masters of all time. Nevertheless, this is not an easy text to read. Furthermore, it is inconsistent in depth &amp; style. However, this is a definitive Dzogchen text--quite advanced, not for the beginner, challenging, and enlightening. It grows with you and re-reading texts in an unfamiliar area can increase understanding and familiarity (the way Jung studied Alchemy). This is a GREAT book, not to be underrated, but not every book is for every one. There is also a new issue of the same text entitled &quot;Buddha Mind.&quot; It might be better to read Longchenpa's &quot;Kindly Bent to Ease Us&quot; trilogy before attempting this one. It's a much easier read.\n\n\n\nSummary: An eye-opening anthology of the writings\nRating: 5\nThe Practice Of Dzogchen is an eye-opening anthology of the writings on Dzogpa Chenpo, or Dzogchen, by Longchen Rabjam (1308-1363), a widely renowned adept of the Nyingmapa School of Tibetan Buddhism. Meticulously translated into English by Tulku Thondup, this classic 466-page text cogently explains the nature of the three outer and three inner tantras, presents excerpts from the lives of Dzogpa Chenpo masters, offers paths to meditation, and a great deal more. Simply put, The Practice Of Dzogchen is a &quot;must-have&quot; addition for Tibetan Buddhist reference shelves and a strongly recommended entry for the supplemental reading lists of dedicated students of Tibetan Studies.\n\n\n\nSummary: Don't give up\nRating: 5\n10-Point Rating: (10.0)\nI came to this book with a heavy background in western philosophy, specifically the analytic tradition. Never having studied eastern traditions directly, I had always bought into the marginalizations of eastern thought prevalent in our culture. This book literally slapped me awake. There is not a thinker in the entire history of western philosophy (and that includes all the greats) that can hold a candle to Longchen Rabjam and the tradition he represents. I am not going to lie to you, this book is not easy reading - the system/viewpoint expressed is completely alien to our western outlook. It thus carries with it a set of technical terms (just as our philosophers do - e.g. substance, person, free will) which must be understood prior to a serious reading. For this reason it is best not to breeze through the introductory material which, as in most books on dzogchen, makes up at least half the volume. Another difficulty is that the author (Longchenpa) is assuming familiarity with certain ideas (such as the twelvefold chain of interdependent causation) and so he only treats them in a cursory fashion - bear with it, re-read it, study it, it will eventually come to you.","torrent":{"xt":"urn:btih:989d6037371eeedc93b439fb483186cb4e716c6f","amp;dn":"%5BPDF%5D+%5B1996%5D+The+Practice+of+Dzogchen+%28Buddhayana+series%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"989d6037371eeedc93b439fb483186cb4e716c6f","infoHashBuffer":{"type":"Buffer","data":[152,157,96,55,55,30,238,220,147,180,57,251,72,49,134,203,78,113,108,111]},"announce":[],"urlList":[]}}