{"title":"Desperate Housewifes 100 Unaired Pilot","uid":3539882,"size":449854356,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9a54e9f39e34ffa37a1b7b8e372b9594b7188129&amp;dn=Desperate+Housewifes+100+Unaired+Pilot&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cowboy","files":1,"time":1160940262,"description":"In the unaired version of the pilot, the final scene during which the camera pulls away from the girls after they discover Mary Alice's secret paper, a ghost-like version of Mary Alice is standing in the yard behind the girls. Also, even though it is the same shot in the original pilot and the aired version, the grass in Mary Alice's yard looks to be poorly cared for, but in the aired version, it has been digitally edited to look unnaturally healthy.\n\nIn the original pilot episode the role of Rex Van De Kamp played in this episode was actor Michael Reilly Burke but was let go after the series was picked up by ABC.\n\nIn this orignial pilot of Desperate Housewives the role of gardener John was played by actor Kyle Searles. After the series was picked up by ABC he was released from the role.\n\nIn this original pilot of Desperate Housewives actress Sheryl Lee played the lead role (and narrator) of dead Mary Alice Scott. When the series was picked up she was released from the role. This would've been her second dead character after her famous role of Laura Palmer in Twin Peaks.","torrent":{"xt":"urn:btih:9a54e9f39e34ffa37a1b7b8e372b9594b7188129","amp;dn":"Desperate+Housewifes+100+Unaired+Pilot","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a54e9f39e34ffa37a1b7b8e372b9594b7188129","infoHashBuffer":{"type":"Buffer","data":[154,84,233,243,158,52,255,163,122,27,123,142,55,43,149,148,183,24,129,41]},"announce":[],"urlList":[]}}