{"title":"HOWARD STERN SHOW 7-13-2008 Mastertape Theatre 08-04-2004 56k MP","uid":4294056,"size":87618798,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:9a887fa8514ddad04b2236a99eee4559ba3ddcb9&amp;dn=HOWARD+STERN+SHOW+7-13-2008+Mastertape+Theatre+08-04-2004+56k+MP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GNX157","files":1,"time":1216013635,"description":"HOWARD STERN SHOW 7-13-2008 Mastertape Theatre 08-04-2004\n\n56kbps/22050 Stereo\n\nHoward started off today&amp;#039;s show talking about how exhausted he was. He said ever since his dog got Lyme disease he feels like he&amp;#039;s got the same thing. Artie asked him if his dog is doing okay. Howard said the dog is doing fine and it&amp;#039;s all thanks to the antibiotics that they&amp;#039;ve been giving her. That led to a discussion about who invented antibiotics. Robin thought it was Louis Pasteur but Artie and Howard told her she was wrong and got things all screwed up when they threw in a bunch of other inventor names. They were tossing around everyone from Edison to the Curie&amp;#039;s. Howard said that antibiotics are amazing. He&amp;#039;s really paranoid about the ticks out in The Hamptons and how one, tiny tick can cause a lot of problems for you. He pulled a tick out from under Beth&amp;#039;s boob one day that they were out there in The Hamptons recently. She thought she just had a skin tag under her boob but it turned out to be the tick. Howard talked about how they had gone to look at some property out there and when they came out, the dog was covered in ticks and Beth must have gotten it there as well. The dog is doing well after being treated with the antibiotics and she&amp;#039;s all done with that now.\n\nHoward has his hands in a lot of projects right now and he said he told his agent that he&amp;#039;s got too many things going on. He&amp;#039;s not having fun because there are just so many of them. He had to cut that story off to talk to his buddy Ralph. Ralph was on the phone to talk about his night at Scores with Pamela Anderson. Howard said he got the call from him last night from Ralph who was hanging with her at Scores and he wanted him to come down. Howard told the story about how Ralph hooked up with her. He ended up at a hotel with her.\n\nRalph said that Pam was wearing jeans at Scores and they ended up being too long and too tight so they ended up cutting them down to Daisy Duke size jeans. Pam was there with Ralph when he called in so he put her on the line to talk to Howard. Pam said that Ralph was there again cutting her clothes off again. Pam said that she had about 20 people in her room so Ralph wasn&amp;#039;t the only one there. She talked about how they were at Scores until 4 in the morning just having fun. She said she doesn&amp;#039;t get out that much these days.\n\nPam got her hair cut by Ralph as well as getting the jeans cut up. She told Howard that she is not doing Ralph or anything so Howard sounded relieved. Pam wanted to get going but Howard didn&amp;#039;t want to let her go. She told him that she called him last night at around 9 to get him to come hang out but he didn&amp;#039;t call back. Howard said that he sleeps at that time because he has to get up at 4 in the morning. Pam said sometimes you just have to change things up.\n\nHoward was pissed that Ralph was getting in on his action hanging out with Pam. Artie and Howard were ready to walk over to the hotel room to hang out. They were going to call in the show over the phone. They were serious. Howard told Ralph to call in and give them the address so they could come down. Artie asked if there was any Jack (Daniels) there. Ralph said there&amp;#039;s a mini-bar there so he&amp;#039;s all set. As soon as Howard ended the segment he was ready to run over to the hotel room. Gary came in and said they were all set and they had everyone ready to run over to this hotel room. It was only 2 blocks away according to Ralph.\n\nHoward said that it&amp;#039;ll be him, Gary and Artie going over to the hotel room. They&amp;#039;ll call in and Scott the Engineer will run the board. Robin and Fred will take over if the show gets out of control from the hotel room. He was wondering what else they could go to if they had to kill some time. Gary said he had some Ali G Show stuff but Howard didn&amp;#039;t want to play that. Jason came in and said they could play the Gary Love Tape in full if they had to. That runs about 15 minutes so they could use that. Artie said he&amp;#039;ll be drunk by 6:40 this morning. Jason asked Howard if he needed this stuff photographed for the web site. Howard complained about some of the pictures he&amp;#039;d taken for the web site yesterday but he was so distracted by what he was about to do that he dropped it and went to commercial break so he could run over to the hotel room.\n\n# Howard Phones In The Show From Pam Anderson&amp;#039;s Hotel Room. 08/04/04. 6:40am\nAfter the commercial break Robin came back live and had Scott the Engineer bring up the phone where Howard was supposed to be on. It was actually Gary who was on the line. Gary told Howard to come over to the phone because they were live. Howard had him put the phone on hold so Robin had to explain what had just happened. Howard got on the line in the middle of that so he told Robin about all of the girls that were there. They had a bunch of Scores girls hanging out in Pam&amp;#039;s hotel room. He said that it was the best scene and Pam was wearing the best outfit he&amp;#039;d ever seen. He ended up signing her ass after everyone in the room had done it.\n\nHoward said that she was wearing a belly chain and her Daisy Duke jeans that Ralph had helped her create. Howard said the party they had there was her kind of party. The girls kept interrupting him while he was trying to talk to Robin on the line. He ended up talking to Pam for a minute and said that he thinks that there is something going on between the two of them. Howard had her come over to him so he could be as close to her as possible. He asked her to take off her cut-off jeans so she was doing that. Then the girls in the room were asked to take their clothing off as well.\n\nHoward had Pam come close to him so he could hug her. Then he told Pam that the lie detector test proved that she does have feelings for him but she said that he still wouldn&amp;#039;t kiss her. Howard got on the floor with Pam and laid under a table in the room. Pam said she didn&amp;#039;t remember all that happened at Scores last night. She remembered riding in Chuck Zito&amp;#039;s Corvette but that was about it. Pam was touching Howard&amp;#039;s hair telling him how curly it was. He tried to touch hers but hurt her somehow. Ralph got on the line and said that Howard and Pam were rolling around on the floor together. Howard wondered how Ralph got in on that whole thing.\n\nPam&amp;#039;s phone was ringing and she said that it was her boyfriend. She then said she doesn&amp;#039;t have a boyfriend but didn&amp;#039;t want anyone to answer her phone. Howard asked her to talk about what she did yesterday. She did her book signing so Howard asked her how that went. She talked a little bit about the book signings and about going to Scores again. She was all over the place talking about different things while Howard was sitting next to her. She was hurt by something in his pants so she had backed away from him. Howard threatened to leave at one point but she told him he couldn&amp;#039;t because she loves him.\n\nHoward wanted to go back to the studio if Pam wasn&amp;#039;t going to talk to him. She didn&amp;#039;t want him to leave so she agreed to be interviewed. She asked for some more champagne and got it within a few seconds. She wanted Robin to come down to the hotel room as well but she had to stay at the studio. Howard was ready to give up on the whole thing and just go to the Baba Booey love tape.\n\nPam forced some Champagne down Howard&amp;#039;s throat and he said he loved it. Pam pulled her boob out at one point but Howard missed it. He asked her to do it again after he was saying he had to get going. One of the Scores girls, Dakota, wanted to tell some jokes so Howard let her get on the line for a minute. She told some really lame Blond jokes that didn&amp;#039;t get any laughs. Artie got on the line after that and said that the jokes were visual. He told Robin that the girls weren&amp;#039;t really dressed or undressed, they were somewhere in the middle. Dakota was interrupting him and saying that she wanted KC to play some Slayer. She kept talking to him as he was trying to talk to Robin.\n\nGary got on the phone next and told Robin it was quite a scene in there. Pam had a rack full of clothing in there and Ralph had a girl on his lap giving her a massage. He was supposed to get Howard to do a Hemorrelief commercial but he wasn&amp;#039;t able to make that happen. Robin asked him why they weren&amp;#039;t doing anything because they were on the radio. Gary asked the girls to take their tops off for the radio. They all took their tops off a short time later. One of the Scores girls got on the line and said that she got implants done because she was inspired by Pam.\n\nJason told Gary to spank some of the girls because they were talking too much. Some of the girls got spanked but then Howard got back on the line and said that he had his shirt off. He said he was going to come back to the studio soon. Howard told Pam to take her shorts off after she asked him to take his off. Artie got back on the line while that was happening. He said that Pam was barely wearing anything at this point.\n\nDakota from Scores got on the line and did a Trim Spa commercial for them. She read the copy they had with them and talked about the product for a minute. She talked about Gary losing 39 pounds on the stuff. She said that he looked really good now that he&amp;#039;s lost his weight.\n\nGary said she was great on her first time doing a commercial. Gary told Robin that they were going to be leaving shortly to come back to the studio. Ralph got on the line and said he wasn&amp;#039;t going anywhere, he was going to stick around at Pam&amp;#039;s hotel room. Dakota interrupted and got back on the line to give her Grandma Pastorello a shout out. Gary got back on quickly and told Robin to play the Baba Booey love tape and that they should call him back when they have 4 minutes left so they can run back last minute.\n\nRobin said that they should have the girls doing stuff in this hotel room. Gary said that there are no cameras there so the girls weren&amp;#039;t doing anything. Howard got back on the line and described what Pam was wearing. As he was doing that she was pulling his pants off. He said he had to get out of there before he was naked. Gary got back on and said that they should go to commercial so they can get out of the hotel room and come back.\n\n# Howard Returns From Pam&amp;#039;s Hotel Room. 08/04/04. 7:00am\nAfter the break Robin was live but Howard wasn&amp;#039;t back yet. She explained what had just gone on and said she didn&amp;#039;t know when they would be back. She said that they were going to go to the Baba Booey love tape while they waited to find out what was going on. This was the old tape where Gary begs his old girlfriend to come back to him. The tape only lasted about a minute before Howard showed up back in the studio. He cut the tape off and told Robin what went on. Artie had Jack Daniels all over him because Pam poured it on him as they were leaving. Pam kept trying to pull down his pants as they were leaving. Pam didn&amp;#039;t want them to leave and wanted Howard to sign her leg before they left. Howard had to pretend to sign it.\n\nHoward said that all of the girls were good looking and they were panties and bras. Artie told Howard how Dakota had gotten on the line to tell a joke but it was a visual joke. Robin was surprised to see Howard back in the studio. She told him he had a perfect medium to do the show. Gary told her that they had no control over the girls there and Howard couldn&amp;#039;t move around. Howard added that Pam was drunk and pouring drinks all over them. She was pinching his nipples as well.\n\nArtie said that he took a bottle of liquor from the mini-bar as they were getting ready to leave and that&amp;#039;s when Pam poured the drink on him. The guys said that Ralph told them that he came very close to going to Las Vegas with all of them. Howard took a call from a listener a short time later and said he was disappointed in him for not sticking around at that hotel room. He didn&amp;#039;t believe that he couldn&amp;#039;t just stay there and bang Pam.\n\nGary asked Howard if he would ditch the show for Pam if he didn&amp;#039;t have a girlfriend. Howard said he would not ditch the show for that. He and the guys talked about how insane it was over at the hotel room and how hard it would have been to continue doing the radio show. Robin thought they could have made a great show out of that. Howard and Gary said that she had to see what was going on there because it was just too insane to continue doing what they were doing.\n\nAnother caller asked what it was like over there so Howard described what Pam was wearing and how her bra had slipped off at one point. Pam was grabbing Howard and climbing on top of him. Robin said she had no idea that was going on. Howard said he had to fight to keep his pants on. The caller asked Howard why he was fighting that stuff. Howard said he&amp;#039;s in a relationship and couldn&amp;#039;t do that stuff.\n\nRalph called in and asked Howard why he wouldn&amp;#039;t ditch the show for this stuff. Howard wanted to talk to Pam again so Ralph got her on the line. Robin told Howard that he will be talking about this for years and saying that he blew it again. Pam wasn&amp;#039;t coming back to the phone and the radio was turned up so loud that Howard was listening back to what they&amp;#039;d just said. Chuck Zito was there in the room and Howard said he didn&amp;#039;t flinch while they were there.\n\nRalph told Chuck to come over to talk to Howard. Chuck got on the line so Howard spent a minute talking to him. He said that he was a total pro in the room and he couldn&amp;#039;t believe it. Howard said that he was looking over the situation and making sure nothing bad happened. Chuck agreed with Howard that it looked like Pam had a thing for him. Artie was ready to run back to the hotel room again to have more fun over there. Howard explained how he couldn&amp;#039;t stick around there because it was so crazy.\n\nPam got on the line again and talked to Howard but Ralph got under this table they were calling from. Pam said that she loves Ralph and asked him to do her hair. Artie asked Pam why she poured a drink on him. She didn&amp;#039;t even know who it was on the line yelling at her. She apologized to him for pouring the drink on him and Artie forgave her immediately. Howard said that Pam really wanted him and she said that he blew it again. Howard told Pam that he had to go because it was driving him nuts.\n\nPam wanted to tell Howard something off the air so they pretended that they were so she&amp;#039;d say what she wanted to. Pam asked Howard to come back and they&amp;#039;d do a lingerie show for them. Howard said they were going back after that. Robin told him to just go back to the hotel room already. She convinced him to go back so Howard told Pam and Ralph that they were coming back.\n\nHoward said that Artie was no help over there at the hotel room because they didn&amp;#039;t help him out doing the show. Howard said that he should have grabbed the phone to take over the show for him. Dakota called in and said that they were kicked out of the room by Chuck Zito. Howard told them to get back to the room because they were on their way back over there. Dakota told Howard that Chuck told them that they were fired and they&amp;#039;d never work at Scores again if they didn&amp;#039;t leave. Howard told them that they would get fired if they didn&amp;#039;t go back to the hotel room.\n\nHoward told Robin how tough it was to do the show there because there was only one phone in the middle of the room. There was no phone in the bathroom like most hotels have. It was very overwhelming for him. He said he had a plan and said they were going back. They talked about how they were going to get the girls to do shots and stuff like that. Then they were going to get the girls into the shower naked together. Gary said that Ralph was using a cordless phone over there and that&amp;#039;s exactly what Howard needed. He wants to have the girls doing stuff with each other. Gary wondered if Howard had the power to get Pam Anderson naked in the shower with the other girls.\n\nRalph was on the line again and said that some of the girls were kicked out of the room but there were a few others there. Ralph told Howard to bring over some of the champagne to the room because they were out. Howard worked his magic and organized everything before they went back to the hotel room. Robin was helping them plan all of this stuff as well.\n\nCaptain Janks called in and said he wanted to hear some Butt Bongo going on over there when they go back. Howard seemed to think that was a good idea so he was going to do that as well. Gary said he would bring a camera over there so they could post some of the stuff on the web site. Artie was upset that some of the girls were talking about KC. Gary said the weird thing was that KC is missing and wasn&amp;#039;t there at the station this morning. Howard went to break shortly after that and ran back to Pam&amp;#039;s hotel room.\n\n# Howard Live From Pam&amp;#039;s Hotel Room Again! 08/04/04. 7:35am\nAfter the break Robin was live again explaining what was going on with Howard heading back to Pam Anderson&amp;#039;s hotel room to do another broadcast live over the phone. She spent a couple of minutes talking about the stuff that Howard is going to try and get the girls to do over there. They&amp;#039;re going to try and get the strippers to get in the shower naked together and then get Pam in there with them.\n\nFred, Jason and Scott the Engineer were all getting in on the conversation as well. Jason wondered if Artie is more interested in the girls or the drinking over there. Robin seems to think that it&amp;#039;s the drinking that interests Artie.\n\nHoward was on the line a minute later and said that they&amp;#039;re stuck in traffic about a block from the hotel. Ronnie the Limo Driver was driving them over to the hotel. Howard explained what they&amp;#039;re going to do when they get there. They want to get the strippers back up to the room and then isolate Pam up in the hotel room. They&amp;#039;re going to pay attention to the strippers there at the hotel room and not pay too much attention to Pam. Howard arrived at the hotel a minute into the call. They found the strippers and grouped up with them. Howard&amp;#039;s &amp;#039;&amp;#039;Scores wife&amp;#039;&amp;#039; was there at the hotel so Howard let her say hello to Robin.\n\nHoward&amp;#039;s phone cut out because he was on a cell phone inside the hotel. Robin took over again for a minute and said she can&amp;#039;t imagine what&amp;#039;s going to happen. She said the look on his face was funny when he came back the first time. Jason asked Robin to give them a lingerie show of their own since they were stuck there at the station.\n\nGary called back and put Howard on the line. Howard said he was in the bedroom and called the girls in to help him out. He told the girls that they were going to do a lingerie show for them. He asked Pam to take off her pants again for them. Then he told Dakota to take off her clothes as well. He told all of the girls to take their clothes off after that. Pam said that she had a lingerie meeting in about 10 minutes so she was going to have to leave. Howard said he shouldn&amp;#039;t have come back if that was the case. Howard told Robin that when he came back the girls were putting their clothes back on.\n\nHoward told the girls to do a lingerie show for them. He asked Pam to slip into some lingerie and told some of the other girls what they were going to be wearing. He asked the girls to take their pants and tops off for them as well. Howard then told the girls that they should all pile in the bathroom so they could get naked and get in the shower. He said if they did that they could get Pam in the shower. Pam came back without her lingerie on so Howard asked her if he could help her put it on. She said it was too complicated for her. She also had a meeting with the Wal-Mart people that she was going to be late for.\n\nHoward said he had 4 chicks naked at this point and Pam was trying to put on her lingerie. She was drunk so she was having some trouble putting it on. Pam was saying that she was going to be in trouble for all of this. She wondered why she had a bunch of autographs on her body. She didn&amp;#039;t remember that she was asking people to sign her. Howard had all of the girls head into the bathroom so they could get in the shower together. Howard seemed amazed that this was working.\n\nHoward told all of the girls to get naked and get in the shower so they could help Pam wash off her ink. Howard said he was very close to a touch down with this stuff. He kept telling Pam to get over there so she could get washed down. Pam wanted to have a serious discussion with Howard about this. She said she was going to get fired if she did this. She stepped in and then stepped out of the shower. The Scores girls were afraid that they were going to get fired for this stuff. Howard said he had Pam in the shower but she got out. He told the girls that he wasn&amp;#039;t having fun at this point. Chuck Zito was telling the girls that they were going to get in trouble for all of this so he wasn&amp;#039;t helping matters.\n\nHoward was still trying to get the girls to get in the shower together. He was demanding that the girls get in the tub. Dakota didn&amp;#039;t want Pam&amp;#039;s ink to wash off of her though. Pam came back in when Howard told her to check out what was going on. She kept telling Howard that she was going to get in trouble for all of this stuff. She didn&amp;#039;t want Howard to leave but she also said that the party would not be over if he left.\n\nPam said she would get in the tub if Howard did something for her. She ended up pulling him down on the floor as Howard was saying &amp;#039;&amp;#039;Ow, Ow, Ow!&amp;#039;&amp;#039; Artie got on the line and said that Ralph was bathing some chick in the tub while Pam dragged Howard to the ground. Howard got back on the line and said that he had one girl in the tub with Ralph. Pam was in bra and panties while the other girls were in the tub.\n\nArtie got on the line again and said that there were 5 girls, including Pam, in the tub together. He said that Howard was also getting in as he was talking to Robin. Pam was not naked, she was wearing heels. Dakota also said that she was not completely naked. The girls were asking for Robin and KC to show up at the hotel room so Artie wasn&amp;#039;t feeling so great about that. Someone dropped a drink so there was broken glass all over the place. Artie had 5 drinks in him at this point so he was having some fun.\n\nArtie went back into the bedroom and asked a couple of chicks what their problem was because they looked upset. He said he thinks they&amp;#039;re upset that he was the only guy available. Howard was on the bed just talking to the girls while Artie was talking on the phone. He gave the phone to Howard after that. Howard said that he had all of the girls in the shower together at one point. He then tried to get some girls to do some stuff to each other. A couple of the girls started to kiss each other according to Artie. He said that one of the girls had the best breasts he&amp;#039;s ever seen. He asked the girls to continue kissing so that&amp;#039;s what they did.\n\nRobin told Artie that it was getting kind of boring after a while. She told them it was good for a while but now it was getting boring. Robin asked what was going on there. Artie said that the girls were on the bed just talking. Howard disappeared and it turned out he was under the bed or something.\n\nGary had Dakota do another live commercial for them since Howard wasn&amp;#039;t available to do it. She did a Hemorrelief commercial which sounded pretty bad because she was reading it from the copy that Gary gave her. Robin then told Artie that they had to take a real commercial break. Robin said she&amp;#039;d talk to them off the air and find out what was going on next and went to break.\n\n# Pam&amp;#039;s Hotel Room Wrap Up Part 2. 08/04/04. 8:20am\nHoward returned from the hotel after the commercial break. He said he thinks he got everything accomplished that he wanted to. He wasn&amp;#039;t sure what everyone was on over there. He said Pam was laying on the floor as if she was sun bathing. He said he got her shorts off so she was just wearing a thong. He kicked Ralph out after seeing him on the floor. He managed to get the other girls to take their clothes off but Pam was still in panties and bra. He got the girls into the shower and Pam eventually got in there. Gary was taking digital pictures while he was there and got about 40 pictures.\n\nHoward said Pam was whispering that she was going to get fired for all of the stuff she was doing. Gary showed Howard some of the pictures he had of the girls and Ralph in the studio. Gary showed Robin a picture of Artie standing next to a naked Dakota. There were three naked Scores girls on the bed doing lesbian stuff together. There were pictures of Pam in the tub with the other girls while they were naked. Ralph was hanging around naked while Howard was being dragged into the tub by Pam. There were naked girls all over the place. Howard even did some Butt Bongo to the girls but he wasn&amp;#039;t able to get it on the radio. Artie was drenched in liquor.\n\nGary said he went back to get Pam to come down to the studio but she didn&amp;#039;t want to come. Ralph was trying to work her and told Gary that they&amp;#039;d be over soon. The other girls came down to the studio so Howard brought them in to thank them for what they&amp;#039;d done. Ralph was left behind wearing just a towel. Artie wasn&amp;#039;t so thrilled about that.\n\nDakota came in and asked where Pamela was. She said that Pam was calling Howard&amp;#039;s name out all night. Howard asked one of the girls how long she&amp;#039;d been dancing at Scores and it was only 3 days. Howard thanked all of the girls for what they&amp;#039;d done over at Pam&amp;#039;s hotel room. The girls all thought that Pam was really cool to them. The girls said that they&amp;#039;re not supposed to hang out with clients so that&amp;#039;s why they were supposed to be suspended. Howard said he would talk to Lonnie over there about that and make sure they&amp;#039;re not suspended. Ronnie came in and said that he spoke to Lonnie and they don&amp;#039;t have to be worried about being fired.\n\nThe girls left and Howard said that Pam really didn&amp;#039;t want him to leave her party. Artie said that Pam is &amp;#039;&amp;#039;way into Howard&amp;#039;&amp;#039; but Howard is a good guy. He didn&amp;#039;t do anything with her. Howard said that he plans on changing now that he knows that Pam is so into him. He was all pumped up after that craziness. Captain Janks called back in and asked them to put the pictures on HowardStern.com so they can discuss them on the bulletin board tonight. Janks asked him to replay the tape of the phone call as well. Howard wasn&amp;#039;t even sure what was going on there because it was so crazy.\n\nHoward talked about how they had all of the girls in the tub and how they had Pam in there with them. She had her legs spread and had Howard feeling how smooth they were. Another phone caller told Howard that he is &amp;#039;&amp;#039;da man&amp;#039;&amp;#039; now that he made all of that stuff happen. Artie was singing DMX&amp;#039;s &amp;#039;&amp;#039;I love my niggas, but where&amp;#039;s my bitches&amp;#039;&amp;#039; as they were talking about this stuff. He said that he was loaded after drinking over there.\n\nA woman called in and told Howard how sexy that whole thing was to her. Chaunce Hayden called in and said that Beth&amp;#039;s engagement chicken is for sale on eBay right now. Howard said that he was good over there and didn&amp;#039;t do anything with her over there. Chaunce said he was with Pam last night and she told him that she really is into Howard. He believes that she really loves him. Howard said that he&amp;#039;s so in love with Beth that no one compares to her. Artie said that he thinks that Beth is hotter than Pam Anderson... and he was drunk while he was saying that.\n\nJoey Boots called in and said that he didn&amp;#039;t hear anything about the E! cameras being there. Howard said that would have killed the whole mood there. Joey said he thought it was funny when Artie was there with naked chicks and he ended up talking about one of the chick&amp;#039;s grandmother&amp;#039;s lasagna.\n\nHoward took a few more phone calls and talked about some of the stuff that went on over there. Howard said they have a guest today and the guy who came down has a really hot chick. He saw her as they were running over to the hotel and almost stayed there when they saw her. Artie was thanking Howard for making all of that happen. They talked about the girls in the shower and how the girls were soaping each other up in there.\n\nDominic Barbara called in and said that he had to tell his wife that he would never do anything like that when she asked him about it. He told Howard that he&amp;#039;s really jealous and wished that he was him for just 5 seconds. He thought the whole thing was unbelievable. Howard talked about how sexy Pam is and how much fun she is to be around. She is really the girl in that sex video that she and Tommy Lee shot. Artie said that the party over there was the polar opposite of gay. It was the farthest thing from gay that they could get.\n\nArtie said that Chuck Zito was a good guy and was making sure nothing bad was going on over there. Another woman called in and said that she has told Howard that he&amp;#039;s a good looking guy. Dakota called back and wondered what was up with Artie&amp;#039;s comment about them being dirty. He had to explain that he was making a joke. Dakota told him that he needs a shower more than any of them. Artie wasn&amp;#039;t about to outwit them so he knew he&amp;#039;d been drinking too much. Artie was still drinking the bottle of scotch he had borrowed from the hotel room.\n\nHoward had Robin just think about the reality of what had just happened. The girls were tanked out of their minds and they were all getting naked. He talked about how crazy it was over there. Gary said he had a run in with Pam that was great as well. She was asking him where she could get more Trim Spa while she was unbuttoning his shirt as she was laying on the floor in her bra and panties. He said that it was great and he knows that she probably just wanted to make him melt. Howard had to take a break after that so they could get to their guest.\n\n# James And Jen Talk About Stem Cell Research. 08/04/04. 8:50am\nRalph came in with Pam Anderson&amp;#039;s shorts in his hand after the break. Howard asked him what else he had. Ralph had her jean legs that he&amp;#039;d cut off. He had a few other things that he said he&amp;#039;d be selling on eBay later today. Howard said that Ralph has a cutout of Pam in his apartment. Ralph said he told Pam that he lost a girlfriend over that cutout and she said &amp;#039;&amp;#039;good!&amp;#039;&amp;#039; to that. Ralph then went on to tell Howard how all of this got started. He said he didn&amp;#039;t want to leave Pam&amp;#039;s side while he was with her because the other girls just jump on her. He said he held off on going to the bathroom for hours because he didn&amp;#039;t want to lose his spot.\n\nA listener called in and said that he&amp;#039;s going to go get a computer today so he can get on the web and check out the pictures they have. Another guy called in and said that the show was great and he had to thank him for it. Howard and Ralph talked a little more about what went on over there. Ralph said he doesn&amp;#039;t think that he could have had sex with Pam if he wanted to. He said she&amp;#039;s a party and she&amp;#039;s a lot of fun but nothing would happen. Howard was missing her already. Gary told him that she wants him to call her later when he gets a minute to talk.\n\nHoward moved on to the one guest they had booked today. This guy contacted the show recently who claims that he is alive today because of some stem cell thing he had done to him. He&amp;#039;s also got a great looking girlfriend. Howard had the two of them, James and Jen, come in a minute later. Howard talked to Jen about her job which is a general contractor. James said that all of the guys that work for her just &amp;#039;&amp;#039;yes&amp;#039;&amp;#039; her to death because she&amp;#039;s so hot. She said her company takes old houses that need to be remodeled and remodel them. She designs and oversees everything that goes on.\n\nHoward noticed that James had shiny fingernails so he goofed on him a little bit about that. James said that they were just buffed and there was no polish on them. Howard moved on to the story that James had about how he was saved from Leukemia by a stem cell transplant. He said that he would probably be dead if it wasn&amp;#039;t for that transplant. Howard said he must go nuts when he hears the President talking about not allowing stem cell research. James said he&amp;#039;s from Texas so he was a Bush supporter until he started talking about the banning of stem cell research.\n\nJames made fun of Artie about how sloppy he looked when he walked past the green room earlier. Artie went off on him and goofed on his polished nails for a few seconds. Howard then had James talk about this stem cell stuff. James said that his implant was an adult stem cell transplant so there&amp;#039;s no problem there. James was explaining what they do with fetal stem cell research but Ralph didn&amp;#039;t want to hear that stuff, he wanted to talk more about Pam.\n\nHoward took some phone calls about the whole Pam Anderson thing. A bunch of callers were talking about how Howard managed not to do anything with Pam. Howard then had James get back to the stem cell research thing. James told Howard that the eggs they use in the stem cell research are leftover eggs that would not be used for anything else. Howard wondered what the problem was because the eggs that they&amp;#039;re using are not eggs that were fertilized. The religious freaks look at it as being abortion because the eggs are destroyed in the process.\n\nJames was talking about his own stem cell implant and how that worked but Howard interrupted and said that Pam&amp;#039;s implants looked great today. He took a couple more phone calls after that and let some guys tell him how great the Pam Anderson thing was. Howard and Artie wanted to get Jen into a bikini but she said she was all banged up from the construction sites she works at.\n\nJen said that she didn&amp;#039;t want to do it today and she probably wouldn&amp;#039;t do it any other day. Artie was really drunk and slurring his words as he demanded that James get his woman to get into a bikini. Howard was willing to give them some prize money to donate to a charity if Jen would get in that bikini. Howard asked Jen when she lost her virginity and stuff like that while they killed some time. Jen finally agreed to try on the bikini they had for her but she said she wouldn&amp;#039;t come out if she didn&amp;#039;t like it.\n\nCaptain Janks called in and said he was inspired by the Pam Anderson thing so he called C-Span and just yelled out &amp;#039;&amp;#039;Pam Anderson rules!&amp;#039;&amp;#039; when they picked up the phone. He played that for Howard and got a couple of laughs out of them. Howard took some more phone calls after that. One guy wondered if John Kerry is going to be any better as far as the stem cell research goes. Howard said that he has said that he believes in science so he will probably change things.\n\nJen had the top half of the bikini on but refused to wear the thong bottom. Ralph went over and asked her what the problem was. She said she was too self conscious about her ass to wear it. She didn&amp;#039;t even want to show it to anyone. Howard told her that her body was great and she should just put it on and come out with the bikini on. Isaac from E! came in with a rack of bathing suits for her to try on. Howard told her that if she just put on the bikini and showed them the front, she&amp;#039;d be fine. She agreed to do that but was afraid that they would put a camera on her ass or something.\n\nHoward spent a little more time talking to a caller about stem cell research. Then Jen came out with her bikini on. Robin saw her ass from behind and said that it was great. She only weighs 114 pounds and she&amp;#039;s 5&amp;#039;8&amp;#039;&amp;#039; tall. Artie wanted to see her ass but she was still afraid to turn around. Gary said he saw it and it was perfect. She finally broke down and spun around so they could see it. All of the guys thought it was just fine and wanted her to spin around again. Howard wanted Jason to take a picture of her for the web site as well. He told him to get those pictures up on the site immediately. Howard gave them $1000 courtesy of &amp;#039;&amp;#039;Kill Bill Vol. 2&amp;#039;&amp;#039; for doing what she did. He told Jen that her ass was &amp;#039;&amp;#039;primo.&amp;#039;&amp;#039; Artie had her spin around again so they could snap a picture of her ass. All of the guys were going nuts over how hot she was.\n\nThe caller Howard had on the line was telling Howard about how he is not going to support Clear Channel anymore. Howard said that he read a memo from Clear Channel on some guy&amp;#039;s web site yesterday and they think that they know his strengths and weaknesses in advertising so their stations shouldn&amp;#039;t worry about him returning to Miami. Howard told them to &amp;#039;&amp;#039;Bring it on mother f&amp;#039;ers!&amp;#039;&amp;#039;\n\nJames talked a little more about stem cell research with Howard but he just wanted to look at Jen some more. He wondered what she&amp;#039;s doing with a guy who has polished fingernails. He started to wrap up the segment shortly after that and gave them a plug for a web site, RyanGibsonFoundation.org, and for the &amp;#039;&amp;#039;Kill Bill Vol. 2&amp;#039;&amp;#039; DVD since they were the sponsor that gave up the $1000.\n\nA woman called in and said that she&amp;#039;s confined to a wheelchair because of the cancer battle she&amp;#039;s been through and she thinks that stem cell research could help her out. Howard told her that President Bush doesn&amp;#039;t care about that at all. She said she knows that and Artie interrupted and jokingly said that they don&amp;#039;t really care either and that she should call Z100 instead. Howard went to commercial break shortly after that.\n\n# Eric The Midget And More During The News. 08/04/04. 9:40am\nHoward came back from break and talked about what a busy morning they had. A listener called in and said that Pam will probably pretend that none of that stuff ever happened if she&amp;#039;s asked about it tomorrow. Howard said he doesn&amp;#039;t care though. He took some more phone calls after that and let some more phone callers through to talk about that craziness. Artie was still wasted and rambling a bit. He said that he almost said the F-word as he was saying he was f&amp;#039;d up this morning. Howard said Pam just called a little earlier and said that she wanted him to come back to her hotel room again.\n\nHoward tried to get Robin to start her news but Ralph wanted him to do an F***, Marry, Kill. He gave him two names and couldn&amp;#039;t come up with a third. He gave him Carmen Electra and Pam Anderson. Howard didn&amp;#039;t care and just wanted Robin to get her news done. Robin tried to read some stories but Artie was so drunk that he kept interrupting her. Ralph also hung around during the news to comment on some of the stories she was reading. Artie was slurring his words and going off on homosexuals when Robin brought up a story about gay weddings.\n\nA listener called in and said that the whole Pam Anderson thing reminded him of a scene in &amp;#039;&amp;#039;Revenge of the Nerds&amp;#039;&amp;#039; when they did their panty raid. Artie said that was a perfect description of what went on over there. A few other callers told Howard how great that whole Pam Anderson thing was.\n\nEric the Midget called in to talk to Howard about the bits that Richard Christy is creating using his voice. He&amp;#039;s not happy with those and he doesn&amp;#039;t want him to make them anymore. Eric also asked Artie to stop goofing on him because his team (the Yankees) lost to the A&amp;#039;s last night. Artie apologized to him and kept his mouth shut. Howard tried to find the Eric the Midget bit that Richard Christy created but no one had it. A short time later they brought it in and played one of his bits. They played the prank call Richard made to Gary the Retard using Eric&amp;#039;s voice mail. Eric doesn&amp;#039;t find that stuff funny.\n\nEric wanted to talk to Howard about an actor in the movie &amp;#039;&amp;#039;Station Agent.&amp;#039;&amp;#039; Ralph and Artie were goofing on him about bringing up movies that star midgets. Howard said that the worst midget movie was &amp;#039;&amp;#039;Under the Rainbow.&amp;#039;&amp;#039; They talked about a few other movies and Eric was trying to give them some facts about Bridget the Midget and stuff like that so Artie just told him to &amp;#039;&amp;#039;Shut up you short bore.&amp;#039;&amp;#039; Howard told him that Artie is drunk and that&amp;#039;s why he&amp;#039;s so belligerent. Artie also asked him what it&amp;#039;s like to be the last one to know that it&amp;#039;s raining. Captain Janks called in and said that Eric shouldn&amp;#039;t call in and complain all the time because the show has given him a bunch of prizes and stuff over the years. Eric is looking for a job and that&amp;#039;s why he&amp;#039;s been calling in to the show. He said he finished a hotel management course and he would like to get a job in Las Vegas or something. They joked that he could be a &amp;#039;&amp;#039;short order cook&amp;#039;&amp;#039; or something like that. Artie also cracked a joke about being able to see his feet in his driver&amp;#039;s license. Howard didn&amp;#039;t think it was all that funny but Artie was cracking himself up with his short jokes. He said he&amp;#039;s going to go back to Jersey and drink for another four hours and grab a slice of pizza after the show. Howard had Robin get back to her news after that.\n\nLate in the show a caller wondered how Artie gets away with drinking like he did at Pam&amp;#039;s hotel room when he gets in trouble for lesser things on his job. Howard told the guy that Artie was partying and he&amp;#039;s working on the Howard Stern Show so it&amp;#039;s not a problem. The guys were still pumped up from all of the stuff that had happened earlier in the morning so they seemed to be having a lot of fun with Robin&amp;#039;s news. Artie was killing with his jokes and comments about some of the stuff they were talking about. They wrapped up the show around 10:20 this morning. ","torrent":{"xt":"urn:btih:9a887fa8514ddad04b2236a99eee4559ba3ddcb9","amp;dn":"HOWARD+STERN+SHOW+7-13-2008+Mastertape+Theatre+08-04-2004+56k+MP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a887fa8514ddad04b2236a99eee4559ba3ddcb9","infoHashBuffer":{"type":"Buffer","data":[154,136,127,168,81,77,218,208,75,34,54,169,158,238,69,89,186,61,220,185]},"announce":[],"urlList":[]}}