{"title":"India Legal - 15 January 2016 (gnv64)","uid":13108392,"size":28142364,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9aeb3c9428d39882fecf256a2274cca5cbbda4bc&amp;dn=India+Legal+-+15+January+2016+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gnv65","files":5,"time":1451410541,"description":"India Legal - 15 January 2016 (YEAR END SPECIAL)\r\nEnglish | PDF | 100 pages | 26.5 mb\r\n\r\nSUPREME COURT - Choking Capital 14\r\nDelhi's pollution levels are alarming. But the government's knee-jerk measures to combat it are bound to fail in the absence of a strong public transport network and strict implementation of existing green laws. \r\nPOLITICS - Sunset of a Dynasty? 20\r\nCommernators are more than ready to write off the Congress and, by extension, the Gandhi family, given their diminishing numbers in the Lok Sabha, but that may not hold true today. \r\nINVESTIGATION - No Retribution for 2002 28\r\nThe clean chits to Narendra Modi and Amit Shah by the courts in the Gujarat riot and encounter killing cases lend renewed strength to arguments made by both the BJP leaders. \r\nHISTORY - The Netaji Dilemma 32\r\nConspiracy theories aside, the centey's justification of not declassilying the Netaji flies as it would hurt India's relationship with foreign powers is only an exruse. \r\nACTS &amp; BILLS  - Juvenile Justice? 36\r\nIt gathered momentum too late in the day but was passed by the Rajya Sabha. A quick overview of the debate surrounding the new juvenile justice law. \r\n\r\nTHE BEST OF INDIA LEGAL 2015\r\nNeither Free,nor Fair 40\r\nThe apex court struck down an amendment validating the National Judicial Appointments Commission Act passed by par1iamenl. A letter from the Ed??or reads between the lines of this judgment. \r\nStuck in a Quandary 45\r\nEven though the courts are massively overburdened, the judiciary is being increasingly called upon to rule on matters which defy precedent and may not find parallels in existing case laws. A letter from the Editor lists its various dilemmas.\r\nTrust Deficit 48\r\nYakub Memon's sentence sparks debate on whether inlelligence agencies should be lenient on those surrendering to them. Similar is the case of witnesses who come forward to report crimes and end up paying with their lives. \r\nInstant Health Debacle 54\r\nFor long India's staple snack, Nestle's Maggi Noodles faces ousler as high doses of lead and MSG have been discovered in state after state. \r\nDavid and Goliath 60\r\nIt's been a clash of egos and authority as Delhi CM Arvind Kejriwal and L-G Najeeb Jung slug it out. AI the heart of the ugly stand-off is the question: Who rules Delhi?\r\nIt's My Life 64\r\nA landmark survey has shown that Muslim women want the triple talaq to be banned. The community is indeed being swept by winds of change.\r\nMoney down the Drain 70\r\nThe Punjab and Haryana High Court has on its payrolls a large battery of law officers, otten recruited on questionable grounds.\r\nHome Truths from the Church 80\r\nSexual misdemeanors by the clergy are nothing new. But for the first time, a Kerala nun is paid Rs.2 1akh to remain mum about her sexual abuse. \r\nFaITh Matters 86\r\nThe Jain custom of Santhara-voluntary end 10 one's life through fasting-brings up the question of whether or not religion is more important than the law of the land. \r\n&quot;We tackle complex issues&quot; 90\r\nJudge Ronny Abraham, president, IGJ, says that India is finding the best ways to handle increasing commercial disputes. \r\nWhose Right is Paramount? 96\r\nIn the debate about child pornography, the issue 01 amateur sex videos preying on innocent girls has been lost. Why aren't lSPs being charged lor this? \r\n \nhttp://s18.postimg.org/3kzmtvpih/India_Legal_15_January_2016.jpg","torrent":{"xt":"urn:btih:9aeb3c9428d39882fecf256a2274cca5cbbda4bc","amp;dn":"India+Legal+-+15+January+2016+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9aeb3c9428d39882fecf256a2274cca5cbbda4bc","infoHashBuffer":{"type":"Buffer","data":[154,235,60,148,40,211,152,130,254,207,37,106,34,116,204,165,203,189,164,188]},"announce":[],"urlList":[]}}