{"title":"Dzyen EP (2014)","uid":9493157,"size":263670196,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9c55c94cd268793cf64dd4c955acbba60cbca3ce&amp;dn=Dzyen+EP+%282014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"jc2k301","files":-1,"time":1390042318,"description":"Hailing from the north east of England, Dzyen are bringing their progressive metal sound for all to hear in 2013.\n\nFusing a range of styles and diverse influences, Dzyen are ready to unleash their self titled EP this year.\n\nFormed in 2011, guitarist and vocalist Scot Goodrum, drummer Romeo &quot;chunky&quot; Ferrari and bassist Bryan tulip have a long outstanding history of collaborating, starting out on the death metal scene in various bands, as well as 15 years of experience behind them from their death metal roots. However, over time, the bands sound evolved to become more progressive and groove oriented. \n\nMusically, their sound offers deep, heavy grooves and melodic passages but nothing is off limits as their sound continues to evolve. Currently, Dzyen have made waves online through forums and social networking sites and have gained praise from many of their contemporaries and peers (members of Tesseract, Monuments, Novallo and Skyharbor).\n\nWith a number of special collaborations coming up, 2013 promises to be an important year for Dzyen. Their debut EP will be released, quickly followed up with their yet to be named debut album and touring will commence shortly after. Also, they are due to film their debut music video, directed by Lee Jackson.\n\nThe band currently owns their own recording studio and rehearsal spaces in Newcastle and therefore have a massive output of music ready to be unleashed.","torrent":{"xt":"urn:btih:9c55c94cd268793cf64dd4c955acbba60cbca3ce","amp;dn":"Dzyen+EP+%282014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c55c94cd268793cf64dd4c955acbba60cbca3ce","infoHashBuffer":{"type":"Buffer","data":[156,85,201,76,210,104,121,60,246,77,212,201,85,172,187,166,12,188,163,206]},"announce":[],"urlList":[]}}