{"title":"Dillinger - Dillinger [1974][320 KBPS]","uid":7753893,"size":124126048,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9cb644d5bb856d8c8c299d48f2b8d9722a888ce5&amp;dn=Dillinger+-+Dillinger+%5B1974%5D%5B320+KBPS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"LameDuck69","files":8,"time":1351037410,"description":"Dillinger - Dillinger [1974]\n\n\n\n\n\n01 People\n02 City Man\n03 Nature's Way\n04 Live And Return\n\n\n\n\n\n320 KBPS\n\nCover Art\n\n\n\n\n\n\n\nDillinger Biography From Prog. Archive:\n\n\n\nFrom Toronto,Ontario,Canada the band was formed in 1973 by the Harrison brothers,Jacques (keys,vocals,sax,flute,accordion) and Robert (Drums,percussions) both from Quebec.Paul Cockburn and Terry Bramhall were eventually added, respectively on guitars and bass.The following year they signed with Canadian label Daffodil and released their first self-titeld album.The album was an original mix of jazz and progressive blusey hard rock.It was made up of only four tracks including the side-long ''Live and Return'' as well as an interesting cover version of Spitit's ''Nature Way''.\n\nDue to it's complexity, the album was met with indifference.Constant live gigging and dedication eventually got the band a bit of recognotion,so they entered the studio to start working on the follow up album in October 1975.The recording sessions lasted a good four months under the aegis of label owner Frank W.H.Davies who acted as producer aided by John Woloschuk(Klaatu),Steve Vaughn and noted Rush producer Terry Brown,the same team who would complete Klaatu's debut album in 1976.\n\nThe album was made up of eight tracks including a decent cover version of Spooky Tooth's ''Two Time Love'' and a not-so-good funky version of the Beatles' ''Taxman''.All the rest were originals and an obvious improvement over the first album.With three tracks clocking in at over eight minutes and another at six,the band had ample freedom to explore and show off their talents as both composers and musicians with many instrumental parts featuring keyboards(organ,mellotron,Moog) and guitar interplay,as well as an healthy dose of folky flute playing and jazzy sax parts.\n\nThis was to be the band's last album as Dillinger.Drummer Robert Harrison got homesick and returned to Quebec where he joined highly local popular hard rock legend Offenbach.He eventually quit them and resumed his career as a blues guitarist.Bassist Bramhall also quit,leaving Jacques Harrison and Cockburn (both main songwriters) to re-assemble a band, recruiting drummer Paul Kersey(Max Webster),bassist/singer Brian Gagnon(Bullrush) and multi-instrumentalist Gerry Mosby(Bond).They were re-named The Hunt by manager Cliff Hunt and showed the band moving in a meaner and heavier rock direction.Their first album as The Hunt still showed prog leanings thanks to Cockburn and Harrison's songwriting as well as the ever present flute and thick keyboard sound topping Gagnon's Geddy Lee-like's wailing,eliciting vague comparisons with Rush.Both Harrison and Cockburn eventually left leaving the band in the hands of Kersey and Gagnon who moved the band in a poppier direction in the 80's.\n\nBoth Dillinger albums have been re-issued on CD by Unidisc.\n\n","torrent":{"xt":"urn:btih:9cb644d5bb856d8c8c299d48f2b8d9722a888ce5","amp;dn":"Dillinger+-+Dillinger+%5B1974%5D%5B320+KBPS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9cb644d5bb856d8c8c299d48f2b8d9722a888ce5","infoHashBuffer":{"type":"Buffer","data":[156,182,68,213,187,133,109,140,140,41,157,72,242,184,217,114,42,136,140,229]},"announce":[],"urlList":[]}}