{"title":"BrainLock","uid":10834853,"size":643015,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9d1ba2ca1f27c1746ddb65476a837ed3dfdf68ad&amp;dn=BrainLock&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":4,"uploader":"Bolikan","files":1,"time":1408665016,"description":"Brain Lock by Jeffrey M. Schwartz\n\n\nObsessive-Compulsive Disorder, commonly known as OCD, is a condition where a person is overly perfectionist, or obsessed with cleanliness, hoarding, rituals, checking and rechecking things, relationships or beliefs. It leads to anxiety, all the more so when the individual affected realizes his/her affliction but cannot help himself/herself. It leads to even more anxiety and stress and often causes a lot of waste of time and money. Jeffrey M. Schwartz has described in his book Brain Lock: Free Yourself from Obsessive-Compulsive Behavior, a simple, 4-step procedure to free oneself from OCD. Aiming to help more than 5 million Americans who suffer from this disorder, Schwartz offers this alternative, and very effective treatment, in terms of cost and sustainability, through this book. Traditionally, people suffering from OCD may take medicines like Prozac, but it is a symptomatic treatment which causes the symptoms to come right back if medication is discontinued. Moreover, many patients do not respond to this treatment, not to mention the cost involved. OCD patients are often not in control of their lives. Their compulsive disorders dictate their actions. Schwartz s procedure of using the mental control of the patients to change the very wiring of their brain and effectively cause positive life-time changes has been clinically proven through brain-imaging tests conducted before and after treatment. The 4-step procedure involves cognitive therapy and modification of behavior, vis-a-vis pharmaceutical treatment and is now recognized and used throughout the world in treatment centers. Through the 4 steps of Relabeling, Reattributing, Refocussing and Revaluing, the OCD sufferer can actually change not only his behaviors but the physical design of his brain, the author claims.\t\t","torrent":{"xt":"urn:btih:9d1ba2ca1f27c1746ddb65476a837ed3dfdf68ad","amp;dn":"BrainLock","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d1ba2ca1f27c1746ddb65476a837ed3dfdf68ad","infoHashBuffer":{"type":"Buffer","data":[157,27,162,202,31,39,193,116,109,219,101,71,106,131,126,211,223,223,104,173]},"announce":[],"urlList":[]}}