{"title":"Bashar - Crossing the Bridge to 2013","uid":8126117,"size":2700402781,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:9dc668aba6cf8e685fc2e1bb53f294e3f2114aeb&amp;dn=Bashar+-+Crossing+the+Bridge+to+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"awakeperson","files":2,"time":1360504170,"description":"Choosing your state of bring for crossing the threshold.\n\nQ&amp;A includes: Are there more Sacred Circuits and are you going to deliver them to us?  Are the Hybrid Children listening in on this transmission?  Fluctuations in experience.  Is the higher self the &quot;seed of being&quot;?  As we ascend will we become more connected?  Redefining Karma.  Has our human DNA been &quot;unplugged&quot;?  What are the strange noises emanating from Earth?  Are all expressions of existence there by choice?  About different soul families.  How can I help my friends and family to shift too?  Is the shift going on now the earth reincarnating?  Has your percentage increased that has come through this room?  Does our shifting create different patterns of energy?  Does your spiral sculpture that you created help our shift?  How each the interstellar alliance members' contact crystals grow.  Rediscovering Tesla's energy knowledge.  Where do we stand on the timeline divergence that you discussed last year?  When will have open contact?  Do I have an Essassani counterpart in your current time frame?","torrent":{"xt":"urn:btih:9dc668aba6cf8e685fc2e1bb53f294e3f2114aeb","amp;dn":"Bashar+-+Crossing+the+Bridge+to+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9dc668aba6cf8e685fc2e1bb53f294e3f2114aeb","infoHashBuffer":{"type":"Buffer","data":[157,198,104,171,166,207,142,104,95,194,225,187,83,242,148,227,242,17,74,235]},"announce":[],"urlList":[]}}