{"title":"The Academy Is... - Discography (2004-2009) [FLAC]","uid":8420775,"size":1291462237,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9dc6426d66b18c77a02778d95ed560bf0aeb6fca&amp;dn=The+Academy+Is...+-+Discography+%282004-2009%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1367184655,"description":"\n  The Academy Is... - Discography (2004-2009) [FLAC]\n\n  Genre: Pop/Rock\n  Style: Alternative, Indie Rock, Emo\n  Source: CD\n  Codec: FLAC\n  Bit Rates: ~ 800 - 1,000 kbps\n  Bits Per Sample: 16 \n  Sample Rate: 44,100 Hz\n \n  2004 The Academy \n  2005 Almost Here\n  2007 Santi \n  2008 Fast Times at Barrington High\n  2009 Lost in Pacific Time\n\n  Formerly in rival bands on the Chicago local scene, guitarist Mike Carden and vocalist William Beckett came together in 2003 to mark the beginning of emo-pop outfit the Academy Is... (originally named &quot;the Academy&quot;). Naming influences from U2 to Weezer to Pink Floyd, the duo added bassist Adam Siska (Beckett's classmate from high school), along with a second guitarist and drummer, to record 2004's The Academy EP for hometown label LLR Recordings. As luck would have it, fellow Chicagoan Pete Wentz (Fall Out Boy) heard the release and brought the band to the attention of his current label, which resulted in an offer from Gainesville's Fueled by Ramen. Six months after Carden and Beckett set to work writing their full-length debut, the band headed to Florida to record.\n\n  A few lineup changes arrived in 2004, as guitarist/vocalist Tom Conrad and drummer Andy Mrotek climbed aboard as permanent members of the group. Relentless touring with the likes of Fall Out Boy, Something Corporate, Midtown, and Armor for Sleep steadily built a devoted audience around the country before the band's well-received label debut, Almost Here, arrived in February 2005. Gigs continued at a frantic pace in support on the album, and the Academy Is... released the six-song acoustic EP From the Carpet exclusively on iTunes in early 2006. The digital release contained three new songs (including a cover of John Lennon's &quot;Working Class Hero&quot;) and acoustic versions of tracks from Almost Here.\n\n  Following a summer spent on the road with the Warped Tour, the guys parted ways with Conrad in the fall of 2006 (replaced by guitarist Michael Guy Chislett) and began writing new material back in Chicago. the Academy Is... eventually entered a California studio with famed producer Butch Walker (All-American Rejects, Hot Hot Heat) to record what would become their sophomore effort, Santi, which ultimately arrived in early April 2007. Fast Times at Barrington High, a reference to the school that Beckett and Siska attended as teenagers (as well as a nod to the '80s film Fast Times at Ridgemont High), arrived the following year.","torrent":{"xt":"urn:btih:9dc6426d66b18c77a02778d95ed560bf0aeb6fca","amp;dn":"The+Academy+Is...+-+Discography+%282004-2009%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9dc6426d66b18c77a02778d95ed560bf0aeb6fca","infoHashBuffer":{"type":"Buffer","data":[157,198,66,109,102,177,140,119,160,39,120,217,94,213,96,191,10,235,111,202]},"announce":[],"urlList":[]}}