{"title":"EnigmaT Set Rips { Cuts } - October 2nd, 2013","uid":8988066,"size":843439642,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9f59acb3e970ec87b33ee22d826105727d4a5be4&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+October+2nd%2C+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EnigmaT","files":96,"time":1380723730,"description":"5thDimension pres. Cosmic Light - A Year With You (M3R-T Remix) (Cut From Sty Set)-enTc.mp3\nAdrian Lux &amp; Marcus Schossow - Wild Child (Original Dark Mix) (ABGT 047 Rip)-enTc.mp3\nAeden - Time to say Goodbye (5thDimension Remix) (Cut From El Jay Set)-enTc.mp3\nAeden - Time To Say Goodbye (Hypaethrame Remix) (Cut From A&amp;F Set)-enTc.mp3\nAeden - Time To Say Goodbye (Hypaethrame Remix) (Cut From Del Mar Set)-enTc.mp3\nAlexandre Bergheau &amp; Geert Huinink - Ephemere (Original Mix) (Cut From A&amp;F Set)-enTc.mp3\nAmber - Noah (Zak Moya Remix) (Set Rip)-enTc.mp3\nAndy Duguid featuring Jaren - 7even (Mark Sixma Remix) (Cut From W&amp;W Set)-enTc.mp3\nAndy Moor feat Stine Grove - Time Will Tell (Eskia &amp; Kanafchian Remix) (ABGT 047 Rip)-enTc.mp3\nAngger Dimas - AHHH! (Original Mix) (Cut From Oakenfold Set)-enTc.mp3\nAzima Feat. Victoria Ray - Your Way (TrancEye Dub Mix) (Cut From El Jay Set)-enTc.mp3\nBen De Gaule - Can't Reach You (Axel Grav Remix) (Cut From Ulrich Set)-enTc.mp3\nBinary Finary &amp; Kris Maydak - Mainframe (Wrechiski Remix) (Cut From Bin Fin Set)-enTc.mp3\nBlasterjaxx &amp; Billy The Kit vs Jeffbeat - Look Back Loud &amp; Proud (Aprocltd Reboot) (Cut From E&amp;G Set)-enTc.mp3\nBlugazer - Elvirica (Original Mix) (Cut From Del Mar Set)-enTc.mp3\nBluskay &amp; Keyplayer feat. Natalie Rose - Summer Rain (Emanuele Congeddu Remix) (Cut From Del Mar Set)-enTc.mp3\nBluSkay &amp; KeyPlayer feat. Natalie Rose - Summer Rain (Emanuele Congeddu Remix) (Cut From El Jay Set)-enTc.mp3\nBrian Laruso - Flowjob (-Short- Cut From Feel Set)-enTc.mp3\nBrian Laruso - Selina (Club Mix) (-Short- Cut From Del Mar Set)-enTc.mp3\nBrutal Kids feat. Andee - Tonight (Anxess Vocal Mix) (Cut From Del Mar Set)-enTc.mp3\nCardinal feat. Arielle Maren - Stronger (ABGT 047 Rip)-enTc.mp3\nCarol Lee and Adrian&amp;Raz - I Belong To (Flashtech Remix) (Cut From Del Mar Set)-enTc.mp3\nCJ Daft - Resurrected (Sunny Lax Remix) (Cut From Sunny Lax Set)-enTc.mp3\nCosmic Gate - Fire Wire 2013 (Aprocltd &amp; Tekno Reboot) (Cut From E&amp;G Set)-enTc.mp3\nCramp Feat. Lauren Moore The Ghost Town (Cut From Sunny Lax Set)-enTc.mp3\nDanny - Palms Will Shine (Original Mix) (Cut From  Shah Set)-enTc.mp3\nDimitri Vegas &amp; Like Mike vs. Ron Caroll - What A Wonderful World (Andrew Rayel Intro Mix) (Set Rip)-enTc.mp3\nDJ DLG - Beyond Horizon (Cut From W&amp;W Set)-enTc.mp3\nEmeli Sande - Next To Me (James Egbert Remix) (Cut From Myon Set)-enTc.mp3\nErick Strong &amp; Anatoly Kontsevich - Lady #1 (Ozo Effy Remix) (Cut From Feel Set)-enTc.mp3\nFacade - LHR-AKL (Cut From Evaa Set)-enTc.mp3\nFaithless - Insomnia (Andrew Rayel Remix) (Set Rip)-enTc.mp3\nFirst Effect - Fever (Original Mix) (Cut From GO Set)-enTc.mp3\nGal Abutbul - Sunset (ABGT 047 Rip)-enTc.mp3\nHenrik B, Niklas Gustavsson, Peter Johansson - Echoes (WeSmile Remix) (Cut From W&amp;W Set)-enTc.mp3\nHypaethrame - I Will Never Forgive You (Original Mix) (Cut From A&amp;F Set)-enTc.mp3\nHypaethrame - I Will Never Forgive You (Original Mix) (Cut From Del Mar Set)-enTc.mp3\nIndecent Noise &amp; Eddie Bitar - Poltergeist (Mark Sherry Remix) (Cut 2 From Kearney Set)-enTc.mp3\nIndecent Noise &amp; Eddie Bitar - Poltergeist (Mark Sherry Remix) (Cut From Kearney Set)-enTc.mp3\nJames Kelly - Together As One (Original Mix) (Cut From Del Mar Set)-enTc.mp3\nJayB - Old Machine (Original Mix) (Cut From MORPH Set)-enTc.mp3\nJimmy Chou - Walk This Earth (Original Mix) (Cut From ReOrder Set)-enTc.mp3\nJohn O'Callaghan feat. Erica Curran - I Believe (Giuseppe Ottaviani Remix) (Cut From Kearney Set)-enTc.mp3\nJust Jack &amp; Oza - House Of Acid (Cut From Jules Set)-enTc.mp3\nKassey Voorn - Chords From Heart (Microtrauma Remix) (Cut From Vasami Set)-enTc.mp3\nKassey Voorn - Chords From The Heart (Microtrauma Remix) (ABGT 047 Rip)-enTc.mp3\nKrzysztof Chochlow - One Of Us (Original Mix) (Cut From Bin Fin Set)-enTc.mp3\nLTN - Wait Forever (ABGT 047 Rip)-enTc.mp3\nMaayan Rechler - Corsica (ABGT 047 Rip)-enTc.mp3\nMad Reavers - Summer Breeze (Original Mix) (Cut From Feel Set)-enTc.mp3\nMaison &amp; Dragen feat. Toni Nielsen - Immortal Love (Original Mix) (Cut From Del Mar Set)-enTc.mp3\nManufactured Superstars - Angry Panda (Cut From O'Neil Set)-enTc.mp3\nMarcioz Pollack - Alligator (Human Torque Remix) (Cut From Haig Set)-enTc.mp3\nMartain Pres. Robots On Mars - From The Sky We Came (Rick Valentine Edit) (Cut From Valentine Set)-enTc.mp3\nMartin Graff &amp; Martin Soundriver - Fleeting Moments (Original Mix) (Cut From Feel Set)-enTc.mp3\nMat Zo - Lucid Dream (ABGT 047 Rip)-enTc.mp3\nMauro Picotto - Lizard (Steve Brian Presents Mr. Sander Bootleg) (Cut From Dinaire Set)-enTc.mp3\nMax Solar &amp; Next Beat - 6 A.M. (Mohamed Bahi Remix) (Cut From A&amp;F Set)-enTc.mp3\nMenno De Jong - Any Other Day (Original Mix) (Cut From A&amp;F Set)-enTc.mp3\nMike Hoang - Saved You (Cut From GO Set)-enTc.mp3\nMike Sonar - Blink (Cut From Tritonal Set)-enTc.mp3\nMobil - Outer Space (Cut From Ulrich Set)-enTc.mp3\nMoTi - Heat It Up (Cut From W&amp;W Set)-enTc.mp3\nMyon &amp; Shane 54 feat. Amy Pearson - Hurricane (MS54 ISOS Extended Mix) (ABGT 047 Rip)-enTc.mp3\nMyon &amp; Shane 54 feat. Carrie Skipper - Vampire (LTN Bootleg) (ABGT 047 Rip)-enTc.mp3\nN&amp;R Project - Inclination (Original Mix) (Cut From ReOrder Set)-enTc.mp3\nNaden - Tokamak (Cut From Eco Set)-enTc.mp3\nNick Stoynoff - Berlin Dream (Tim Penner Remix) (Cut From Toper Set)-enTc.mp3\nNiclas &amp; Maicuss - TBA (Erick Pride Remix) (Cut From Ulrich Set)-enTc.mp3\nNoel Sanger - Every Single Star (Cut From O'Neil Set)-enTc.mp3\nNordic Coast - Sunrise in Brisbane (Another World Remix) (Cut From Sty Set)-enTc.mp3\nNurettin Colak - Neama (Original Mix) (Cut From Feel Set)-enTc.mp3\nO.B.M Notion - Aura (Mostfa &amp; Mostfa Remix) (Cut From A&amp;F Set)-enTc.mp3\nO.B.M. Notion - Aura (Mostfa &amp; Mostfa Remix) (Cut From Del Mar Set)-enTc.mp3\nRichard Durand - Super Dad (Cut From Durrand Set)-enTc.mp3\nRick Mitchells - Rockin Steady (Cut From W&amp;W Set)-enTc.mp3\nRymania - Rainy Morning (Original Mix) (Cut From A&amp;F Set)-enTc.mp3\nSean Tyas &amp; Darren Porter - Nova 7 (Cut From Kandi Set)-enTc.mp3\nSergey Alekseev Feat. Ange - It's Morning (Andrew Benson Remix) (Cut From  Shah Set)-enTc.mp3\nSergey Alekseev, Syntheticsax &amp; Ali Takekawa - Waiting For You (Cut From Myon Set)-enTc.mp3\nSied van Riel &amp; Eximinds - Long Laster (Cut From Sied Set)-enTc.mp3\nSkilf - Shuffle (Timothy Allen vs. Mark Loverush Remix) (Cut From O'Neil Set)-enTc.mp3\nSlyder - Neo (The One) (Psymes Neo Veteran Remix) (Cut From Sneijder Set)-enTc.mp3\nStev Burton - Saturn (Cut From Jules Set)-enTc.mp3\nStiven Rivic &amp; Micheal &amp; Levan - Subway (Cut From Valentine Set)-enTc.mp3\nSuprano feat. Claire Willis - Holding On (Mosahar Remix) (Cut From Feel Set)-enTc.mp3\nSuspect 44 - Amazing (ABGT 047 Rip)-enTc.mp3\nThe Partysquad &amp; Mitchell Niemeyer - #PantsDown (Cut From W&amp;W Set)-enTc.mp3\nTom Swoon &amp; Josef Belani - RollerCoaster (Original Mix) (Cut From E&amp;G Set)-enTc.mp3\nTres Ratones Ciegos - Profesor De Educacion Fisica (Alya) (Cut From R33 Set)-enTc.mp3\nTWEAK&amp;BRAINS - Star Dust (Axel Grav Remix) (Cut From Ulrich Set)-enTc.mp3\nTwoface - Tournament (Cut From Evaa Set)-enTc.mp3\nUniversal Solutions - Tora Bora (Paul Whitaker Remix) (ABGT 047 Rip)-enTc.mp3\nWitness45 - Silence (Original Mix) (Cut From  Shah Set)-enTc.mp3\nWolfgang Gartner &amp; Tommy Trash - Hounds Of Hell (Cut From W&amp;W Set)-enTc.mp3\nZak Moya - Eden (Set Rip)-enTc.mp3\n","torrent":{"xt":"urn:btih:9f59acb3e970ec87b33ee22d826105727d4a5be4","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+October+2nd%2C+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f59acb3e970ec87b33ee22d826105727d4a5be4","infoHashBuffer":{"type":"Buffer","data":[159,89,172,179,233,112,236,135,179,62,226,45,130,97,5,114,125,74,91,228]},"announce":[],"urlList":[]}}