{"title":"TNA Enigma - The Best Of Jeff Hardy","uid":4349610,"size":2962059198,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a0013bfb15159c46df56f322bbaf13cd5428cf8a&amp;dn=TNA+Enigma+-+The+Best+Of+Jeff+Hardy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"seiyar","files":3,"time":1219082062,"description":"One of the most electrifying superstars in wrestling, The Charasmatic Enigma provides nearly 4 hours of action, including his surprise debut against The Phenomenal AJ Styles, his wars with Jeff Jarrett for the NWA World Heavyweight title, barbaric ...    Full Descriptionclashes with the monster Abyss, and more, plus bonus footage of his music video.\n\nProfessional wrestler Jeff &quot;The Charismatic Enigma&quot; Hardy first shot to fame as half of the WWF&amp;#039;s Hardy Boyz tag team, but his dangerous, acrobatic moves made him a natural for the maverick wrestling division, Total Nonstop Action (TNA), which he joined in 2004. This collection celebrates Hardy&amp;#039;s TNA tenure with a selection of clips from his most memorable matches, including his surprise debut against AJ Styles, his battle against Jeff Jarrett for the NWA World Heavyweight Title, and his long-running feud with nemesis Abyss.\n\n\nMatches:\n\nNWA World Heavyweight Title Match\nJeff Jarrett vs. Jeff Hardy\nJeff Hardy and AJ Styles vs. the Naturals\nJeff Hardy vs. the Alpha Male Monty Brown\nJeff Hardy, AJ Styles and the Truth vs. Team Canada\nVictory Road: NWA World Heavyweight Title Match\nJeff Jarrett vs. Jeff Hardy\nTurning Point: Jeff Hardy, AJ Styles and Randy Savage vs. Jeff Jarrett, Kevin Nash and Scott Hall\nJeff Hardy vs. Bobby Roode\nFinal Resolution: Jeff Hardy vs. Scott Hall w/ special referee Roddy Piper\nDestination X: Final Assault Match: Jeff Hardy vs. Abyss\nLockdown: Jeff Hardy vs. Raven\n","torrent":{"xt":"urn:btih:a0013bfb15159c46df56f322bbaf13cd5428cf8a","amp;dn":"TNA+Enigma+-+The+Best+Of+Jeff+Hardy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0013bfb15159c46df56f322bbaf13cd5428cf8a","infoHashBuffer":{"type":"Buffer","data":[160,1,59,251,21,21,156,70,223,86,243,34,187,175,19,205,84,40,207,138]},"announce":[],"urlList":[]}}