{"title":"Bioshock Infinite (PAL, JTAG Rip)","uid":8289699,"size":6253144657,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:a0e95643c0d6b195c26e2bc43fdef5517544f750&amp;dn=Bioshock+Infinite+%28PAL%2C+JTAG+Rip%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bioshock_infinite","files":1,"time":1364018881,"description":"BioShock Infinite is an upcoming first-person shooter video game and the third installment in the BioShock series. Previously known as &quot;Project Icarus&quot;, it is being developed by Irrational Games for a March 26, 2013 worldwide release on the Microsoft Windows, PlayStation 3, and Xbox 360 platforms. BioShock Infinite is not part of the storyline of previous BioShock games but features similar gameplay concepts and themes.\n\nSet in 1912 during the growth of American Exceptionalism, the game's protagonist, former Pinkerton agent Booker DeWitt, is sent to the floating air-city of Columbia to find a young woman, Elizabeth, who has been held captive there for the last twelve years. Though Booker rescues Elizabeth, the two are pursued by the city's warring factions; the nativist and elite Founders that strive to keep the city for pure Americans, and the Vox Populi, a rebel grouping representing the common people. Booker finds Elizabeth to be central to this conflict, and that she also holds strange powers to manipulate rifts in the time-space continuum that ravage Columbia.\n\nThe player controls Booker throughout the game, eventually working with the AI-controlled Elizabeth. Like previous BioShock games, the player uses a combination of weapons, gear, psychokinetic powers granted through vigors and Elizabeth's own powers to fight off hostile foes and make their way through Columbia. In contrast to the limited spaces of the underwater city of Rapture, the open-air city of Columbia provides for more combat challenges, including combat that takes place aboard the city's Skyline rollercoaster-like rail system. The game will also feature an optional &quot;1999 Mode&quot;, harkening back to games like System Shock 2 where decisions made by the player will have a more permanent impact on the game, possibly leading the player to an unwinnable situation and requiring a restart from an earlier saved game.\n\nLead designer Ken Levine was inspired by both historical events at the turn of the 19th century, as well as more recent ones including the &quot;Occupy&quot; protests. The floating city of Columbia was envisioned as a homage to the 1893 Worlds Fair along with other media from the turn of the century, and 2K Marin was brought in to help realize the city in-game. Levine took an unorthodox approach with the voice actors for Booker and Elizabeth, Troy Baker and Courtnee Draper, respectively, by developing the script and details of the story alongside them during their voice work, allowing them to help define the characters and deliver more convincing performances within the game. BioShock Infinite has received early pre-release attention, winning several awards including the &quot;Best of Show&quot; at the 2011 E3 show.","torrent":{"xt":"urn:btih:a0e95643c0d6b195c26e2bc43fdef5517544f750","amp;dn":"Bioshock+Infinite+%28PAL%2C+JTAG+Rip%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0e95643c0d6b195c26e2bc43fdef5517544f750","infoHashBuffer":{"type":"Buffer","data":[160,233,86,67,192,214,177,149,194,110,43,196,63,222,245,81,117,68,247,80]},"announce":[],"urlList":[]}}