{"title":"8thStreetLatinas - Maya Bijou (Beautiful Bijou) NEW 15 July 2016","uid":15309475,"size":424094657,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:a0f809ffdf126d9e3d85f73dd8ba51676e9f86ab&amp;dn=8thStreetLatinas+-+Maya+Bijou+%28Beautiful+Bijou%29+NEW+15+July+2016&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xxxlavalxxx","files":2,"time":1468567824,"description":"Jamc got a call from Maya Bijou the other day. She must have sensed our presence because we weren't far from her. She was at the mall ready to get some lingerie when she realized forgot her money, so she says. From the look of her and what she was wearing, she forgot a few other items as well. As an eighteen year old fox, she figured she would call us up, and we would throw money at her. Once we saw her flash that shaved tight pussy of hers, we started to think about making it rain on her. This young hottie knew the power of her hot body, so she let us get a taste right there out in the open. We decided to give her some loot, but we had to stop by the crib to have some fun first. She was eager to get her groove on and move on. Jamc dove right into her tight little ass hole and licked her thorughly. Maya and her tiny frame could really take a huge cock. Jmac gave it to her as she came a couple times. She was worth her weight in gold, but we didn't agree on anything crazy like that. She did try to get more out of us since Jmac splattered her hair with some extra man gel.\r\nCategories\r\nAmateur General Brunette Heels Chic Living Room Outside Blowjob Pussy Licking Doggystyle Asslick Latin Teen (18-19) Facial Shaved Skinny Short (Petite) 1 on 1 Straight\r\n \nhttp://imgdone.com/viewer.php?file=87833212036373732840.jpg\r\n \nhttp://imgdone.com/viewer.php?file=49603828680040569659.jpg","torrent":{"xt":"urn:btih:a0f809ffdf126d9e3d85f73dd8ba51676e9f86ab","amp;dn":"8thStreetLatinas+-+Maya+Bijou+%28Beautiful+Bijou%29+NEW+15+July+2016","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0f809ffdf126d9e3d85f73dd8ba51676e9f86ab","infoHashBuffer":{"type":"Buffer","data":[160,248,9,255,223,18,109,158,61,133,247,61,216,186,81,103,110,159,134,171]},"announce":[],"urlList":[]}}