{"title":"Cape Refuge series by Terri Blackstock","uid":9636521,"size":5233150,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a23849b20ff15557adc9dcab1ff89d933b4f1e33&amp;dn=Cape+Refuge+series+by+Terri+Blackstock&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"PirateBook","files":9,"time":1392854355,"description":"\nTerri Blackstock is the bestselling author of the Newpointe 911 and Sun coast Chronicles suspense series and other books, including Cape Refuge, Emerald Windows, Seaside, and her novels with Beverly LaHaye.\n\nGenre: Mystery | Thriller\n\n\n#1 Cape Refuge\nWhen Thelma and Wayne Owens are found murdered in the warehouse where they held their church services, their son-in-law Jonathan is arrested for the crime-but his wife Morgan and her sister Blair, Thelma and Wayne's daughters, are confident that he didn't do it and set out to find the real killer.\n\nMystery and suspense combine in this first book of an exciting new 4-book series by best-selling author Terri Blackstock Thelma and Wayne Owens run a bed and breakfast in Cape Refuge, Georgia. They minister to the seamen on the nearby docks and prisoners just out of nearby jails, holding services in an old warehouse and taking many of the &quot;down-and-outers&quot; into their home. \n\nThey have two daughters: the dutiful Morgan who is married to Jonathan, a fisherman, and helps them out at the B &amp; B, and Blair, the still-single town librarian, who would be beautiful if it weren't for the serious scar on the side of her face. After a heated, public argument with his in-laws, Jonathan discovers Thelma and Wayne murdered in the warehouse where they held their church services. \n\nConsidered the prime suspect, Jonathan is arrested. Grief-stricken, Morgan and Blair launch their own investigation to help Matthew Cade, the town's young police chief, find the real killer. Shady characters and a raft of suspects keep the plot twisting and the suspense building as we learn not only who murdered Thelma and Wayne, but also the secrets about their family's past and the true reason for Blair's disfigurement.\n\nAuthor Biography: Terri Blackstock (http://www.terriblackstock.com) is the best-selling author of the Newpointe 911 and Sun Coast Chronicles suspense series and other books, including &quot;Cape Refuge&quot;, &quot;Emerald Windows&quot;, &quot;Seaside&quot;, and her novels with Beverly LaHaye. She has appeared on national television programs such as &quot;The 700 Club&quot; and &quot;Home Life&quot; and has been a guest on numerous radio programs nationwide.\n\n#2 Southern Storm\nPolice Chief Cade disappears after hitting and killing a man with his car. Without a trace, without a note, without taking clothes or his car or money, he is gone. When a witness says she saw Cade getting into a blue Buick with a woman before his disappearance, the newspapers report that Cade left town to be with her. Blair knows it doesn't make sense for Cade to leave without word for any reason. \n\nThe dead man is identified, and it soon becomes clear that the woman Cade was seen with was the wife of the dead man. Newspapers begin to ask hard questions. Was the Cape Refuge Chief of Police having an affair with this woman? Did he deliberately kill her husband, then make it look like an accident? When the police department receives a handwritten note from Cade that he has run off to get married to a woman he's kept secret, everyone breathes a sigh of relief. \n\nBut Blair notices his unusual signature: Matt Cade. Cade never goes by his first name, and he especially never calls himself &quot;Matt.&quot; She thinks it's a signal from him that the contents of the note are false. Meanwhile, around the south, there are news reports about babies being kidnapped from area hospitals. When a ransom call comes to Hanover House from the baby's kidnapper, they are all shocked to see that the phone it is traced to is Cade's cell phone. Is he involved in the babies' disappearance? Is that why he's disappeared?\n\nSequel to the #1 best-selling Cape Refuge First a dead stranger. Now a missing Police Chief. Did Chief Cade run off to elope . . . or has he met with foul play? The body in the morgue had no ID. No one knew who he was or where he came from when he walked out in front of Cade's car. And when Cade learns he had a gunshot wound before he was struck, finding his identity becomes even more urgent.\n\nThen Cade vanishes. Authorities discover the victim's name, and the woman Cade was last seen with turns out to have been the dead man's wife. Speculation abounds about Cade's relationship to the woman and his part in the victim's death. His disappearance makes him look even more suspicious. But Blair Owens doesn't believe the rumors. Something has happened to Cade, and she's determined to find him. Saving Cade's life will take faith in a God whom Blair has always doubted-but he may be her only hope.\n\n#3 River's Edge\nBen Jackson is sure to win the mayoral election, until his wife turns up dead at the bottom of the river, and letters surface from a mysterious woman claiming she and Ben were having an affair...\n\n#4Breaker's Reef\nIn the fourth book of the Cape Refuge Series, a teenage girl is found murdered, and the scene matches one in a book by a famous mystery writer who just moved to the island. This murder has a connection to Hanover House, and the residents there might never be the same.","torrent":{"xt":"urn:btih:a23849b20ff15557adc9dcab1ff89d933b4f1e33","amp;dn":"Cape+Refuge+series+by+Terri+Blackstock","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a23849b20ff15557adc9dcab1ff89d933b4f1e33","infoHashBuffer":{"type":"Buffer","data":[162,56,73,178,15,241,85,87,173,201,220,171,31,248,157,147,59,79,30,51]},"announce":[],"urlList":[]}}