{"title":"Bonnie Raitt - Slipstream (2012) [flac]","uid":7968929,"size":366033725,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a38b10271b35a330a1b8bd8d300fd0614585bb6c&amp;dn=Bonnie+Raitt+-+Slipstream+%282012%29+%5Bflac%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"rambam1776","files":-1,"time":1356774376,"description":"---------------------------------------------------------------------\n                      Bonnie Raitt - Slipstream\n---------------------------------------------------------------------\n\nRipper...............: EAC (Secure mode)\nCodec................: Free Lossless Audio Codec (FLAC)\nVersion..............: reference libFLAC 1.2.1 20070917\nQuality..............: Lossless, (avg. compression: 58 %)\nChannels.............: Stereo / 44100 HZ / 16 Bit\nTags.................: VorbisComment\nInformation..........: http://www.barnesandnoble.com/w/slipstream-bonnie-raitt/23550905\nIncluded.............: NFO, LOG, CUE\nCovers...............: Front Back CD \n\n---------------------------------------------------------------------\n                       Tracklisting\n---------------------------------------------------------------------\n\n   1. Bonnie Raitt - Used To Rule The World                   [04:18]\n   2. Bonnie Raitt - Right Down The Line                      [05:29]\n   3. Bonnie Raitt - Million Miles                            [06:26]\n   4. Bonnie Raitt - You Can't Fail Me Now                    [04:18]\n   5. Bonnie Raitt - Down To You                              [03:59]\n   6. Bonnie Raitt - Take My Love With You                    [04:24]\n   7. Bonnie Raitt - Not Cause I Wanted To                    [03:37]\n   8. Bonnie Raitt - Ain't Gonna Let You Go                   [05:59]\n   9. Bonnie Raitt - Marriage Made In Hollywood               [04:55]\n  10. Bonnie Raitt - Split Decision                           [04:35]\n  11. Bonnie Raitt - Standing In The Doorway                  [05:24]\n  12. Bonnie Raitt - God Only Knows                           [04:26]\n\nPlaying Time.........: 57:54\nTotal Size...........: 341.49 MB\n---------------------------------------------------------------------\nAll Music Guide - Thom Jurek\nSlipstream provides ample proof of just how much fans have missed Bonnie Raitt since 2005's Souls Alike. The album was recorded over a period of a year at Ocean Way in Hollywood and at Joe Henry's Garfield House. The four tracks cut at Henry's studio in 2010 and 2011 include two of his own songs, and two covers of Bob Dylan tunes (&quot;Million Miles&quot; and &quot;Standing in the Doorway&quot;) from the latter's Time Out of Mind. Raitt's voice has never sounded better. She's expanded her lower range with an expressiveness that is soulful, rich, and rings emotionally true -- though she's sacrificed none of her higher register. Her voice can command and reveal a devastating tenderness. Guest Bill Frisell appears on three tunes here. He's on both Dylan tunes and his lyrical, lovely touch is also heard on her definitive reading of the Henry/Loudon Wainwright III tune &quot;You Can't Fail Me Now.&quot; On &quot;Million Miles,&quot; the interplay between Frisell's signature tone and Raitt's nasty electric slide work is symbiotic. On the latter, Raitt's voice sounds like it's inside the human heart at its most open and willfully defenseless vulnerability. It reminds us of what made her readings of &quot;Love Has No Pride&quot; and &quot;I Can't Make You Love Me&quot; so important. Henry's stable of players -- Patrick Warren, Jay Bellerose, and Greg Leisz -- are all in tow; they provide the slow, warm spaciousness that's now de rigueur in his work with other artists (he reserves his adventurousness for his own records). Raitt says she'll release the complete Garfield House sessions in the future. She produced the rest, offering solid proof of what her live band -- guitarist George Marinelli, drummer Ricky Fataar, keyboardist Mike Finnigan, and bassist James Hutchinson -- is capable of in the studio. The energy is kinetic, immediate, and deep in the rhythmic cut. Her reading of Gerry Rafferty's &quot;Right Down the Line,&quot; with its reggae backbeat, rocksteady bassline, funky clavinet, and the interplay between Raitt and Marinelli, adds dimension and texture to the original -- which is just what covers are supposed to do. &quot;Down to You,&quot; written by Marinelli, Raitt, and Randall Bramblett, has the feel of Little Feat's &quot;Easy to Slip&quot; but is more urgent and punchy. On another ballad, Al Anderson and Bonnie Bishop's &quot;Not Cause I Wanted To,&quot; Raitt expresses her accountability in a relationship's failure with total openness and courage. &quot;Ain't Gonna Let You Go,&quot; by Anderson and Bonnie Bramlett, is a lusty, crunchy, uptempo blues driven by Finnigan's B-3 and Wurlitzer, and Raitt's wrangling slide and take-no-prisoners vocal. Though very different from one another, Slipstream's two production styles complement one another well. That said, Raitt's road band is so seasoned and instinctive, it would be interesting to hear her record them live in the studio as she did players on her earliest records -- but that's a wish, not a criticism. There are a few lesser moments, but they don't distract; Slipstream reveals Raitt at another creative peak.","torrent":{"xt":"urn:btih:a38b10271b35a330a1b8bd8d300fd0614585bb6c","amp;dn":"Bonnie+Raitt+-+Slipstream+%282012%29+%5Bflac%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a38b10271b35a330a1b8bd8d300fd0614585bb6c","infoHashBuffer":{"type":"Buffer","data":[163,139,16,39,27,53,163,48,161,184,189,141,48,15,208,97,69,133,187,108]},"announce":[],"urlList":[]}}