{"title":"Radiologic Science for Technologists, 10E [PDF] [StormRG]","uid":9715622,"size":124558817,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a39151237eac02a85fb8a2e89fc3868e997ab2fe&amp;dn=Radiologic+Science+for+Technologists%2C+10E+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"0xmovva","files":-1,"time":1394156557,"description":"Author: Stewart C. Bushong \nSeries: RADIOLOGIC SCIENCE FOR TECHNOLOGISTS: PHYS, BIOL &amp; PROTECTION\nHardcover: 672 pages\nPublisher: Mosby; 10 edition (June 27, 2012)\nLanguage: English\nISBN-10: 0323081355\nISBN-13: 978-0323081351 \nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet.  Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n\n_____________________________________________________________________________________\n\nDevelop the skills and knowledge to make informed decisions regarding technical factors and diagnostic imaging quality with the vibrantly illustrated Radiologic Science for Technologists, 10th Edition. Updated with the latest advances in the field, this full-color and highly detailed edition addresses a broad range of radiologic disciplines and provides a strong foundation in the study and practice of radiologic physics, imaging, radiobiology, radiation protection, and more. Unique learning tools strengthen your understanding of key concepts and prepare you for success on the ARRT certification exam and in clinical practice.\n\nBroad coverage of radiologic science topics - including radiologic physics, imaging, radiobiology, radiation protection, and more - allows you to use the text over several semesters.\n\nHighlighted math formulas call attention to mathematical information for special focus.\n\nImportant Concept boxes recap the most important chapter information.\n\nColored page tabs for formulas, conversion tables, abbreviations, and other data provide easy access to frequently used information.\n\nEnd-of-chapter questions include definition exercises, short answer, and calculations to help you review material.\n\nKey terms and expanded glossary enable you to easily reference and study content.\n\nChapter introductions, summaries, objectives, and outlines help you organize and pinpoint the most important information.\n\nNEW! Chapters on digital radiographic technique and digital image display prepare you to use today's technology.\n\nNEW! Streamlined physics and math sections ensure you are prepared to take the ARRT exam and succeed in the clinical setting.","torrent":{"xt":"urn:btih:a39151237eac02a85fb8a2e89fc3868e997ab2fe","amp;dn":"Radiologic+Science+for+Technologists%2C+10E+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a39151237eac02a85fb8a2e89fc3868e997ab2fe","infoHashBuffer":{"type":"Buffer","data":[163,145,81,35,126,172,2,168,95,184,162,232,159,195,134,142,153,122,178,254]},"announce":[],"urlList":[]}}