{"title":"Hum Sab Ustad Hain 1965 - DVD Rip - Xvid - 1.09 GB - vinalsuper.","uid":7117989,"size":1174831104,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a398ea9936bbcef6994385f74eb96f2b8fa88fc1&amp;dn=Hum+Sab+Ustad+Hain+1965+-+DVD+Rip+-+Xvid+-+1.09+GB+-+vinalsuper.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nara10","files":-1,"time":1332272145,"description":"Hum Sab Ustad Hain (1965)\n\nDirector: Maruti Rao\n\nWriter: Maruti Rao\n\nMusic by Laxmikant Shantaram Kudalkar &amp; Pyarelal Ramprasad Sharma\n\nPlot:\nRomi (Sheikh Mukhtar) shoots a man but does not kill him. A bullet fired from somewhere else does the job, but he is arrested, convicted and sentenced for the murder. His pregnant wife Radha (Lalita Kumari) throws herself in the river, but is saved by a village that accepts her and her soon born son Ram (Dara Singh). After 14 long years in jail, he roams 8 long years being rejected by society and cannot find a job or assistance, then turns to violent crime. His gang is offered a large sum of money to smuggle national secrets out of the area, so he kidnaps a young child and forces her sister Roopa (Ameeta) to carry the goods. Roopa would rather die than become a traitor, loses control of her car and is cast into the river, washing ashore in the same village with Radha and Ram. Meanwhile, unemployed Kishore (Kishore Kumar) decides he will play detective to find the lost girl Radha and her sister, tracks her to the village and falls in love. Romi and his gang also track Roopa, and they flee to the city to save her sister, where Ram becomes employed as a wrestler. Romi tracks them down, kidnaps Radha, and realizes that it is his long lost family. He decides he will sacrifice himself to save them to show that his heart is still honest. \n\n\nThis is my first upload on tpb.\nIf i have made any mistake please let me know.\n\nThanks","torrent":{"xt":"urn:btih:a398ea9936bbcef6994385f74eb96f2b8fa88fc1","amp;dn":"Hum+Sab+Ustad+Hain+1965+-+DVD+Rip+-+Xvid+-+1.09+GB+-+vinalsuper.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a398ea9936bbcef6994385f74eb96f2b8fa88fc1","infoHashBuffer":{"type":"Buffer","data":[163,152,234,153,54,187,206,246,153,67,133,247,78,185,111,43,143,168,143,193]},"announce":[],"urlList":[]}}