{"title":"The Andromeda Strain HDTV 720p (1971)","uid":9833123,"size":3400627930,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:a3b799130be1341a38dec8f1ecfbb4bc60d00cf2&amp;dn=The+Andromeda+Strain+HDTV+720p+%281971%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"user101966","files":2,"time":1395874744,"description":"www.imdb.com/media/rm956866304/tt0066769\n\nLittle has been written about this movie, The Andromeda Strain (1971), which is based on a Michael Crichton novel bearing the same name. Although probably even less has been written about the novel!\n\nThe movie itself, in my opinion, is one of the all-time greats in science fiction and will continue to fascinate and frighten its audiences with its plot, realism and superb acting. The plot on its own is nothing new. We've all seen or read stories about extraterrestrial &quot;invaders&quot; of one sort or another. We've all seen films about deadly unstoppable viruses and the like. And yet we watch these movies, maybe knowing or expecting the outcome to be what it becomes, but whether or not our expectations are realized, at the end it's still &quot;just a movie&quot;.\n\nThe Andromeda Strain, however, takes this simple plot and turns it into a truly terrifying nightmare in several subtle ways. First and foremost is the realism of the set and in almost every other aspect of the film. Even the opening credits lend a hand in pulling you into the movie's world. Prior to the credits a short blurb about what is to come; something to do with a &quot;scientific crisis&quot; and then the military is involved, finally ending with: &quot;the documents presented here do not jeopardize the national security&quot;. Then on to the credits where we see institutions like Cal Tech and JPL along with Honeywell, Du Pont, Central Research Labs and so on listed blandly as if a document *were* about to be presented.\n\nIn fact, as far as the science part goes, no trickery is needed, or used. Every piece of equipment is an authentic piece of laboratory equipment found in laboratories the world over.\n\nEven the act of *doing* science is painstakingly reproduced with enough detail for the realism, but not so much as to put you to sleep!\n\nAnyway, I'll paste in someone else's review to augment what I've written so far:\n\n-----------------------------------------\nFrom http://www.imdb.com/\n\nI have always been attracted by science, since my early childhood. I remember seeing this movie and being fascinated by the science and technology on display in it. Today, as a MSC EE, I can see that the science in &quot;Andromeda Strain&quot; is accurate. In fact, it's the most accurate of all Sci-Fi movies I have ever seen (and I have seen the great majority of Sci-Fi cinema).\n\nThat's one reason I love this movie.\n\nBut there are other, probably subjective reasosn for my adulation of &quot;Andromeda Strain&quot;: believable people and believable situations (no &quot;last microsecond decision/action/occurance&quot;, no over-the-top behaviour, just human quirkyness, no one-man-does-it-all but teamwork and birth of ideas) and the avoidance of the cliche of only-1-will-survive. So, yes, I liked the script a lot.\n\nI also thought the actors were good and the setting was brilliant. I am not put off by dated computer technology: the film clearly illustrates the computing capabilities at the beginning of the '70, and I find something educative and strangely reassuring in that.\n\nI give it 10/10, and am sad that nobody produced a Sci-Fi as scientificly accurate ever since.\n\n-----------------------------------------\nFrom http://www.imdb.com/\n\nEasily - EASILY - the best film Michael Crichton has had anything to do with. (That is, of the ones I've seen. For the record, the rest are: `Westworld', `The First Great Train Robbery', `Disclosure', `Jurassic Park', `Twister', and `Congo', although I've never made it to the end of `Congo'.) Does this say something about Crichton's career, or the state of film-making, or neither? Can't say.\n\nWhatever - this is pretty darned good science fiction. Sure, it has the vices we've come to expect: scientists with a tendency to act like the crew of the Enterprise, and central protagonists who begin the film by swimming through treacle and end it by leaping tall buildings in a single bound. As for the former problem, well, it's not so bad here as it usually is. As for the latter, well, it's easy to forgive, because we're put through a very tense ride before our heroes crawl out of the treacle - even afterwards. They don't make films this tense these days. Or at least, this particular film would have been less tense if it had been made these days. I don't think a modern director would have resisted the temptation to goof off at some point.\n\nTHAT'S part of the charm. The film's idea of how scientists behave is rather a silly one, but at least the scientists aren't forced to act GOOFY in order to show that scientists are really human, after all - as if there was any need to show this. And I'll say this: whatever the scientists were like, the SCIENCE is much more intelligent than a modern public has any right to expect. So far as I could tell (not that I'm an expert in anything) it only stretches into fantasy when it needs to. Wise gives us information, and plenty of it - not techno-babble.\n\nI've heard people snicker at the thirty-year-old look of the film, but I think they're nuts. The art direction is wonderful. In a way it does the same thing as the original Star Trek: it creates a coherent, claustrophobic world by force of sheer simplicity. But to see `The Andromeda Strain' is to see it done WELL.\n\n******************************************************\n******************************************************\n******************************************************\n\nVideo Info:\n------------\nGeneral\nComplete name                            : The Andromeda StrainThe.Andromeda.Strain.1971.HDTVRip.720p.REFLECTIONS.avi\nFormat                                   : AVI\nFormat/Info                              : Audio Video Interleave\nFormat profile                           : OpenDML\nFile size                                : 3.17 GiB\nDuration                                 : 2h 10mn\nOverall bit rate mode                    : Variable\nOverall bit rate                         : 3 472 Kbps\nWriting application                      : MEncoder r33883\nWriting library                          : MPlayer\n\nVideo\nID                                       : 0\nFormat                                   : MPEG-4 Visual\nFormat profile                           : Simple@L3\nFormat settings, BVOP                    : No\nFormat settings, QPel                    : No\nFormat settings, GMC                     : No warppoints\nFormat settings, Matrix                  : Default (H.263)\nCodec ID                                 : XVID\nCodec ID/Hint                            : XviD\nDuration                                 : 2h 10mn\nBit rate                                 : 3 272 Kbps\nWidth                                    : 1 280 pixels\nHeight                                   : 544 pixels\nDisplay aspect ratio                     : 2.35:1\nFrame rate                               : 23.976 fps\nColor space                              : YUV\nChroma subsampling                       : 4:2:0\nBit depth                                : 8 bits\nScan type                                : Progressive\nCompression mode                         : Lossy\nBits/(Pixel*Frame)                       : 0.196\nStream size                              : 2.98 GiB (94%)\nWriting library                          : XviD 63\n\nAudio\nID                                       : 1\nFormat                                   : MPEG Audio\nFormat version                           : Version 1\nFormat profile                           : Layer 3\nMode                                     : Joint stereo\nMode extension                           : MS Stereo\nCodec ID                                 : 55\nCodec ID/Hint                            : MP3\nDuration                                 : 2h 10mn\nBit rate mode                            : Variable\nBit rate                                 : 192 Kbps\nChannel(s)                               : 2 channels\nSampling rate                            : 48.0 KHz\nCompression mode                         : Lossy\nStream size                              : 176 MiB (5%)\nAlignment                                : Aligned on interleaves\nInterleave, duration                     : 24 ms (0.58 video frame)\nInterleave, preload duration             : 516 ms\n","torrent":{"xt":"urn:btih:a3b799130be1341a38dec8f1ecfbb4bc60d00cf2","amp;dn":"The+Andromeda+Strain+HDTV+720p+%281971%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a3b799130be1341a38dec8f1ecfbb4bc60d00cf2","infoHashBuffer":{"type":"Buffer","data":[163,183,153,19,11,225,52,26,56,222,200,241,236,251,180,188,96,208,12,242]},"announce":[],"urlList":[]}}