{"title":"Star Wars™: Commander v3.6.0.6952 + mods","uid":13833125,"size":120719373,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:a5201fa011dd63d5780e7af188a70d74f28c1bfe&amp;dn=Star+Wars%26trade%3B%3A+Commander+v3.6.0.6952+%2B+mods&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tiropitaki","files":3,"time":1457742483,"description":"Fight for Your Side. Command The Galaxy.\r\n\r\nThe Galactic War rages on. Where does your allegiance lie? Will you side with the Rebellion or the Empire? Join the fight, build your base, recruit and train your army, strategically plan your defenses, and lead your troops to victory on war-torn worlds throughout the galaxy! \r\n\r\nBattle with or against iconic characters like Darth Vader, Luke Skywalker, Han Solo, and Princess Leia, and utilize or destroy units like AT-ATs, Speeder Bikes, Wookiee Warriors, and Stormtroopers. Join millions around the globe to play in this epic combat strategy game. Commander, the fate of the galaxy is in your hands!\r\n\r\nFEATURES\r\n\r\n• CHOOSE to fight for the Rebellion or the Empire\r\n• TRAIN your troops to charge into battle\r\n• BUILD units and vehicles with multiple upgrades\r\n• DEFEND your base against enemy forces\r\n• COMPLETE original story missions and gain additional rewards\r\n• LEVEL UP your heroes, troops, vehicles, and more\r\n• BATTLE on different worlds within the Star Wars™ universe\r\n• TEAM UP WITH FRIENDS and allies to form the ultimate squad\r\nUpgrade your Planetary Command building to scout and relocate your base to new worlds such as Dandoran, Yavin 4, Er’Kit and Hoth to expand your command and strengthen your squad.\r\n\r\nWhat’s new:\r\n*Day and Night Cycles - Now each world’s lighting cycles from day to night with visual updates to your base and every environment in the game!\r\n*Heroic Defense - Build a Scout Tower to defend your base in Heroic Defense Challenges. Twice a day on every planet you can opt in to a defensive battle and earn Supply Crates.\r\n*Edit Mode Improvements - We've improved base management! Utilize a new mode to quickly stash and move buildings in your desired layout.\r\n*Optimizations for improved performance.\r\n\r\nWhat’s in the mods:\r\n\r\nMod V1:\r\nSUPERTURRETS\r\n- 1 Hit Kill for Turrets\r\n- No Damage from Troops\r\n\r\nMod V2:\r\nSUPERTROOPS MOD\r\n- 1 Hit Kill for Troops\r\n- No Damage from Turrets\r\n- Troops will teleport to next target during battle\r\n\r\nNotes: both MOD features applies to you and enemy. This is the reason there are 2 MOD versions, to choose the desired one.\r\nTips:\r\n1) for Defensive missions, I suggest the &quot;ELITETURRETS MOD&quot;\r\n2) for Attack missions, I suggest the &quot;ELITETROOPS MOD&quot;\r\n3) it's usually all about troops/defenses count. It's better to have 50 weak units/turrets than 40 stronger ones if you use these MODs.\r\n\r\nRequires Android OS 4.0 and up also supports both tablets and phones","torrent":{"xt":"urn:btih:a5201fa011dd63d5780e7af188a70d74f28c1bfe","amp;dn":"Star+Wars%26trade%3B%3A+Commander+v3.6.0.6952+%2B+mods","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5201fa011dd63d5780e7af188a70d74f28c1bfe","infoHashBuffer":{"type":"Buffer","data":[165,32,31,160,17,221,99,213,120,14,122,241,136,167,13,116,242,140,27,254]},"announce":[],"urlList":[]}}