{"title":"HTML5 Canvas For Dummies","uid":8684452,"size":39938323,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a5eb5a2f6930424b919377a9a1dc482eae3c00c3&amp;dn=HTML5+Canvas+For+Dummies&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sigor10","files":-1,"time":1373764446,"description":"HTML5 Canvas For Dummies by Don Cowan\n\nDecember 2012 | ISBN: 978-1-118-38535-7 | 384 pages\n\nCreate eye-popping visuals on the fly with HTML5 Canvas\n\nNow part of the HTML5 standard tool, Canvas gives programmers the ability to add images, animation, and sound to mobile and regular websites on the fly, in JavaScript, without needing any third-party tool or player. This practical For Dummies book clearly shows you how to get the most out of Canvas. It presents information in a friendly, non-intimidating way and helps you get started with the Canvas tag, create 2D drawings and images, add video and audio, build a basic game framework, weave spellbinding animation, and more.\n\nIf you want to learn how to use HTML5 Canvas, this easy-to-follow guide is just the ticket.\n\n    Shows web programmers, developers, and designers at beginner and intermediate HTML5 and JavaScript levels how to use the powerful HTML5 Canvas tag\n    Helps you design and add images, animation, sound, and more to mobile and regular websites, without using any third-party tools or players\n    Covers 2D drawings, text, and bitmap images; video and audio; how to build a basic game framework on Canvas; adding animation; and more\n    Includes a JavaScript crash course \n\nGet started using HTML5 Canvas right away with HTML5 Canvas For Dummies.","torrent":{"xt":"urn:btih:a5eb5a2f6930424b919377a9a1dc482eae3c00c3","amp;dn":"HTML5+Canvas+For+Dummies","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5eb5a2f6930424b919377a9a1dc482eae3c00c3","infoHashBuffer":{"type":"Buffer","data":[165,235,90,47,105,48,66,75,145,147,119,169,161,220,72,46,174,60,0,195]},"announce":[],"urlList":[]}}