{"title":"Impulse - [Faces of Evil, #2] - Debra Webb.epub","uid":9268136,"size":266302,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a66015dd0c184cbb0c1b14fa1e4a0336ad900f01&amp;dn=Impulse+-+%5BFaces+of+Evil%2C+%232%5D+-+Debra+Webb.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1385731184,"description":"The Faces of Evil Series: Book 2\n\nHer nightmare isn't over yet . . .\n\nThe Player is a master in the art of torture and murder. No one had ever gotten close to capturing him until Special Agent Jess Harris targeted him with her relentless determination. Jess's actions may have cost her a job with the bureau, but the Player still wants his vengeance and he'll make Jess pay in ways she never imagined. The first victim is Jess's friend-and the killer won't stop there. With each new death Jess becomes more certain that the only way to stop the Player is to give him what he really wants: her.\n\nChief of Police Dan Burnett is determined to give Jess her confidence and her life back. With an offer on the table, a position as deputy chief of a new division, can Jess risk staying in her hometown and putting those around her in more danger? Or will she walk away to protect everyone she loves-including Dan, who just may want her back in his arms? The stakes are high, and a single impulse will determine who survives the Player's final, deadly game . . .\n\n\n\n&quot;Compelling main characters and chilling villains elevate Debra Webb's Faces of Evil series into the realm of high-intensity thrillers that readers won't be able to resist.&quot; -- New York Times bestselling author CJ Lyons\n\n\n\n&quot;Just when you think Debra Webb can't get any better, she does. OBSESSION is her best work yet. This gritty, edge of your seat, white knuckle thriller is peopled with tough, credible characters and a brilliant plot that will keep you guessing until the very end. Move over Jack Reacher - Jess Harris is comin' to town.&quot; -- Cindy Gerard, New York Times best-selling author, award winning author of the Black Ops, Inc. series\n\n\n\n&quot;Debra Webb's name says it all...&quot;-- Karen Rose\n","torrent":{"xt":"urn:btih:a66015dd0c184cbb0c1b14fa1e4a0336ad900f01","amp;dn":"Impulse+-+%5BFaces+of+Evil%2C+%232%5D+-+Debra+Webb.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a66015dd0c184cbb0c1b14fa1e4a0336ad900f01","infoHashBuffer":{"type":"Buffer","data":[166,96,21,221,12,24,76,187,12,27,20,250,30,74,3,54,173,144,15,1]},"announce":[],"urlList":[]}}