{"title":"Milosevic Trial - Corruption Of International Justice","uid":6499746,"size":733902848,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a812d676ca28f7a9e1dd6f7dadb4d4822440064f&amp;dn=Milosevic+Trial+-+Corruption+Of+International+Justice&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"payone","files":1,"time":1309205086,"description":"The media demonized the Serbs and Milosevic and said they were committing genocide. It turns out to be false. No genocide was committed, there were no concentration camps, and the prosecutions couldn`t prove anything. Milosevic died under suspicious circumstances while still imprisoned. Something fishy is going on here. This documentary shows that Slobodan Milosevic was falsely accused.\n\nThe witnesses of the so-called genocide were payed for by the tribinal if they told horrible stories about Milosevic and the Serbs. Many of them were KLA war criminals, who in return for their stories got a special permit which made them unprosecutable, what ever they had done.\n\nIn August 1992, millions of people were shocked to see photographs of a supposed Bosnian Serb death camp. But the death camp story was a lie. The ITN crew had filmed from inside a fenced-in storage area. By shooting through the fence ITN created footage that gave the impression that the Bosnian men were imprisoned. With a little editing, this footage was turned into pictures that gave the impression of a death camp - media manipulation (media's falsities and manipulations with fabricated images).\n\nP.S.\nUnfortunately I am missing a minute or two at the end :(","torrent":{"xt":"urn:btih:a812d676ca28f7a9e1dd6f7dadb4d4822440064f","amp;dn":"Milosevic+Trial+-+Corruption+Of+International+Justice","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a812d676ca28f7a9e1dd6f7dadb4d4822440064f","infoHashBuffer":{"type":"Buffer","data":[168,18,214,118,202,40,247,169,225,221,111,125,173,180,212,130,36,64,6,79]},"announce":[],"urlList":[]}}