{"title":"Belief And Betrayal [English][PCDVD]","uid":4334757,"size":1943785562,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a8454963486c58b7d09dbc996e48bf6ece6ad494&amp;dn=Belief+And+Betrayal+%5BEnglish%5D%5BPCDVD%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"alfern","files":41,"time":1218241680,"description":"Product Description\n\nBelief &amp; Betrayal is a compelling point &amp; click adventure game that takes players deep into a secretive and mysterious world of faith and superstition; power and intrigue; truth and conspiracy. Set in modern times, you will play as journalist Jonathan Danter, where you discover that the untimely death of your uncle, who was murdered ten years earlier, is somehow part of a greater ancient mystery that could destroy humanity itself. Filled with controversy, baffling plot twists, conspiracy theories, and incredible graphics, players must uncover the mystery that reaches back through history from 1194 A.D. to the time Judas received 30 pieces of silver to betray Christ. Embark upon an awe-inspiring investigation to uncover the ghastly secrets behind your uncle&amp;#039;s murder, travel to exotic locations throughout Europe including: London, Venice, Rome, and the Vatican. Uncover skeletons hidden deep within the closets of some of the most powerful leaders around the world, and unveil the menacing truth that will shake the very foundation of the Church.\n\nThere are many myths and legends from the early years of Christianity. Belief&amp;Betrayal combines the thriller motives of church conspiracies and biblical secrets to form a beautiful, classic 3rd person point&amp;click adventure game with innovative gameplay elements. Ancient cathedrals with secret catacombs, gloomy libraries that stock books that should have been destroyed in the inquisition, mysterious monasteries in deep and dark woods - these are the elements used to construct this first-class adventure game.\nBelief&amp;Betrayal revolves around true thriller themes: belief and superstition, power and corruption, truth and conspiracy. Jonathan Danter is a journalist living and working in New York City. At his uncle&amp;#039;s funeral he stumbles upon a number of puzzling inconsistencies - there are things afoot that seem to point to something much larger going on. In London, he begins to research the death of his uncle and finds more and more mysterious incidents that all point towards the same source: the Christian Church. Belief&amp;Betrayal takes Jon Danter and the player all over Europe. From London toFrance, from Venice to the Vatican: Jon is drawn ever deeper into an apparent conspiracy that is hiding unbelievable details on the inner workings of the church. You are Jonathan and now you are involved in a web of intrigue and danger that stems back from many centuries. Will you live to discover the truth?","torrent":{"xt":"urn:btih:a8454963486c58b7d09dbc996e48bf6ece6ad494","amp;dn":"Belief+And+Betrayal+%5BEnglish%5D%5BPCDVD%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8454963486c58b7d09dbc996e48bf6ece6ad494","infoHashBuffer":{"type":"Buffer","data":[168,69,73,99,72,108,88,183,208,157,188,153,110,72,191,110,206,106,212,148]},"announce":[],"urlList":[]}}