{"title":"Sally Ride: America's First Woman in Space -Lynn Sherr Audiobook","uid":10425258,"size":388596218,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a85bb42c4728d61ecbb2b8733e7b57f2f4bb0e67&amp;dn=Sally+Ride%3A+America%27s+First+Woman+in+Space+-Lynn+Sherr+Audiobook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Squiddy82","files":-1,"time":1403692897,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Smart AudioBook Player or Listen Audiobook Player.\n\niTunes users - Add this to your iTunes collection, and change &quot;Media Kind&quot; to &quot;Audiobook.&quot; Right-click the track or album, and select &quot;Get Info&quot; from the context menu. You will find &quot;Media Kind&quot; under &quot;Options.&quot; This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nSally Ride: America's First Woman in Space\n\nWritten by: Lynn Sherr\nNarrated by: Pam Ward\nLength: 13 hrs and 26 mins\nFormat: Unabridged\nRelease Date:06-03-14\nProgram Type: Audiobook\n\nSally Ride made history as the first American woman in space. A member of the first astronaut class to include women, NASA chose her for the seventh shuttle mission, inspiring several generations of women. After a second flight, Ride served on the panels investigating the Challenger explosion and the Columbia disintegration that killed all aboard. In both instances, she faulted NASA's rush to meet mission deadlines and its organizational failures. She also cofounded a company promoting science and education for children, especially girls.\n\nIn Sally Ride: America's First Woman in Space, Lynn Sherr writes about Ride's scrupulously guarded personal life, with exclusive access to Ride's partner, her former husband, her family, and countless friends and colleagues. This is a rich biography of a fascinating woman whose life intersected with revolutionary social and scientific changes in America. Sherr's revealing portrait is warm and admiring but unsparing. It makes this extraordinarily talented and bold woman - an inspiration to millions - come alive.","torrent":{"xt":"urn:btih:a85bb42c4728d61ecbb2b8733e7b57f2f4bb0e67","amp;dn":"Sally+Ride%3A+America%27s+First+Woman+in+Space+-Lynn+Sherr+Audiobook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a85bb42c4728d61ecbb2b8733e7b57f2f4bb0e67","infoHashBuffer":{"type":"Buffer","data":[168,91,180,44,71,40,214,30,203,178,184,115,62,123,87,242,244,187,14,103]},"announce":[],"urlList":[]}}