{"title":"Steve Lawler - Courses For Horses 2007 [RENX052] [Progressive / ","uid":3918245,"size":44328771,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a9464753a8e88fdcdaca89e03a4a19f9b2ad66bd&amp;dn=Steve+Lawler+-+Courses+For+Horses+2007+%5BRENX052%5D+%5BProgressive+%2F+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"themagicke","files":5,"time":1196619134,"description":"Steve Lawler - Courses For Horses 2007 [RENX052] [Progressive / Tech House]\n\n &lt;a href=&quot;\nhttp://www.discogs.com/release/1113579&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.discogs.com/release/1113579&lt;/a&gt;\n\nLabel:\tRenaissance\nCatalog#:\tRENX052DIG\nFormat:\tFile, MP3\nCountry:\tUK\nReleased:\t20 Oct 2007\nGenre:\tElectronic\nStyle:\tTech House\n\n\nTracklisting:\n\n1 \t  \tCourses For Horses (Original Mix) (8:17)\n2 \t  \tCourses For Horses (GTR Mix) (7:31)\n3 \t  \tCourses For Horses (GTR Reprise) (2:39)\n\n\n42.2MB\n\n320KBps Digital Release.\n\n\nBoth the Original and the Remix are simply outstanding productions in this field.  I&amp;#039;ve been spending an awful lot of time with this little gem since release.  Please see review below.\n\n\nEnjoy and please seed.\n\n\n\nthemagicke\n\n\n\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/themagicke&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/themagicke&lt;/a&gt;\n      &lt;a href=&quot;\nhttp://www.darksiderg.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.darksiderg.com/&lt;/a&gt;\n\n\n\n\n&quot; Techno mastermind Steve Lawler is about to release his latest compilation entitled Viva London, and to give us a peak of what&amp;#039;s around the corner, he now presents the first out of two tracks exclusively recorded for this album. With the second track Violet set for release later this year, Courses For Horses gives us a first impression of Steve&amp;#039;s latest studio frenzy.\n\nNext to the Original Mix, this release comes with two additional tracks: The GTR Mix and The GTR Reprise. First one up is the Original Mix, kicking off with a complex, very rhythmic introduction consisting of various layers of percussion and minima-esque effects. What follows is a full three-minute drummy stampede that finds itself on the border of minimal and tech-house. With a tempo of about 120 BPM, the track takes it time to build up to an amazing climax in which all hell breaks loose. The percussion basis is all of a sudden supported by a totally unexpected, but awesome buzzing synth that keeps on evolving throughout the track. This adds a certain electro vibe to the tune, and despite the fact that there&amp;#039;s not too much variation in the sequence, the overall simply rocks like Led Zeppelin on acid! I dare saying that this might become one of the most sought-after tracks of coming winter!\n\n&quot; I dare saying that this might become one of the most sought-after tracks of coming winter! &quot;\n\nThe GTR mix hits it with an even more complex rhythm loop consisting of lots and lots of clikcs, rattles, echoes and soft drums, making the track sound more or less alike the original mix: a solid mix of tech-house and minimal. The well cool synth from the original is maintained and is introduced during another awesome break, although this remix is, overall speaking, aiming towards a darker and deeper mood. In the end, the track seems to make a switch towards staright authentic techno by using cymbals and additional shakers, but by that time, this track has already done what it was created for: creating maximum mayhem!\n\nLast one up is the GTR reprise, a nifty little DJ-tool which lacks all the original elements except for the delayed drums, soft shakers and some bubble-noise effects. In the hands of a skilled jock, this one&amp;#039;s a shiny pearl with sharp edges!\n\nThis is serious business, ladies and gentlemen. Courses For Horses is a sizzling hot piece of craftmanship, by which Steve proves that he is still large and in charge. Ace production, ace sounds, Devil&amp;#039;s music! &quot;\n\n","torrent":{"xt":"urn:btih:a9464753a8e88fdcdaca89e03a4a19f9b2ad66bd","amp;dn":"Steve+Lawler+-+Courses+For+Horses+2007+%5BRENX052%5D+%5BProgressive+%2F+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9464753a8e88fdcdaca89e03a4a19f9b2ad66bd","infoHashBuffer":{"type":"Buffer","data":[169,70,71,83,168,232,143,220,218,202,137,224,58,74,25,249,178,173,102,189]},"announce":[],"urlList":[]}}