{"title":"EXPLOITED COLLEGE GIRLS - Savannah - Hard Anal Fuck SD","uid":9266601,"size":748720617,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:a9bfa4e144205e14d264986bdc25b86973a8bffb&amp;dn=EXPLOITED+COLLEGE+GIRLS+-+Savannah+-+Hard+Anal+Fuck+SD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"beta2008x","files":1,"time":1385710180,"description":" &lt;a href=&quot; http://imgboxxx.com/viewer.php?file=jwz46_shb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://imgboxxx.com/viewer.php?file=jwz46_shb.jpg&lt;/a&gt;\n  &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=68rz4_ecg_savannah_s.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=68rz4_ecg_savannah_s.jpg&lt;/a&gt;\n\nSavannah is one of the most beautiful girls I've shot this year and between her multiple orgasms, love of anal sex and the huge facial I give her, this update is one of the hottest in recent memory. Her performance and our chemistry is so great I did my best to capture this update on as many cameras as possible, so be sure to watch carefully you get to see the best action from multiple angles.\n\nThis chestnut haired beauty comes to me from ASU. I swear there must be something in their application process that draws these girls. I'm imagining that in addition to asking for a GPA, their scholarship app asks, &quot;On a scale of 1-10 how much of an attention whore are you?&quot; and only girls who check 8 or higher get accepted. When Savannah explains that she wants to try a DP (but only in public!) I have no doubt she's an 11. Her interview is chock full of this kind of desperate for attention type stuff, but that means the cameras are a turn on for her, so it's win-win.\n\nAs we talk she's trying on clothes, and every time she turns around and shows off her ass in her tiny booty shorts, my boner gets 10% stiffer. Of course every time she laughs her nails-on-a-chalkboard laugh, my boner shrinks by 10%. Fortunately, I'm not that funny so it's tolerable. After getting her in a nice outfit and made up, I notice she isn't wearing a bra, so it's def. time to get this party started. I grab a vibrator and go to work and in no time she's asking for anal. Since this baby has an attachment, I'm able to bring her to a DP orgasm with it.\n\nAfter getting her off and knowing that anal is on the table, I'm almost impatient as she's sucking my cock. But her skills are beyond and the way she worships my cock with her tongue and lips is just...wow. I got a couple of good angles and you can see that this girl loves giving head. When she gets me hard, I have her hop up on the bed and I give her the cock like she needs it for medical reasons. It doesn't take too long to get her off and to get me thinking about her perfecto butthole. A little lube and a little patience and she takes my whole cock in her ass. It's fucking heaven. Literally, the heaven of fucking.\n\nWhen she can't take anymore, I go back to regular P in V and get her off 2-3 more times until I'm ready to bust. She assumes the position and I give her a full blast facial.\n\nThis is why you joined ECG, fellows. A beautiful college nympho with a nearly perfect body, getting fucked to one real orgasm after another, getting her perfect ass stuffed with cock and then taking a half gallon facial across her perfect smile. Happy Thanksgiving.\n\t\t","torrent":{"xt":"urn:btih:a9bfa4e144205e14d264986bdc25b86973a8bffb","amp;dn":"EXPLOITED+COLLEGE+GIRLS+-+Savannah+-+Hard+Anal+Fuck+SD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9bfa4e144205e14d264986bdc25b86973a8bffb","infoHashBuffer":{"type":"Buffer","data":[169,191,164,225,68,32,94,20,210,100,152,107,220,37,184,105,115,168,191,251]},"announce":[],"urlList":[]}}