{"title":"Coast to Coast am July 05, 2013 - Psychic Awareness &amp; Shaman","uid":8672938,"size":56257323,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:aa9d02113f3be05cc4df553015ae4627492a792d&amp;dn=Coast+to+Coast+am+July+05%2C+2013+-+Psychic+Awareness+%26amp%3B+Shaman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pyramid91","files":5,"time":1373531811,"description":"MP3 version wins!\nCourtesy of Coast to Coast Am's wonderful  &quot;Coast Insider&quot; service!\nShow description:\n\nDate:\n07-05-13\nHost:\nGeorge Noory\nGuests:\nGwilda  Wiyaka,                   Open  Lines\nGeorge Noory was joined by shamanism expert Gwilda Wiyaka, who talked about how galactic energy is impacting psychic awareness and abilities. According to Wiyaka, there are four major factors that enhance psychic or shamanic ability: genetic predisposition, a traumatic childhood event, near death experience and head injury or some other initiatory illness. Any one of these can shatter a person's programming into the system, the common reality humans share, and open them to other ways of being in the world, she said. The current system, identified by Wiyaka as the Fourth World, supports exploitation, parasitic existence and a dog-eat-dog mentality.  \nHistorically, psychic ability has been more prevalent at some times than others, she continued. In the present period, the Sun is emanating an increased frequency into space which is affecting the Earth, Wiyaka reported, noting the observation by a Russian scientist of a surge in plasma in the leading edge of the Sun's magnetic field. Earth's magnetic field is interacting with the Sun's shifting magnetic field and causing the planet's frequency to shift, she revealed. Wiyaka explained how our toroidal fields are also interacting with these shifts yet many are not shifting to a higher psychic awareness because they have lost contact with Earth. &quot;The shifting of the frequency on the Earth is resulting from the plasma formation making more expansive reality available, but our programming is working against that and trying to hold the old frequency,&quot; she said. \nWiyaka identified shamanism as an ancient practice dating back over 50,000 years that is at the root of all cultures. A shaman practitioner's power comes from the planet and cooperates with the laws of nature, she remarked. In order for one to remain in the shamanic realm and avoid sorcery Wiyaka offered several guidelines, including never taking energy from where it belongs, never putting energy where it does not belong, never working without permission and always doing no harm. To have true shamanic power one has to process out the places that have been impinged by Fourth World programming, she instructed. Wiyaka also shared her most empowering method called the Shamanic Journey Trance, which she said allows her alpha brain waves to drop to 7.8 Hz, the frequency of the surface of Earth.  \nThe next 90 minutes was devoted to Open Lines. The final half hour featured a replay of George's 12/18/12 interview with Walter Parazaider, founding member and saxophone player for the rock group Chicago, and music expert R. Gary Patterson.\nWebsite(s):\n gwildawiyaka.com\nBook(s):\n So, We're Still Here. Now What? \n Sanctuary: The Shamanic Art of Sacred Space\n In Touch With Spirit\n","torrent":{"xt":"urn:btih:aa9d02113f3be05cc4df553015ae4627492a792d","amp;dn":"Coast+to+Coast+am+July+05%2C+2013+-+Psychic+Awareness+%26amp%3B+Shaman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa9d02113f3be05cc4df553015ae4627492a792d","infoHashBuffer":{"type":"Buffer","data":[170,157,2,17,63,59,224,92,196,223,85,48,21,174,70,39,73,42,121,45]},"announce":[],"urlList":[]}}