{"title":"Service Science Concepts Technology Management","uid":9768868,"size":1063562,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aafdbdbcb80166cbf12556a3754fe87afc6b76c6&amp;dn=Service+Science+Concepts+Technology+Management&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":-1,"time":1394924386,"description":"%If you want to have the competitive edge in your personal and professional life, then it's imperative to understand service science. Service in itself can be described as a client/provider interaction that creates and captures value, while a service system is defined as a structure of people and technology that adapts to the changing value of knowledge in the system. Combined, these two concepts form service science.\n\nHarry Katzan, Jr., director of the Service Science Institute of Hilton Head, takes a closer look at this newly emerging scientific field for academics and practitioners alike in Service Science. With an easy-to-understand format, Harry Katzan, Jr. offers a comprehensive introduction to service science for people in business, education, and government.\n\nUseful as a textbook and a professional guide, this innovative study contains eight chapters that each end with a comprehensive summary, a list of key words, questions, and additional selected readings. In addition, Harry Katzan, Jr. provides concrete examples and in-depth discussion on such timely topics as:\n\n\nService concepts\nService systems\nInformation services\nService management\nService business\nService technology\n\nService science has been touted as the up-and-coming discipline for the twenty-first century. Learn more about this exciting field and change how you think and perceive your world with Service Science!","torrent":{"xt":"urn:btih:aafdbdbcb80166cbf12556a3754fe87afc6b76c6","amp;dn":"Service+Science+Concepts+Technology+Management","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aafdbdbcb80166cbf12556a3754fe87afc6b76c6","infoHashBuffer":{"type":"Buffer","data":[170,253,189,188,184,1,102,203,241,37,86,163,117,79,232,122,252,107,118,198]},"announce":[],"urlList":[]}}