{"title":"EnigmaT Set Rips { Cuts } - May 12th, 2014","uid":10131104,"size":775046749,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ab7f881343b70d57ba1195ca12e3905a24050fed&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+May+12th%2C+2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EnigmaT","files":92,"time":1399884453,"description":"A.T.P - Driftations (Ahnhken Remix) (Cut From MORPH Set)-enTc\nAbove &amp; Beyond feat. Alex Vargas - Sticky Fingers (Lane 8 Remix) (ABGT 078 Rip)-enTc\nAbstract Vision &amp; Maingain Fabian - Freedom (Hazem Beltagui Remix) (ASOT 662 Rip)-enTc\nAeden - Clair Obscur (Akku Remix) (Cut From Tero A Set)-enTc\nAfrojack - Boom (Cut From Hardwell Set)-enTc\nAftershock - ID (Cut From Hardwell Set)-enTc\nAirdraw &amp; Jo.E Feat. Noel Ruarte - A Touch Of Mercy (PROFF Proffgressive Remix) (ASOT 662 Rip)-enTc\nAlessandra Roncone - Secret Influence (Cosmic Heaven Remix) (Cut From El Jay Set)-enTc\nAlessandra Roncone - Secret Influence (Cosmic Heaven Remix) (Cut From Sty Set)-enTc\nAlessandra Roncone - Secret Influence (Original Mix) (Cut From Niki Set)-enTc\nAlex Leads - Thousand Voices (Original Mix) (Cut From Concept Set)-enTc\nAndy Duguid feat. Jaren - History (ASOT 662 Rip)-enTc\nAndy Tau - Into the Void (GDJB Rip)-enTc\nAnske - Dreamcatcher (Cut From Pledger Set)-enTc\nArmin van Buuren presents Gaia - 4 Elements (Paul Webster Remix) (Set Rip)-enTc\nArmin van Buuren vs. Rank 1 feat. Kush - This World Is Watching Me (Willem de Roo Remix) (ASOT 662 Rip)-enTc\nArtsever - Voices In My Head (Original Mix) (Cut From Echelon Set)-enTc\nAshmawi - Auralize (Original Mix) (Cut From Romel Set)-enTc\nAstraeus - When We Connect (Original Mix) (Cut From GO Set)-enTc\nBlufield - Huddlestone Arch (Cut From Pearson Set)-enTc\nCiro Visone - Running On The Soul (Original Mix) (Cut From Tero A Set)-enTc\nColdplay - Midnight (Max Trumpetz Bootleg Remix) (Cut From Soulplay Set)-enTc\nCorduroy Mavericks - Open Your Eyes (Original Mix) (Cut From Shah Set)-enTc\nCosmic Gate &amp; KhoMha - Tormenta (GDJB Rip)-enTc\nDanny Howard &amp; Futuristic Polar Bears - Vargo (Cut From Hardwell Set)-enTc\nDarin Epsilon feat. Ghost WARS - All That Could've Been (Andre Sobota Remix) (ABGT 078 Rip)-enTc\nDennis Sheperd - We Are Who We Are (Original Mix) (Cut From Sheperd Set)-enTc\nDuke Dumont feat. Jax Jones - I Got U (W&amp;W Remix) (Cut From Concept Set)-enTc\nEllie Goulding - Starry Eyes (Cut From Tydi Set)-enTc\nFAUL &amp; Wad Ad vs. Pnau - Changes (Marlon Hoffstadt &amp; HRRSN Remix) (Cut From Tiesto Set)-enTc\nFTampa - 5 Days (Cut From Hardwell Set)-enTc\nFunkagenda - One Day at a Time (Instrumental Mix) (GDJB Rip)-enTc\nGood &amp; Bower - Serendipity (ASOT 662 Rip)-enTc\nGood &amp; Bower - Serendipity (Original Mix) (Cut From Romel Set)-enTc\nHristian Hristov - Angelic Riff (Original Mix) (Cut From Romel Set)-enTc\nHristian Hristov - Angelic Riff (Original Mix) (Cut From Sty Set)-enTc\nIbranovski - Filthy (Cut From Hardwell Set)-enTc\nImogen Heap - Headlock (ID - Remix) (Cut From Tydi Set)-enTc\nJase Thirlwall - Airborne (Cut From Thirlwell Set)-enTc\nJohan Vilborg feat. Johnny Norberg - Another Day (ABGT 078 Rip)-enTc\nJulian Wess - Switch (Original Mix) (Cut From Shah Set)-enTc\nJurgen Vries feat. Bo Bruce - Satellites (Full Vox) (Cut From Shah Set)-enTc\nKiesza - Hideaway (JK Club Mix) (Cut From Tiesto Set)-enTc\nKill The Buzz - Go There (Cut From Hardwell Set)-enTc\nKinetica - Systematic Parts (Original Mix) (Cut From El Jay Set)-enTc\nLazy Rich &amp; Hot Mouth - Flash (Club Mix) (Cut From Hardwell Set)-enTc\nLele Troniq &amp; Khyrs Kloudz - Epic Win (Mateusz Remix) (Cut From MORPH Set)-enTc\nLiquid Vision - Flare (Steve Morley Remix) (Cut From Raneem Set)-enTc\nMaison &amp; Dragen - Tritonus (Original Mix) (Cut From Echelon Set)-enTc\nMaison &amp; Dragen Feat. Miella - Already Gone (ASOT 662 Rip)-enTc\nMarcus Schossow &amp; Arston - The Universe (Cut From Hardwell Set)-enTc\nMarcus White &amp; Dave Kent - Strawberries &amp; Cream (Original Mix) (-FiXeD- Cut From Shah Set)-enTc\nMark L - ID (Cut From Niki Set)-enTc\nMarkus Schulz presents Dakota - CLXXV (GDJB Rip)-enTc\nMatt Rowan - Genteel (Original Mix) (Cut From Shah Set)-enTc\nMedad - Protons (Original Mix) (Cut From 9axis Set)-enTc\nMekka - Hack The Gibson (Cut From Raneem Set)-enTc\nMenno de Jong, Stereojackers v Mark Loverush, Shelley Harland - Connected (Tom Cloud Remix) (Cut From GO Set)-enTc\nMeridian - All In (GDJB Rip)-enTc\nMontends - Waiting For The Sun (ABGT 078 Rip)-enTc\nMy Digital Enemy - Desire Life (Cut From Hardwell Set)-enTc\nNarayana - Sawtooth (-SHORT- Cut From GO Set)-enTc\nNew World Sound - Pineapple (Cut From Hardwell Set)-enTc\nNezzo &amp; Summer School - Choose Your Weapon (Cut From Tiesto Set)-enTc\nParkZ - Moonrise (Jhon Fx Remix) (Cut From Tero A Set)-enTc\nPassenger 75 &amp; Cat Martin - No More Road To Run (ASOT 662 Rip)-enTc\nPaul Gibson - Firefly (Original Mix) (Cut From Raneem Set)-enTc\nPaul Oakenfold vs. Coco Star - Toca's Miracle (Eshericks Remix) (Cut From Sheperd Set)-enTc\nPaul Webster - Corruption (Liam Wilson Remix) (Cut From Sherry Set)-enTc\nPhuture Sound feat. Tavy - Beat Of Your Heart (Suncatcher Dub Mix) (ASOT 662 Rip)-enTc\nPhysical Phase &amp; Veera - Rock My Body (Dub Mix) (Cut From 9axis Set)-enTc\nPM AttitudE - The Prophet (Original Mix) (Cut From Shah Set)-enTc\nPtinium - The Dark Prophet (Changes Remix) (Cut From El Jay Set)-enTc\nRaneem - Katana (Wrechiski Remix) (Cut From Raneem Set)-enTc\nRex Mundi - Static Room (GDJB Rip)-enTc\nRoger Shah presents Sunlounger featuring Chase - Surrender (Pierre Pienaar Remix) (Cut From GO Set)-enTc\nScott Lowe &amp; Liam Nicklin - Ignosco (Harmonic Rush Remix) (ASOT 662 Rip)-enTc\nSharam - Tripi (Cut From Tiesto Set)-enTc\nSophie Watkins - Elephant (Angy Kore Remix) (Cut From Raneem Set)-enTc\nSteve Morley - Reincarnations (Estigma Tech Take) (Cut From Asprey Set)-enTc\nSteve Morley - Reincarnations (Nu Gen Update feat. Martina Kay) (Cut From Allen&amp;Envy Set)-enTc\nSubtap - Ice Wave (Cut From Raneem Set)-enTc\nSun Gates feat. DJ Global Byte - Videodrome (Cut From Pledger Set)-enTc\nTempo Giusto - V12 (Instrumental Mix) (GDJB Rip)-enTc\nThe Bastille - Pompeii (Brian Laruso's After The Rain Comes The Sun Edit) (Cut From Shah Set)-enTc\nTiesto - Lethal Industry (7even or Eleve11 NY Remix) (Cut From Concept Set)-enTc\nTimo Diablo &amp; Decaville - Strobe (2014 Remix &amp; Mark Pledger Rework) (Cut From Pledger Set)-enTc\nTom Noize and Sean Darin feat. Matt Alber - Call In The Air (Digital Self and Tek-Tonic Remix) (Cut From GO Set)-enTc\nTonerush - Dragon Tooth (Cut From Pledger Set)-enTc\nVitaly Otto - Reminiscence (E.T Project Remix) (Cut From Raneem Set)-enTc\nWill Atkinson &amp; Paul Webster - Watch It Burn (ASOT 662 Rip)-enTc\nWillem de Roo - Rush (Original Mix) (Cut From Pledger Set)-enTc\n","torrent":{"xt":"urn:btih:ab7f881343b70d57ba1195ca12e3905a24050fed","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+May+12th%2C+2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab7f881343b70d57ba1195ca12e3905a24050fed","infoHashBuffer":{"type":"Buffer","data":[171,127,136,19,67,183,13,87,186,17,149,202,18,227,144,90,36,5,15,237]},"announce":[],"urlList":[]}}