{"title":"Hells.Kitchen.S04.HDTV.Xvid","uid":4287393,"size":5497631574,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:abcc8f7ddc88f9b0cef328b2c718c9bac0a7629f&amp;dn=Hells.Kitchen.S04.HDTV.Xvid&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"circlensess","files":15,"time":1215776523,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0437005/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0437005/&lt;/a&gt;\n\nGenre: Reality\nYear: 2008\nCountry: USA\nRuntime: 40-45\nMain Cast: Gordon Ramsay, Scott Liebfried, Jean Philippe Susilovic, Gloria Felix, Jason Thompson, Mary Ann Salcedo\nContestants: Jen Gavin, Jason Underwood, Christina Machamer, Craig Schneider, Dominic, Shayna Zodoka, Sharon Stewart, Matt Sigel, Vanessa Gunnell, Corey Earling, Rosann Fama, Louross Edralin, Louis Petrozza, Bobby Anderson, Ben Caylor\n\n.: Plot :.\nWorld-renowned chef GORDON RAMSAY is back for a fourth course of the sizzling unscripted series HELL?S KITCHEN. Wannabe restaurateurs slice and dice their way through each episode, vying for Ramsay?s attention in hopes of winning a life-changing culinary prize.\n\nThe ?steaks? are higher than ever -- the winner of the competition will earn a coveted senior chef position at Ramsay?s new restaurant, Gordon Ramsay at the London West Hollywood, which is scheduled to open in summer 2008.\n\nThe kitchen gets hotter each week as Ramsay puts on the pressure, demanding absolute perfection. Frazzled chefs try to slice and dice their way to the top, as they vie for Chef Ramsay?s approval. The competition is more intense than ever. With more contestants and more dinner services, Gordon?s sharp-tongue and flared-temper is sure to cause some major meltdowns in the kitchen.\n\nSeason Three of HELL?S KITCHEN, in which Rock Harper won the coveted title of Head Chef of a new fine Italian restaurant at the Green Valley Ranch Resort and Spa in Las Vegas, outpaced the previous season in ratings.\n\nHELL?S KITCHEN is produced by Granada America and A. Smith &amp; Co. Arthur Smith and Kent Weed serve as executive producers.","torrent":{"xt":"urn:btih:abcc8f7ddc88f9b0cef328b2c718c9bac0a7629f","amp;dn":"Hells.Kitchen.S04.HDTV.Xvid","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"abcc8f7ddc88f9b0cef328b2c718c9bac0a7629f","infoHashBuffer":{"type":"Buffer","data":[171,204,143,125,220,136,249,176,206,243,40,178,199,24,201,186,192,167,98,159]},"announce":[],"urlList":[]}}