{"title":"Finnish Summer Houses (Architecture Art Ebook).pdf","uid":13788584,"size":21779942,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ac3978d68ed0f1e6ca0aee028b137b8eb2d0309c&amp;dn=Finnish+Summer+Houses+%28Architecture+Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":1,"time":1457382439,"description":"Jari Jetsonen and Sirkkaliisa Jetsonen, &quot;Finnish Summer Houses&quot; \r\nEnglish | ISBN: 1568987528 | 2008 | 192 pages | PDF | 21 MB\r\n\r\nSummer is when Finland is at its spellbinding best. Emerging from a seven-month long winter, Finns head outdoors to savor the magical light of the all-too-brief Scandinavian summer. Cityscapes give way to pristine lakes, endless forests, and idyllic seaside vistas. The Finnish summer house offers a unique opportunity for their owners to relax, get back intouch with nature, and enjoy outdoor activities such as boating, swimming, and hiking. Not surprisingly, the architecture of the Finnish summer house occupies an almost mythic, even mystical, place in the hearts of their inhabitants as well as their architects. Indeed, many Finnish architects regard the design of their own summer residence or weekend studio as one of their most important works. For them, the summer house is not only a place to spend leisure time, but also a chance to study specific technical details and experiment with new spatial concepts.Finnish Summer Houses presents in detail twenty villas, cottages, and cabins by architects such as Eliel Saarinen, Oiva Kallio, Alvar Aalto, and Juhani Pallasmaa, among many others. Authors Jari and Sirkkaliisa Jetsonen use contemporary photographs, archival images, drawings, and plans to illustrate the diversity found in the designs of Finnish summer residences. From Lars Sonck's Lasses Villa (1895), with its traditional farmhouse elements, and Alvar Aalto's Muuratsalo Experimental House (195254) to Erkki Kairamo's sparse Villa Aulikki (19952003), which seems to grow out of its landscape, the works in this book are of a highly personal nature; indeed, most of the summer houses are still used by the architect or the families of their children. The very best examples of these fantastic summer homes are collected here, making Finnish Summer Houses an inspiration for anyone dreaming about a summer home of their own","torrent":{"xt":"urn:btih:ac3978d68ed0f1e6ca0aee028b137b8eb2d0309c","amp;dn":"Finnish+Summer+Houses+%28Architecture+Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac3978d68ed0f1e6ca0aee028b137b8eb2d0309c","infoHashBuffer":{"type":"Buffer","data":[172,57,120,214,142,208,241,230,202,10,238,2,139,19,123,142,178,208,48,156]},"announce":[],"urlList":[]}}