{"title":"Others - Christine Warren","uid":8336803,"size":6651449901,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ac46f59c04d9d3cb8df0ea1c5abc64fad1143024&amp;dn=Others+-+Christine+Warren&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"funfactory","files":16,"time":1365003152,"description":"Written by Christine Warren \nFormat: M4B\n\nNot a Full Series Missing a Couple\n\nIt all started with five friends who decided to help each other get a fantasy romance hook-up and resulted in 6 sexy stories (mostly short ebooks) in the Fixed series published by Ellora's Cave set in a world of vampires, shapeshifters and fae. The series was picked up by St Martin's and became 'the Others' which was set after the Fixed series and drove all of us new fans 'mad', because it was clear that the reoccurring side characters had their own stories. And pretty quickly the Fixed ebooks became unavailable, so said fans were left to suffer with no hope of curing their insanity, until St Martin's finally managed to get the rights to the earlier books. Warren is slowly rewritting and expanding these earlier books and finally giving a fans a chance to find out what they'd missed. These rewrites are slow in coming though, since Warren is alternating the releases of reworked books with releases of new ones, so that her old fans will still have something new from time to time.\n\nSince this mix of old and new means that some of the newer releases fall earlier in the combined Fixed/Others timeline, here is the series in 'series time' order with both the old and new title names.\n\nFantasy Fix (original)/One Bite with a Stranger - Misha and Reggie\nFur Factor (orig)/Big Bad Wolf - Graham and Missy\nFaer Fetched (orig)/Prince Charming Doesn't Live Here - Danice and Mac\nBlack Magic Woman -Danice's sister Daphanie and Asher\nFighting Faer/Not Your Ordinary Faerie Tale - Corinne and Luc\nOn the Prowl - Saskia and Nic\nFur For All(orig)/Drive Me Wild -Rafe and Tess \nTBA\nFur Play(orig) - Logan and Honor\nWolf at the Door -Cassidy and Quinn\nshort in No Rest for the Witches - Cassidy's cousin Randy\nShe's No Faerie Princess - Tobias and Fiona\nThe Demon You Know - Abby and Rule\nHowl at the Moon - Noah and Samantha\nWalk on the Wildside (not connected to fixed)\nYou're So Vein - Ava and Vladmir\nBorn to be Wild (not connected to fixed)","torrent":{"xt":"urn:btih:ac46f59c04d9d3cb8df0ea1c5abc64fad1143024","amp;dn":"Others+-+Christine+Warren","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac46f59c04d9d3cb8df0ea1c5abc64fad1143024","infoHashBuffer":{"type":"Buffer","data":[172,70,245,156,4,217,211,203,141,240,234,28,90,188,100,250,209,20,48,36]},"announce":[],"urlList":[]}}