{"title":"The Reformation: A History - Patrick Collinson  (Unabridged)","uid":4889762,"size":367200164,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:adc9fdad4bd655759dc2fa0d5d6943b394d821a8&amp;dn=The+Reformation%3A+A+History+-+Patrick+Collinson++%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eddie1969","files":11,"time":1241911242,"description":"Audio Books : Misc. Educational : MP3/Variable : English\n \n\n&quot;No revolution however drastic has ever involved a total repudiation of what came before it.&quot;\n\nThe religious reformations of the sixteenth century were the crucible of modern Western civilization, profoundly reshaping the identity of Europe's emerging nation-states. In The Reformation, one of the preeminent historians of the period, Patrick Collinson, offers a concise yet thorough overview of the drastic ecumenical revolution of the late medieval and Renaissance eras. In looking at the sum effect of such disparate elements as the humanist philosophy of Desiderius Erasmus and the impact on civilization of movable-type printing and &quot;vulgate&quot; scriptures, or in defining the differences between the evangelical (Lutheran) and reformed (Calvinist) churches, Collinson makes clear how the battles for mens' lives were often hatched in the battles for mens' souls.\n\nCollinson also examines the interplay of spiritual and temporal matters in the spread of religious reform to all corners of Europe, and at how the Catholic Counter-Reformation used both coercion and institutional reform to retain its ecclesiastical control of Christendom. Powerful and remarkably well written, The Reformation is possibly the finest available introduction to this hugely important chapter in religious and political history.\n\nRecorded Books, Inc.\nUnabridged, 7.5 hrs.\nRead by John McDonough\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:adc9fdad4bd655759dc2fa0d5d6943b394d821a8","amp;dn":"The+Reformation%3A+A+History+-+Patrick+Collinson++%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"adc9fdad4bd655759dc2fa0d5d6943b394d821a8","infoHashBuffer":{"type":"Buffer","data":[173,201,253,173,75,214,85,117,157,194,250,13,93,105,67,179,148,216,33,168]},"announce":[],"urlList":[]}}