{"title":"From X-raystoDNA:How Engineering Drives Biology prabhu_","uid":9433767,"size":26645552,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ae11f1af2348a61518a7023556f5c9326b551d0a&amp;dn=From+X-raystoDNA%3AHow+Engineering+Drives+Biology+prabhu_&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"prabhu_","files":3,"time":1388855291,"description":"From X-rays to DNA: How Engineering Drives Biology\n\nby W. David Lee (Author), Jeffrey Drazen (Contributor), Phillip A. Sharp (Contributor), Robert S. Langer (Contributor)\n &lt;a href=&quot;\nhttp://cdn.shopify.com/s/files/1/0228/9323/products/9780262019774_large.jpg?v=1383052100&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://cdn.shopify.com/s/files/1/0228/9323/products/9780262019774_large.jpg?v=1383052100&lt;/a&gt;\n\nabout book :-\n\nEngineering has been an essential collaborator in biological research and breakthroughs in biology are often enabled by technological advances. Decoding the double helix structure of DNA, for example, only became possible after significant advances in such technologies as X-ray diffraction and gel electrophoresis. Diagnosis and treatment of tuberculosis improved as new technologies -- including the stethoscope, the microscope, and the X-ray -- developed. These engineering breakthroughs take place away from the biology lab, and many years may elapse before the technology becomes available to biologists. In this book, David Lee argues for concurrent engineering -- the convergence of engineering and biological research -- as a means to accelerate the pace of biological discovery and its application to diagnosis and treatment. He presents extensive case studies and introduces a metric to measure the time between technological development and biological discovery.\n\nInvestigating a series of major biological discoveries that range from pasteurization to electron microscopy, Lee finds that it took an average of forty years for the necessary technology to become available for laboratory use. Lee calls for new approaches to research and funding to encourage a tighter, more collaborative coupling of engineering and biology. Only then, he argues, will we see the rapid advances in the life sciences that are critically needed for life-saving diagnosis and treatment.\n &lt;a href=&quot;\nhttp://cdn.shopify.com/s/files/1/0228/9323/products/9780262019774_large.jpg?v=1383052100&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://cdn.shopify.com/s/files/1/0228/9323/products/9780262019774_large.jpg?v=1383052100&lt;/a&gt;\n\nabout author :-\n &lt;a href=&quot;\nhttp://g-ecx.images-amazon.com/images/G/01/ciu/b4/e0/0dc646b2cf7d0ad8976fae.L._V359704430_SX200_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://g-ecx.images-amazon.com/images/G/01/ciu/b4/e0/0dc646b2cf7d0ad8976fae.L._V359704430_SX200_.jpg&lt;/a&gt;\n\nW. David Lee is CEO of Lumicell Diagnostics, Inc., and has an appointment at MIT's Koch Institute for Integrative Cancer Research.\n\nJeffrey Drazen is Editor-in-Chief of the New England Journal of Medicine and Distinguished Professor of Medicine at Harvard Medical School.\n\nPhillip A. Sharp, awarded the Nobel Prize for Medicine and Physiology in 1993, is Institute Professor at the Koch Center.\n\nRobert S. Langer, awarded the 2002 Charles Stark Draper Prize, is an Institute Professor and a member of the Department of Chemical Engineering at the MIT Koch Institute for Integrative Cancer Research.\n\n\n`~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~`\n  SEED PLEASE , LET OTHERS GET IT TOO. \n `~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~`","torrent":{"xt":"urn:btih:ae11f1af2348a61518a7023556f5c9326b551d0a","amp;dn":"From+X-raystoDNA%3AHow+Engineering+Drives+Biology+prabhu_","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae11f1af2348a61518a7023556f5c9326b551d0a","infoHashBuffer":{"type":"Buffer","data":[174,17,241,175,35,72,166,21,24,167,2,53,86,245,201,50,107,85,29,10]},"announce":[],"urlList":[]}}