{"title":"Ragada 2010 - Brrip- x264 - 720p - &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;17565424574756415659397a7c61&quot;&gt;[email protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;","uid":8192932,"size":1083413375,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:aeb3b3228f548dff33def110ebc9ebbe81d954fa&amp;dn=Ragada+2010+-+Brrip-+x264+-+720p+-+AC3%40PAVAN.mkv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pavanace","files":8,"time":1361868546,"description":"MOVIE IMDB: http://www.imdb.com/title/tt1754394/\n\nCAST:\nNagarjuna Akkineni as Satya Reddy\nAnushka Shetty as Shirisha\nPriyamani as Priya alias Ashta Lakshmi\nPradeep Rawat as Peddhanna\nKota Srinivasa Rao as Gangaiah\nDev Gill as G.K.\nDharmavarapu Subrahmanyam\nBrahmanandam as Brahmam\nMaster Bharath as Naryana\nRaghu Babu as Hotel Server\nBanerji\nSatya Prakash\nBharath Reddy\nSupreet as Bhagawan\nTanikella Bharani as Devudu\nVennirade Nirmala as Nirmalamma\nGiridhar as Govardhan\nSandesh\nSushanth as Nandha\nSreekanth Reddy\nSri Latha as Nagarjuna Sister\nCharmy Kaur in an Item number Song.\n\nPLOT:\n\nThe movie starts out with Tanikelli Bharani trying to kill an innocent man, who is against Pedhanna. Tanikelli gets killed by Jairam, who is one of Peddhanna's followers. Peddhanna is the biggest goon in all of AP, and he has 3 major followers who murder people for him. The other henchman just kidnap the wanted. These followers are, Jairam, Bhagavan, and Nanda. The next scene introduces Satya, getting of a truck and getting involved in a fight, which is against GK, and Peddhanna. Satya helps GK, who makes him his partner. Here, they find out that Satya is very money minded. GK's love, Sirisha, who does not love GK back, gets captured by Satya, and falls in love with him. Brahmanandam is another important character in the story who's major role is flirting with Sirisha. Priyamani enters as Ashtalakshmi, being chased by rowdies. Obviously, Satya beats them up, and finds out that the rowdies are Pedhanna's rowdies following Ashtalakshmi, for a reason she does not know of. Later, her whole family is introduced as a Brahmin family.\nSatya tells good tactics to GK, to fight Peddhanna. In one fight, Jairam captures Sirisha, and GK captures Jairam. Not wasting any time, Satya kills Jairam. Once again, Sirisha falls deeper in love with him. Satya gets another warning from Bhagavan, Peddhana's follower, to join him; but Satya does not. Ashtalakshmi, then, also falls in love with him. Later, Sirisha takes Satya to meet his friends at a pub, and she talks with a tattooed girl, whose face is not shown to Satya. In the next scene, Satya takes Ashtalakshmi on a date with him, that was supposed to be his date with Sirisha. Satya is cornered and goes to Bhagavan's house, and kills him, and his son.\nSatya thinks about why he joined the goon's gang. It is for money. The movie jumps to Satya's flashback, where they find out that Satya is an orphan, taken into care by a loving doctor, who is like Mother Teresa. The people of this City, Kadapa, worship this doctor. At that time, an election is taking place. The people want the Dr. to decide on who to vote for. Devyander, a political campaigner and who also has the support of Pedhanna, kidnaps Dr's daughter, to make sure she tells everyone to vote for him. However, she doesn't. Satya enters on cue, and beats up Devyander's men. It is later found out that he has to get 72 crores to keep the Dr's hospital running, as Devyander's dad donated the money to the Dr, to open the hospital. He also kills the doctor at one point of time. So, to get the money and to take revenge against the goons who killed the doctor, Satya enters into the city.\nAt this time, Satya is back in his house and is dealing with Ashtalakshmi's parents who are weeping uncontrollably. He finds out that Peddhanna's men long ago kidnapped Ashtalakshmi's elder brother, and that is why they came to the city. But, as they can not find him, they ask Satya to help. Satya goes to the headquarters where her brother is held, and frees him. Then he finds out that Ashtalakshmi is not who she says she is, and actually robbed 120 crores from Peddhanna with the help of her brother.\nThe rest of the story is how Satya gets the money and figures out the link between GK and Pedhanna.\n\n= Release Info =-\n\nFormat:MKV\nTotal Size:1.00 GB\nRuntime:02:26:32\nTotal bitrate:1039 Kbps\nSource:720p bluray BEST RG\nEncoder: PAVANace\n\n\n-= Video Info =-\n\nFormat:x264/Mkv AVC High\nBitrate:939 kbps\nMaximum bit rate:6.5 Mbps\nEncoding:2 Pass\nResolution:1280 x 544\nQuality Factor (QF):.32\nFrame Rate:same as source\nDisplay Aspect Ratio:2.35:1\nSize:1.00 GB \n\n-= Audio Info =-\n\nType:AC3\nBitrate:48\nSample Rate:48K\nChannels:2 channels:Front L R.\n\nSubtitles:YES\nSample:YES.\n\n\n\n\n\n\n\n\n\n\n\n\nPLZ guys comment and seed ........ EnJoY :) :) :), ty.\n","torrent":{"xt":"urn:btih:aeb3b3228f548dff33def110ebc9ebbe81d954fa","amp;dn":"Ragada+2010+-+Brrip-+x264+-+720p+-+AC3%40PAVAN.mkv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aeb3b3228f548dff33def110ebc9ebbe81d954fa","infoHashBuffer":{"type":"Buffer","data":[174,179,179,34,143,84,141,255,51,222,241,16,235,201,235,190,129,217,84,250]},"announce":[],"urlList":[]}}