{"title":"The New Amsterdams - (2008) - At The Foot Of My Rival","uid":8710305,"size":100295555,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:aed2bd672069fbdb553130caa84572376372321d&amp;dn=The+New+Amsterdams+-+%282008%29+-+At+The+Foot+Of+My+Rival&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":20,"time":1374222325,"description":"The New Amsterdams began as a solo project to then-lead singer for The Get Up Kids, Matt Pryor. In 2000, he released his debut album Never You Mind, which was largely made up of acoustic tracks with sparse accompaniment. However, the album also featured Alex Brahl,Ed Rose, Jake Cardwell &amp; Rob Pope providing extra instrument tracks.\nTwo years later in January 2002, Pryor released Para Toda Vida, this time sticking almost purely to acoustic guitar, with the exception of a few tracks utilizing harmonica and banjo as well. However, the next year the band went a step further in the release of Worse for the Wear, which utilized a full band for the first time, which at this time included Get Up Kids bandmates Ryan Pope and his brother Rob, as well as longtime friend and producer Ed Rose. The album was one of the earlier albums to be recorded at Black Lodge Studios, the recording studio renovated and co-owned by Ed Rose and the members of The Get Up Kids.\nThe band's next album, Killed or Cured was released in 2005. However, it was written during a turbulent time within The Get Up Kids leading up to the band's breakup. Because of this Vagrant Records, the label to which both the bands were signed, didn't want to release the album until The Get Up Kids finished their farewell tour in the summer of that year. For this reason, a portion of the album was released online for free via the New Amsterdams website. The album was released in its full version through retail channels on April 10, 2007.\nIn 2006, the band released the album Story Like a Scar with what is now the current lineup, including Bill Belzer on drums, Eric McCann on upright bass, and Dustin Kinsey on guitar.\nIn September 2007, the band released another album, At the Foot of My Rival on CD, Vinyl and Digital Download. However, after a long relationship with Vagrant Records, the band decided to release the album on Elmar, (named after Pryor's son Elliot Marshall) an offshoot of Curb Appeal Records, owned in part by former Get Up Kids bandmate Jim Suptic.\nIn January 2008 the band released a collection of demos and b-sides, available exclusively through their website.\nIn May of the same year, they went on their first European tour, starting in Amsterdam. The band planned to go into a small hiatus after that due to Matt Pryor's involvement with the Get Up Kids. In a November 2011 interview with MidcoastStation.com, Pryor said he had plans to release a New Amsterdams compilation.\n\n\n\n\n\n\n\n\nAt the Foot of My Rival\t\n\t\n1.\t&quot;Revenge&quot;  \t1:44\n2.\t&quot;Wait&quot;  \t3:02\n3.\t&quot;Fountain of Youth&quot;  \t2:56\n4.\t&quot;This Day Is Done&quot;  \t3:00\n5.\t&quot;Without a Sound (Eleanor)&quot;  \t3:21\n6.\t&quot;Silverlake&quot;  \t3:07\n7.\t&quot;Lost Long Shot&quot;  \t2:53\n8.\t&quot;Hughes&quot;  \t3:11\n9.\t&quot;Beacon in Beige&quot;  \t2:43\n10.\t&quot;Story Like a Scar&quot;  \t3:13\n11.\t&quot;Fortunate Fool&quot;  \t2:48\n12.\t&quot;Lay on the Rails&quot;  \t4:16\n13.\t&quot;Drunk or Dead&quot;  \t3:03\n14.\t&quot;Blood on the Floor&quot;  \n\n3 bonus Track","torrent":{"xt":"urn:btih:aed2bd672069fbdb553130caa84572376372321d","amp;dn":"The+New+Amsterdams+-+%282008%29+-+At+The+Foot+Of+My+Rival","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aed2bd672069fbdb553130caa84572376372321d","infoHashBuffer":{"type":"Buffer","data":[174,210,189,103,32,105,251,219,85,49,48,202,168,69,114,55,99,114,50,29]},"announce":[],"urlList":[]}}