{"title":"Downtime - Complete Discography + Unreleased","uid":6491809,"size":398469047,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b00eee2d3bd6948fde170e75d383fd88b9a42191&amp;dn=Downtime+-+Complete+Discography+%2B+Unreleased&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"downtime666","files":69,"time":1308911623,"description":"DISCOGRAPHY  (entire disc included)\n\\'Downtime\\' - 7\\&quot; record (1994)\n\\'Lose Yourself\\' - album (1995)\n\\'Break Him\\' - EP (1995)\n\\'Tempered\\' - EP (1996)\n\\'Tooth and Nail\\' - album (1997)\n\\'First in Line\\' - EP (2001)\n\\'Demo\\'z &amp; Outtakes (Previously Unreleased)\\' - album (2011)\n\nDowntime were pretty much the band that got me into hardcore punk. Sure, I loved Toe to Toe, and One Inch Punch were great too, but for me - it was all about Downtime. They were fast when they needed to be, didn\\'t mind slowing it up for some mad crunchy metal-ish action (and this was before nu-metal happened so it didn\\'t sound like the shitty metalcore stuff that some hardcore has mutated into nowadays), and they had some great lyrics that really spoke to me.\nDowntime (a Sydney band) was formed in 1994 after guitarist/vocalist Billy Hughes left Toe to Toe. He formed the band with drummer Brenden Peace (with whom he had been in King Pest, a post-high school band, back in 1988) and James Meek (who had kicked on from the now legendary band Massappeal) on bass. They pumped out some releases shortly after forming and scored a spot on the Big Day Out bill in 1994. This helped catapault them onto a variety of high profile shows... they played the Vans Warped Tour in 1997 and Alternative Nation, and got some juicy support slots with touring international bands such as Suicidal Tendencies, Fu Manchu, SNFU, Sex Pistols, All, Pennywise and Bad Religion. \nBy 1997 they had released their second album, \\'Tooth and Nail\\', featuring the track \\'Monkey\\', a popular song which helped gain them some airplay and got them on a lot of punk compilation CDs. A film clip was even filmed, their only one. \n\nBassist James Meek left the band in 1998 and went on to play in Seconds Away. These days he can be found in the bands Grand Fatal and Twin City Faction. He was replaced by Eric Grothe Jr, also a first grade Rugby League player for Parramatta Eels at the time and son of famed Eels played Eric Grothe. Grothe played bass in the band for a short while but it conflicted with his League schedule too much and he was eventually replaced by Dave Dunn. By this stage drummer Brenden Peace had left as well and he was replaced by Percy Ricaud.\n\nAfter this lineup shuffling the band finally got it\\'s shit together again and released an EP \\'First in Line\\' in 2001, which was to be followed shortly after by a third album. The song \\'Payday\\' from this EP got some airplay on Triple J. However by this time (2002) the band had sort of drifted away and were no longer playing shows. A third album never appeared. As far as I know, guitarist/vocalist Billy Hughes hasn\\'t played in any bands since.\n\nThe song \\'What is Black\\' (alternative recording) was featured on the comp \\'Neoteny\\' in 1994 or thereabouts.\nA cover of Bad Brains\\' \\'Rock for Light\\' was featured on the comp \\'Rock\\' in 1999.\n\nOn June 19th 2011, Tragically Billy Hughes frontman for Downtime was fatally killed in a Motorcycle Accident.\nAs a tribute to Billy\\'s music, the remaining band members have decided to release their entire back collection for FREE.\nThere is also a CD included of entire unreleased demos and unreleased tracks as a bonus.\n\n\nLong Live Punk Rock\nYou will be dearly missed Billy Hughes and never, ever, forgotten\n","torrent":{"xt":"urn:btih:b00eee2d3bd6948fde170e75d383fd88b9a42191","amp;dn":"Downtime+-+Complete+Discography+%2B+Unreleased","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b00eee2d3bd6948fde170e75d383fd88b9a42191","infoHashBuffer":{"type":"Buffer","data":[176,14,238,45,59,214,148,143,222,23,14,117,211,131,253,136,185,164,33,145]},"announce":[],"urlList":[]}}