{"title":"Microcosmos: Four Billion Years of Microbial Evolution","uid":14870688,"size":152417367,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b09c80f0020c19582003e62abb060b227e7fe3d3&amp;dn=Microcosmos%3A+Four+Billion+Years+of+Microbial+Evolution&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"twp6045","files":1,"time":1465572872,"description":"Reprint Edition...BACK IN PRINT WITH A REVISED PREFACE\r\n\r\nMicrocosmos brings together the remarkable discoveries of microbiology of the past two decades and the pioneering research of Dr. Margulis to create a vivid new picture of the world that is crucial to our understanding of the future of the planet. Addressed to general readers, the book provides a beautifully written view of evolution as a process based on interdependency and thei nterconnectedness of all life on the planet.\r\n\r\nA century after Darwin theorized that we descended from ape-like ancestors, science has in just the last two decades contrived an awesome description of our even more primordial development from microbes. Boston University biologist Margulis and science writer Sagan here produce a stunning, complex chronicle of those four billion years, from Hadean and Archaeon aeons when matter became &quot;animated&quot; and the mysteries we now call DNA and RNA became &quot;the language of nature,&quot; to the first appearances of plant and animal life, including hominids. So immensely detailed is this elucidation of the developing microcosm (with its emphasis on natural selection and symbiosis in the bacterial world) that even advanced science readers will find the book difficult. But it is an important one, a comprehensive, popularized treatment of evolutionary microbiology spelling out a dimension that Darwin possibly never imagined, and proposing that only an understanding of the microcosm from which life sprang can make possible our ultimate leap beyond Earth into a human-devised supercosm.\r\n\r\nThis PDF is not available for purchase anywhere. I had it made for myself, and to share with the world. Enjoy!","torrent":{"xt":"urn:btih:b09c80f0020c19582003e62abb060b227e7fe3d3","amp;dn":"Microcosmos%3A+Four+Billion+Years+of+Microbial+Evolution","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b09c80f0020c19582003e62abb060b227e7fe3d3","infoHashBuffer":{"type":"Buffer","data":[176,156,128,240,2,12,25,88,32,3,230,42,187,6,11,34,126,127,227,211]},"announce":[],"urlList":[]}}