{"title":"Icarus (2010)(Retail)(Pal)(nlsubs)2lions-Team","uid":5473185,"size":4497213358,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:b0bd1130f17694b1e25407c96f6d57e858640cb9&amp;dn=Icarus+%282010%29%28Retail%29%28Pal%29%28nlsubs%292lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Nobby010","files":-1,"time":1269990105,"description":"Icarus (2010) PAL\n\n\nVerenigde Staten / Canada\nActie / Drama\n90 minuten\n\ngeregisseerd door Dolph Lundgren\nmet Dolph Lundgren, Lindsay Maxwell en Stefanie von Pfetten\n\nDe meeste mensen kennen Icarus (Lundgren) als een doodnormale gescheiden vader, die werkt bij een investeringsbedrijf. Maar hij heeft ook een hele duistere kant; Icarus is namelijk het beste in het ombrengen van mensen. Jaren lang werkte hij als spion in Amerika, maar toen de Sovjet-Unie in elkaar viel, voelde hij zichzelf gevangen in een land waar hij niemand kon vertrouwen. Vastbesloten zijn slechte verleden te vergeten, besluit hij opnieuw te beginnen met een nieuwe identiteit. Maar is het wel mogelijk je verleden voor altijd te vergeten? Als door een misstap in Hong Kong de ware identiteit van Icarus aan het licht komt, komt hij erachter dat hij nu zelf het doelwit is, en ze zullen niet rusten voor ze hem te pakken hebben. Hij zal erachter moeten komen wie er op hem jaagt, om op deze manier zijn vrouw en dochter, maar ook zichzelf te beschermen.\n\n\nEnglish\n\nThere were those who called him Icarus. Everyone else knew him as a divorced father working for an investment company. But they didn't know his other side-his dark side. Because Icarus was at his best when he was killing people. For years, he'd worked as a sleeper agent in America-but when the Soviet Empire collapsed, he found himself in a foreign country with no one to trust. Determined to break from his dark past, he started over with a new identity. But you can only escape your past for so long. When a sudden mishap in Hong Kong blows Icarus' identity, past and present collide - and the assassin realizes he is now the target. The people that want him dead will stop at nothing to get to him. And that means going after what he cares about most-his wife and daughter. Fighting for his life, Icarus is forced to face the demons of his past to protect the loved ones in his present. He must fight to save the only thing he's ever done right in his life. He needs to uncover who is after him and protect his family - before it's too late. \n\n\n\n\n\n=================================================================================\n\n\n\n\n\nDvd Info:\n\n\n\nRelease name.......: Icarus.Uncut.German.2010.DL.PAL.DVDR-ViDEOWELT\n\nSource.............: R2 | PAL | DVD9\n\nResolution.........: 720 x 480 (WS)\n\nVideo bitrate......: 5866 Kbps avg @ 6 pass CCE\nFramerate..........: 25 fps \n\nAudio..............: Engels DD2.0 @ 193 Kbps | Duits DD5.1 @ 448 Kbps\n\nMenu...............: Geheel vertaald door Rens. Respekt weer maatje\n\nExtra's............: All stripped\n\nSubtitles..........: Nederlands Cust.\n\nFRT Subber.........: Speedbuster Thnx voor het werk maatje!\n\nControle...........: Poppetje1969\n\nSync+bewerking.....: Dejavu\n\n\nWeblink : http://www.moviemeter.nl/film/57186\nWeblink : http://www.imdb.com/title/tt1261862\n\n... r_embedded\n\n*****************************************\n\nBrought to you by Nobby\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n\n\n\n2Lions the site to be for all your Dutch MOVIES and more\n\n******************************************\n\n\nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!","torrent":{"xt":"urn:btih:b0bd1130f17694b1e25407c96f6d57e858640cb9","amp;dn":"Icarus+%282010%29%28Retail%29%28Pal%29%28nlsubs%292lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0bd1130f17694b1e25407c96f6d57e858640cb9","infoHashBuffer":{"type":"Buffer","data":[176,189,17,48,241,118,148,177,226,84,7,201,111,109,87,232,88,100,12,185]},"announce":[],"urlList":[]}}