{"title":"Encyclopedic Dictionary of Mathematics 2nd Edition ","uid":12163232,"size":33293829,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b173a05015a61c33fda74551f8edbc21baf5b697&amp;dn=Encyclopedic+Dictionary+of+Mathematics+2nd+Edition+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Cquark","files":1,"time":1437966311,"description":"Encyclopedic Dictionary of Mathematics\n\n\nNOTE : This is scanned eBook in .djvu format. Quality is not very good, but it is easily readable. This is a GREAT book for all Mathematicians or for anyone who is interested in Mathematics or its History.\nBook Cost : $255.42 (paperback)\nBookmarked\nNumber of pages : 2168\nAuthor : Kiyosi Ito\nPublisher: The MIT Press\nLanguage: English\nEdition : 2nd\n\n\nBook Description:\n\nThe Encyclopedic Dictionary of Mathematics, as put out by the Mathematical Society of Japan, is as complete and comprehensive an opus as one could wish for, concisely comprising in its two volumes all significant mathematical results, both pure and applied, elementary to advanced. This second edition is, basically, an English version of the acclaimed Japanese third edition. The EDM2, as it is known, succinctly but thoroughly covers math from A to Z, from Niels Henrik Abel and Abelian groups to Witt vectors and Zeta functions. Within its 2,000-plus pages are elegant explanations of diffusion processes, Fourier series, linear operators, and meromorphic functions. There are pages dedicated to quadratic fields and robust and nonparametric methods, and following each section, all the relevant references are listed. In addition, there are appendices with tables of formulas, numerical tables, and statistical tables, journals, publishers, and special notations, articles listed both systematically and alphabetically, plus a name index and an exhaustive subject index that's 231 pages long. It is a quality product--easily accessible, adhering to rigorous standards, and worth the investment for any school or personal math library. --Stephanie Gold\n\nMost Helpful Customer Reviews :\n(4.9 Out of 5 Stars) (11 people rated this)\n\n#1 (5 Stars) Incomparably Great :\nThe Encyclopedic Dictionary of Mathematics is an astonishing achievement. The result of an extraordinary, decades-long collaboration among literally hundreds of celebrated Japanese mathematicians, it will not only never be equalled but in all probability will never be challenged. In two massive volumes, the EDM surveys the whole of the mathematical sciences, both pure and applied, through a series of pithy articles containing the key definitions, methods, and results of every mathematical subdiscipline sufficiently coherent to have a name. It also tabulates vast amounts of information -- homotopy groups of spheres, symmetries of ordinary differential equations, characters of finite groups, class numbers of algebraic number fields, and so forth, seemingly, ad infinitum -- available, as far as I know, in no other single reference work.\nEquipped with a detailed and extensive system of indexes, the EDM makes its myriad resources readily available even to the befuddled; the vaguest, most dimly remembered hint is generally enough to track down a topic or result quickly and easily. Each entry, too, offers its own references to the mathematical literature -- and these invariably include the seminal contributions to the particular area under discussion. But it is important to note that the EDM was written by the Japanese, for the Japanese: many of its references direct the reader to (untranslated, Japanese-language) works in (often inaccessible) Japanese mathematics journals.\nIt is likewise only fair to point out that the EDM is a tool for serious research mathematicians. To keep its component articles brief, it makes full, unapologetic use of a wide variety of notational and expositional economies","torrent":{"xt":"urn:btih:b173a05015a61c33fda74551f8edbc21baf5b697","amp;dn":"Encyclopedic+Dictionary+of+Mathematics+2nd+Edition+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b173a05015a61c33fda74551f8edbc21baf5b697","infoHashBuffer":{"type":"Buffer","data":[177,115,160,80,21,166,28,51,253,167,69,81,248,237,188,33,186,245,182,151]},"announce":[],"urlList":[]}}