{"title":"ohnny Mars &amp; Big Fat Mama - Can You Hear Me (blues)(mp3@320)[rog","uid":5541290,"size":100466076,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b1c7e8c790c4a226047bd7e442ac53cba1df7224&amp;dn=ohnny+Mars+%26+Big+Fat+Mama+-+Can+You+Hear+Me+%28blues%29%28mp3%40320%29%5Brog&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rogercc","files":9,"time":1273239049,"description":"JOHNNY MARS AND BIG FAT MAMA  CAN YOU HEAR ME?\nRecorded live in Pavia, Italy, 1992.\nReleased: 1993\nLabel: SAAR Records, Italy\nFile: mp3; 320 Kbps\nTime: 41:06 min.\n\n\nSongwriter, harmonica player and singer Johnny Mars (1942, Laurens, SC.) was raised in a sharecropping family. He was given his first harmonica at age nine. After he graduated from high school, he played club shows around New York and recorded with his band Burning Bush for Mercury Records. In the mid-1960s, Mars moved to San Francisco, where he formed the Johnny Mars Band, playing clubs and festivals in northern California, as well as shows for rock promoter, impresario and producer Bill Graham. Critics there have called him 'The Jimi Hendrix of the harmonica'. Over the years, Mars has shared bills with Hendrix (before he was well-known) and Magic Sam.\n\nAfter hearing about the greener pastures across the pond from his friend Rick Estrin of Little Charlie and the Nightcats, he toured England in 1972. There, he recorded a couple of albums working with producer Ray Fenwick. And yet, the nineties of the last century were probably his most prolific period, he has recorded several powerful albums of hard-edged blues, Can You Hear Me?, among others. It features brilliant and original harmonica playing,\n\n\n\nBig Fat Mama was born from an idea in 1979 by  Piero De Luca, an Italian blues enthusiast, singer, songwriter and bass player. In its thirty-year experiance the group has so far recorded eight LPs or CDs and has played throughout Europe and in all the most important Italian festivals. They collaborated and shared the stage with famous blues artists such as: Stevie Ray Vaughan, Louisiana Red, Eddie C. Campbell, Zora Young, Clifton Chenier, Honeboy Edwards, Jimmy Rogers, Legendary Blues Band and Johnny Mars.\n\n01. Just a Little Bit (4:25)\n02. Living in The Ghetto (5:20)\n03. A Change Will Come (6:14)\n04. Crosstown Woman (6:22)\n05. Driving Sideways (4:37)\n06. You Drive Me Crazy (4:16)\n07. Can You Hear Me? (2:50)\n08. I'm Hungry Blues (6:44)\n\nJohnny Mars - Hamonica &amp; Vocals\nAlessio Menconi - Guitar\nPiero De Luca - Bass\nMauro Mura - Drums\nAndrea Zanzottera - Keyboards\n\n\n\n\n","torrent":{"xt":"urn:btih:b1c7e8c790c4a226047bd7e442ac53cba1df7224","amp;dn":"ohnny+Mars+%26+Big+Fat+Mama+-+Can+You+Hear+Me+%28blues%29%28mp3%40320%29%5Brog","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1c7e8c790c4a226047bd7e442ac53cba1df7224","infoHashBuffer":{"type":"Buffer","data":[177,199,232,199,144,196,162,38,4,123,215,228,66,172,83,203,161,223,114,36]},"announce":[],"urlList":[]}}