{"title":"Mark Twain Short Stories","uid":4143529,"size":700203344,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:b27d14f0e875c94dcb81c796fbed9148b3154886&amp;dn=Mark+Twain+Short+Stories&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rambam1776","files":95,"time":1208615825,"description":"Taken and organized from the Librivox free Audiobook website, here are the majority of the most famous and best of Twains short stories. Most of us read in school about the celebrated jumping frog, but some of the finest and funniest things ever written are in this collection. May I especially suggest Captain Stormfields visit to heaven. Have you ever stopped to think what Heaven would be like if it was ACTUALLY the way it is depicted in church and fine art? How ridiculous is it to expect you would spend eternity singing hymns and not getting bored with it? Twain constructs a heaven that makes sense.\n\nJames Fennimore Coopers Literary Offenses is a must read for anyone who was forced to read the Last of the Mohicans, and cannibalism in the cars may just be the funniest thing he ever wrote. These stories force you to think like being thrown into the pool forces you to swim. The only possible excuse for not loving and laughing at this collection from THE American Author is either you do not speak English, or you are an ignorant shmuck.\n\nMP3s of good quality, and some fine narration considering Librivox depends on volunteer submissions from the general public. Most are recorded at 64, some at 128. All unabridged.\n\nPlease visit Librivox for thousands of recording in the public domain of the great classical authors, and check back often for updates. There are dozens of Twain short stories they have not yet recorded.","torrent":{"xt":"urn:btih:b27d14f0e875c94dcb81c796fbed9148b3154886","amp;dn":"Mark+Twain+Short+Stories","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b27d14f0e875c94dcb81c796fbed9148b3154886","infoHashBuffer":{"type":"Buffer","data":[178,125,20,240,232,117,201,77,203,129,199,150,251,237,145,72,179,21,72,134]},"announce":[],"urlList":[]}}