{"title":"Joon - Persian Cooking Made Simple (gnv64)","uid":12569511,"size":33849594,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b2db47d355423715d35af116be8192b7959ae82b&amp;dn=Joon+-+Persian+Cooking+Made+Simple+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"gnv65","files":4,"time":1444830028,"description":"Joon: Persian Cooking Made Simple \r\nby Najmieh Batmanglij\r\nMage Publishers | October 2015 | ISBN-10: 1933823720 | 224 Pages | True PDF | 31.4 mb\r\n\r\n75 Persian recipes made simple: many requiring only one pot and less than an hour to cook while keeping the authentic flavors of Iran. Includes many vegan and vegetarian options.\r\nIn Joon, master chef Najmieh Batmanglij distills one of the world's oldest and most influential cuisines to capture its unique flavors in recipes adapted to suit our busy lives. Najmieh's fans have been making meals from her Food of Life for more than 30 years. For Joon she has simplified 75 of her favorite dishes and shows how, with the right ingredients and a few basic tools and techniques, authentic Persian food can easily be prepared at home.\r\nThe recipes in this book--each accompanied by a photograph of the finished dish--come straight from Najmieh's kitchen and include not only the classics of Persian cooking, but also some soon-to-be favorites, such as quinoa or kale cooked Persian-style. You'll discover delicious side dishes, from cooling, yogurt-based salads and tasty dips and spreads, to more sustaining platters of grains, beans and fresh herbs; tasty kukus --frittata-style omelets filled with vegetables and herbs; spice-infused fish; mouth-watering meatballs and kababs served on flat breads with tangy sauces; every kind of rice--including the incomparable polow topped with various sweet and sour braises; not to mention, delightfully aromatic cakes and cookies to round off meals or enjoy as a snack in between.\r\nMuch of Iran's cuisine is essentially vegetarian. Although kababs are popular restaurant fare, they represent only a small sampling of the dishes Iranians eat at home. Persian cooking, with its emphasis on fresh, natural ingredients corresponds with the trend in eating that's spreading across America.\r\n\r\nAbout the Author\r\nNajmieh Batmanglij was born and raised in Iran. She came to America in the 1960s to study at university and would cook Persian food with fresh local produce using recipes sent by her mother in letters. Later, when Najmieh returned to Iran with her master's degree in education in hand, her mother welcomed her into the kitchen and started to work with her.\r\nAt the end of 1979, as the Iranian Revolution took a more fundamentalist turn, Najmieh and her husband fled to France, where their first son Zal was born. It was in France that Najmieh decided to follow her passion for cooking. With the help of her friends and neighbors, she wrote her first cookbook, Ma Cuisine d Iran.\r\nIn 1983 she and her husband emigrated to America, where she gave birth to their second son, Rostam, and wrote her first book in English, Food of Life.\r\nNajmieh has spent the past 35 years cooking, traveling, and adapting authentic Persian recipes to tastes and techniques in the West. Najmieh is a member of Les Dames d Escoffier and lives in Washington, DC, where she teaches Persian cooking, and consults with restaurants around the world. \r\n\r\nCONTENTS\r\nintroduction 9\r\nthe essential persian pantry . . . . 11\r\npreparing to coo k 39\r\nsmall dishes to mix + match 41\r\nsoup ....  85\r\neggs . . . . . . . . . . . . 96\r\nmeatballs, pasta + pizza .   .   .   .   . 109\r\nfish . . . . . . . . . . . . . 125\r\nroasts + kababs . . . . . . . 135\r\npolow + khoresh . . . . . . . 153\r\ndesserts + teas .... 193\r\ntools for a persian kitchen . . . 215\r\nindex . . . . . . . . . . 219\r\n \nhttp://s14.postimg.org/9wa7lw829/Joon_Persian_Cooking_Made_Simple.jpg","torrent":{"xt":"urn:btih:b2db47d355423715d35af116be8192b7959ae82b","amp;dn":"Joon+-+Persian+Cooking+Made+Simple+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2db47d355423715d35af116be8192b7959ae82b","infoHashBuffer":{"type":"Buffer","data":[178,219,71,211,85,66,55,21,211,90,241,22,190,129,146,183,149,154,232,43]},"announce":[],"urlList":[]}}