{"title":"Darlene Clark Hine - A  Question of Manhood [2001] [A]","uid":10099624,"size":2520028,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b2efb73ab83041bfff58a2b7d72c8ef0358a3802&amp;dn=Darlene+Clark+Hine+-+A++Question+of+Manhood+%5B2001%5D+%5BA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anette14","files":-1,"time":1399369047,"description":"Description\nProduct Details\nBook Title: A Question of Manhood: A Reader in U.S. Black Men's History and Masculinity, Vol. 2: The 19th Century: From Emancipation to Jim Crow (Blacks in the Diaspora) (Volume 2)\nBook Author: Darlene Clark Hine (Editor), Earnestine L. Jenkins (Editor)\nSeries: Blacks in the Diaspora\nPaperback: 512 pages\nPublisher: Indiana University Press (July 12, 2001)\nLanguage: English\nISBN-10: 0253214602\nISBN-13: 978-0253214607\n\n===================================================================================\nA Question of Manhood: A Reader in Black Men's History and Masculinity, is the first anthology of historical studies focused on themes and issues central to the construction of Black masculinities. The editors identified these essays from among several hundred articles published in recent years in leading American history journals and academic periodicals. Volume II picks up where volume I left off, continuing to focus on gender by examining the lives of African American men in the tumultuous period following the Civil War through the end of the nineteenth century. The writings included in volume two cover themes in the lives of black men that touch on leadership, work and the professions, family and community, sports and the military, and the image of black men in the larger society.\n\n===================================================================================\nAbout the Authors\nDarlene Clark Hine is John A. Hannah Professor of History at Michigan State University. She is co-editor of Crossing Boundaries: Comparative History of Black People in Diaspora and More Than Chattel: Black Women and Slavery in the Americas, co-author of A Shining Thread of Hope: The History of Black Women in America, and author of Hine Sight: Black Women and the Reconstruction of American History.\n\nEarnestine Jenkins is Assistant Professor in the Department of Art at the University of Memphis. She has published articles that have appeared in numerous books and journals, including Milestones in Black American History, and Aspects of Ethiopian Art.\n===================================================================================","torrent":{"xt":"urn:btih:b2efb73ab83041bfff58a2b7d72c8ef0358a3802","amp;dn":"Darlene+Clark+Hine+-+A++Question+of+Manhood+%5B2001%5D+%5BA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2efb73ab83041bfff58a2b7d72c8ef0358a3802","infoHashBuffer":{"type":"Buffer","data":[178,239,183,58,184,48,65,191,255,88,162,183,215,44,142,240,53,138,56,2]},"announce":[],"urlList":[]}}