{"title":"Kathie Lee's-Feel Fit and Fabulous Workout","uid":5242017,"size":2023002509,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b400890b27c422a483dd1174da612a9735c898b0&amp;dn=Kathie+Lee%5C%27s-Feel+Fit+and+Fabulous+Workout&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bozo57","files":-1,"time":1261813392,"description":"Full DVD format from VHS rip\nNot available on DVD\n\n\nFrom the back cover\n&quot;In the past, I hated even the thought of exercising, much less actually getting out there and doing it. But now, after two babies and hitting 40, I realize it's not only the best thing I can do for me, but also for my family. I'm happier, more confident and I have more stamina to face the challenge of the workplace and motherhood.&quot; &quot;In this exercise video, I think we have succeeded in making fitness fun. So join me, my sister Michie and good friends Denise and Laurie as fitness expert C.B. Yelverton, M.S. shows us how to feel fit and fabulous.&quot;--Kathie Lee Gifford. For years, professional athletes have used interval training to help reach their goals quickly, Join Kathie Lee in a modified interval training program that's fun, invigorating, and most of all-effective. &quot;Feel Fit and Fabulous&quot; is a unique, time-saving workout that combines special body sculpting exercises for the arms, buttocks, hips and thighs with low-impact aerobic movements. Stretching and abdominal toning round out the program, which is designed to help both beginners and intermediate exercisers burn calories, increase their energy and improve overall muscle tone. Working out with her friends, family and fitness expert C.B. Yelverton, Kathie Lee shows you how to look and feel your very best. \n\n\n-----","torrent":{"xt":"urn:btih:b400890b27c422a483dd1174da612a9735c898b0","amp;dn":"Kathie+Lee%5C%27s-Feel+Fit+and+Fabulous+Workout","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b400890b27c422a483dd1174da612a9735c898b0","infoHashBuffer":{"type":"Buffer","data":[180,0,137,11,39,196,34,164,131,221,17,116,218,97,42,151,53,200,152,176]},"announce":[],"urlList":[]}}