{"title":"Papers 2.3.3","uid":7525287,"size":40421749,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:b44a6bc19ef53bc91e819aa5c81bced5a4c3d655&amp;dn=Papers+2.3.3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"openarena","files":-1,"time":1344762858,"description":"\nPapers is your personal library of Science.\n\nRead, Write, Cite. Your research will never be the same with Papers2 and Magic Manuscripts.\n\nPapers revolutionizes the way you deal with your research documents. It allows you to search for them, download and organize them together with supplementary material, allows you to read them full screen, highlight and keep notes, sync them to your iPad or iPhone, cite them in your favorite word processor, share them with your colleagues, and much much more. Welcome to your personal library of Research!\n\n[quote]\nWhat's new in Papers 2.3.3:\nAugust 6th, 2012\n\nBUG FIXES:\nÂ· Fixed an issue where the app would crash during import.\nÂ· Fixed a Mountain Lion specific crash when dragging files to be imported into Papers.\nÂ· Fixed an issue where upon import of a large batch of files you would see some weird intermediate drawing state.\nÂ· Fixed an issue where a single first author or last author search term would result in zero hits in ADS.\nÂ· Added basic support for insertion of cite keys in TexStudio.\nÂ· Added improved explanation why paper wants to know the user's location or get access to the address book.\nÂ· Updated CSL styles.\n\nNEW FEATURES:\nÂ· Mac OS X 10.8 Mountain Lion compatibility including Gate Keeper support.\nÂ· Watched folders. One can now tell Papers to watch one or more folders and automatically import any documents that are dropped into them. You can configure the watched folders under the library tab in the preferences.\n\nand more!.....\n","torrent":{"xt":"urn:btih:b44a6bc19ef53bc91e819aa5c81bced5a4c3d655","amp;dn":"Papers+2.3.3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b44a6bc19ef53bc91e819aa5c81bced5a4c3d655","infoHashBuffer":{"type":"Buffer","data":[180,74,107,193,158,245,59,201,30,129,154,165,200,27,206,213,164,195,214,85]},"announce":[],"urlList":[]}}