{"title":"To Each His Own (1946) AVI - Olivia de Havilland.avi","uid":5269411,"size":938810178,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b45a1c58ead33dbb047f760fa2872dc29739d6a7&amp;dn=To+Each+His+Own+%281946%29+AVI+-+Olivia+de+Havilland.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"OldMovies","files":1,"time":1262994623,"description":"Synopsis\n\nDuring World War II, while London endures New Year's Eve during a blackout, Jody Norris, a middle-aged American woman, turns down a date with another lonely Londoner, Lord Desham, to meet a train. Onboard is Lieutenant Gregory Pierson, the son of Jody's friends from her hometown, Pierson Falls. While she waits, Jody recalls the summer of 1918, just before the end of World War I, when she was a very young woman: When Jody turns down a proposal from Lieutenant Alex Pierson, he proposes to Corinne Sturges. That night, Jody falls in love with a young flier, Captain Cosgrove, and makes love with him, even though she knows he is in town only for a few hours. Soon Jody discovers that she is pregnant and is told by a doctor that for her own safety, she must terminate the pregnancy. When she learns that Cosgrove has been killed in battle, Jody decides to keep the baby. After Jody secretly gives birth to a son, Daisy Gingras, her nurse, gives the baby to Jody's neighbor Belle Ingham, saying that the infant is a war orphan, so that Jody can offer to adopt him without scandal. Belle, however, gives the baby to Corinne, whose own baby has just died, and he is named Gregory. Heartbroken, Jody visits the baby frequently and nicknames him &quot;Griggsy.&quot; After her father dies and Jody sells their family drugstore, she asks Corinne to hire her as Griggsy's nurse. When Corinne refuses, Jody shows her Griggsy's birth certificate and confesses that he is her son. Corinne refuses to give up Griggsy, because Alex is still in love with Jody. Jody moves to New York and builds a successful cosmetics business with her friend Mac Tilton, who loves her. Jody tells him she has a young son, and he again proposes, but she turns him down. Meanwhile, she continues to see Griggsy when he and Alex come to New York. When she learns that Alex and Corinne are nearly bankrupt, Jody blackmails Corinne into giving up Griggsy in exchange for a loan. After two months with Jody, Griggsy longs to be home with Corinne, and when Jody tells him Corinne adopted him, he becomes hysterical and says that his mother already told him about it and loves him best because she chose him. Heartbroken, Jody returns Griggsy to the Piersons and goes to London to immerse herself in work. Back in the present, Jody introduces herself to Griggsy and offers him a place to stay, hoping to finally have a week alone with him. His mind is on getting married while on leave to his girl friend, Liz Lorimer, however, and Desham makes arrangements for a wedding ceremony that night. After Desham intimates to Griggsy that Jody is more than just a kind benefactor, Liz tells Griggsy that Jody acts as if he were her own son. Griggsy finally realizes who Jody is, and calling her &quot;mother,&quot; asks her to dance.\n\nCast &amp; Crew\n\nMitchell Leisen\nDirector\n\nOlivia deHavilland\nas Jody Norris\n\nMary Anderson\nas Corinne Sturges Piersen\n\nRoland Culver\nas Lord Desham\n\nPhillip Terry\nas Alex Piersen\n\nBill Goodwin\nas Mac Tilton\n\nVirginia Welles\nas Liz Lorimer\n\nVictoria Horne\nas Daisy Gingras\n\nGriff Barnett\nas Mr. Norris\n\nAlma Macrorie\nas Belle Ingham\n\nBill Ward\nas Griggsy, 5 1/2 years\n\nFrank Faylen\nas Babe\n\nIt won the Academy Award for Best Actress (Olivia de Havilland) and was nominated for Best Writing, Original Story.\n\nThe second half is somewhat out of sync, since I got it in flv pieces, converted to AVI and then stitched. Still, it is watchable.\n\nEnjoy and seed!","torrent":{"xt":"urn:btih:b45a1c58ead33dbb047f760fa2872dc29739d6a7","amp;dn":"To+Each+His+Own+%281946%29+AVI+-+Olivia+de+Havilland.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b45a1c58ead33dbb047f760fa2872dc29739d6a7","infoHashBuffer":{"type":"Buffer","data":[180,90,28,88,234,211,61,187,4,127,118,15,162,135,45,194,151,57,214,167]},"announce":[],"urlList":[]}}