{"title":"PublicDisgrace--PD-40593 Alexa Nasha, Silvia Rubi, Steve Holmes","uid":14877090,"size":1453968431,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:b45ee3d643fc49c396c1ab10b4f7b9bd2d939628&amp;dn=PublicDisgrace--PD-40593+Alexa+Nasha%2C+Silvia+Rubi%2C+Steve+Holmes+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"merzedes","files":83,"time":1465599036,"description":"Bound Teen Alexa Nasha is Fucked Before a Chanting Crowd - Part 1\r\n\r\nJun 10, 2016 - Performers: Steve Holmes ,  Silvia Rubi ,  Juan Lucho  and  Alexa Nasha \r\n\r\n\r\nHi and HD MP4 + Pics.\r\n\r\n\r\nSummer has come to Barcelona, bringing with it a fresh batch of european sluts who want nothing more than to be publicly fucked and humiliated. The first girl to spread her legs for this season of Public Disgrace is Alexa Nasha. \r\n\r\nPart one: Alexa Nasha, in a beautiful white summer dress, is bound with rope from a tree in a public park. Couples sit at picnic tables enjoying the summer weather. Slowly, people begin to notice that something interesting is going on as Steve Holmes, Silvia Rubi and Juan Lucho descend upon their bound beauty. Alexa squeals with excitement as the group of three tormentors begin lifting up Alexa's skirt to reveal her dripping wet cunt. Several couples move away from the exposed girl in disgust while others gather around Alexa in amazement. With her hands bound Alexa is unable to resist as she gets passed between the three. The feeling of two uncut cocks sliding in and out of her completely exposed holes causes Alexa to moan with pleasure. This is only the beginning. \r\n\r\nPart Two: Alexa Nasha put her face on the beer soaked floor of a Barcelona bar. She squeezes her eyes shut as everyone in the bar looks at her swollen cunt. She winces at the idea that everyone can see how excited she is. Her asshole clenches as someone reaches down and slides a finger from her throbbing clit to her leaking hole. Pushing her hips back, Alexa's body begs to get fucked. A man yanks her head off the ground by her hair and yells something in a language she doesn't understand. Opening her eyes to a throbbing cock in front of her mouth she knows exactly what the man needs her to do. With her mouth gaping one man fucks her throat while another penetrates her cunt. The bar chants as she submits to her rightful place as the cum spittoon for the bar. \r\n\r\nScreens \nhttp://www.publicdisgrace.com/site/shoot.jsp?shootId=40593\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n21 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect.\r\n\r\nJust keep on leaving us nice comments below and we are happy for the next 20k:)\r\n\r\nAlso, a huge thanks to Kink.com for making the videos we all love (and Intersect and all the others too ofcourse). Keep up the awesome work!!!\r\n\r\nAny Questions ?? Read our FAQ!!\r\n \nhttps://yuq.me/users/23/079/W2kwa6hEeP.png\r\n \nhttps://s16.postimg.org/rxyfmji7p/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg\r\n\r\nCheers :-)","torrent":{"xt":"urn:btih:b45ee3d643fc49c396c1ab10b4f7b9bd2d939628","amp;dn":"PublicDisgrace--PD-40593+Alexa+Nasha%2C+Silvia+Rubi%2C+Steve+Holmes+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b45ee3d643fc49c396c1ab10b4f7b9bd2d939628","infoHashBuffer":{"type":"Buffer","data":[180,94,227,214,67,252,73,195,150,193,171,16,180,247,185,189,45,147,150,40]},"announce":[],"urlList":[]}}