{"title":"Sexually Broken--Little Chastity Lynn is roughly fucked in pink!","uid":8092325,"size":1293839387,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:b5531224d9dbfb6155df1d36c38d92cb4b6f0ff3&amp;dn=Sexually+Broken--Little+Chastity+Lynn+is+roughly+fucked+in+pink%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"merzedes","files":-1,"time":1359748806,"description":"Little Chastity Lynn is roughly fucked in pink! Deep skull fucking, brutal orgasms! So Helpless! | Chastity Lynn | Matt Williams\n\nFebruary 1, 2013 \n \n    \nMP4 only\n\n \nSexy little Chastity Lynn is back and she brought her cute sleep wear with her. Chastity has that innocent look, a criminally cute smile, and a body and booty worth going to war over.\n\nChastity is bound in homemade custom stocks and blindfolded. She looks so cute in pink. The only thing that would make her look cuter is her own drool and spit running down her sexy helpless body. \n\nHard cock enters middle stage: She hears the footsteps, but can't see. She feels the head of the cock push on her lips, a feeling she is well accustomed to. The cock slides into her mouth and pushes to the very back of her throat. It starts slowly, then builds to a heroic throat fucking. Chastity can't move, her mouth is being fucked like a pussy. All the way out, all the way in, deep down her little throat. We hold it there. Hold it for long spells at a time. In the end Chastity is a drooling mess, dazed and dizzy. We have skull fucked her into subspace.\n\nWe pull her up and lock her ankles into wooden stocks, keeping her sexy legs well spread. She is perfectly stuck in a bent over &quot;fuck me&quot; position with no hope for escape. Chastity's perfect ass is just begging for attention, sticking out like that. We pull aside her cute little panties and slide the hard cock balls deep with the first thrust, she is that wet. Within seconds of a hard deep fucking Chastity is cumming all over that hard cock. She can't help it, none of them can after the foreplay that led up to this.\n\nWe pull Chastity's panties down to her knees, she looks so cute, all helpless and wanting cock. We continue the rough pounding, the cock fucking our girl in pink to several loud orgasms. We want to really wreck this girl so we bring out the vibrator and make her cum over and over. She begs for us to stop making her cum, her body is not hers to control anymore, it is ours and we love making girls cum until they can't remember their own name... \n \nScreens   &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/02_01chastity3/SexuallyBroken-Chastity-Lynn-Matt-Williams-Little-Chastity-Lynn-is-roughly-fucked-in-pink-Deep-skull-fucking-brutal-orgasms-So-Helpless.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/02_01chastity3/SexuallyBroken-Chastity-Lynn-Matt-Williams-Little-Chastity-Lynn-is-roughly-fucked-in-pink-Deep-skull-fucking-brutal-orgasms-So-Helpless.php&lt;/a&gt;\n\n9000 uploads and counting, 10k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:b5531224d9dbfb6155df1d36c38d92cb4b6f0ff3","amp;dn":"Sexually+Broken--Little+Chastity+Lynn+is+roughly+fucked+in+pink%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5531224d9dbfb6155df1d36c38d92cb4b6f0ff3","infoHashBuffer":{"type":"Buffer","data":[181,83,18,36,217,219,251,97,85,223,29,54,195,141,146,203,75,111,15,243]},"announce":[],"urlList":[]}}