{"title":"Joan Jett &amp; The Blackhearts - Little Liar (2nafish)","uid":5728678,"size":137129988,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b590f3f8c6c3b317f651db0141f5a69bce337555&amp;dn=Joan+Jett+%26+The+Blackhearts+-+Little+Liar+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1280567430,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nUp Your Alley was a 1988 studio album by the American hard rock band Joan Jett and the Blackhearts. This album contains the single &quot;I Hate Myself for Loving You&quot;, which reached #8 on the Billboard Hot 100, and had been used as the theme song for Sunday Night Football NFL games in America (with altered lyrics, by two singers) during the 2006 and 2007 seasons. The follow-up single &quot;Little Liar&quot; continued Joan's chart success, reaching #19 on The Billboard Hot 100 in late 1988, early 1989.\n\nUp Your Alley peaked at #19 on the Billboard 200 album charts.\n\nJoan Jett (born Joan Marie Larkin; September 22, 1958) is an American rock guitarist, singer, songwriter, producer and actress.\n\nShe is best known for her work with Joan Jett &amp; the Blackhearts including their hit cover &quot;I Love Rock 'n' Roll&quot;, which was #1 on the Billboard charts from March 20 to May 1, 1982, as well as for their other popular recordings including &quot;Crimson and Clover,&quot; &quot;I Hate Myself for Loving You,&quot; &quot;Do You Want to Touch Me,&quot; &quot;Light of Day,&quot; &quot;Love Is All Around,&quot; &quot;Bad Reputation,&quot; and &quot;Little Liar.&quot;\n\nHer musical and songwriting approach is heavily influenced by the hard-edged, hard beat-driven rhythms common to many rock bands of her native Philadelphia, often featuring lyrics surrounding themes of lost love, criticisms of insincerity, the quest for authenticity, the struggles and resolutions of the American middle class.\n\nIn 1997 Joan Jett was featured on the We Will Fall: The Iggy Pop Tribute record. She performed a cover of the Johnny O'Keefe song &quot;Wild One&quot; (or &quot;Real Wild Child&quot;).\n\nJett was an executive producer for the film The Runaways, which chronicled the Runaways' career. Floria Sigismondi, who directed videos for Marilyn Manson, the White Stripes and David Bowie, wrote and directed. Production of the movie began filming around Twilight's Kristen Stewart filming schedule (i.e. of the sequels New Moon and Eclipse). Stewart played Joan Jett in the film. In order to prepare for the role, Stewart met Jett around the 08/09 New Year. In an interview, Stewart revealed that she hopes to be able to sing some of the songs in the film. The film explores the friendship and falling out between Jett and Runaways lead singer, Cherie Currie, played by Dakota Fanning, and premiered at the 2010 Sundance Film Festival on Jan. 24, 2010.\n\nMarch saw the release of a 2-CD Greatest Hits album with 4 newly rerecorded songs, 3 of which are Runaways hits, and one a track from her I Love Rock 'N' Roll album. March 2010 also saw the release of a hardcover biography and picture book, spanning her career from the Runaways to the present day. She is also touring in Lewiston Idaho's Rockin on the river.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:b590f3f8c6c3b317f651db0141f5a69bce337555","amp;dn":"Joan+Jett+%26+The+Blackhearts+-+Little+Liar+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b590f3f8c6c3b317f651db0141f5a69bce337555","infoHashBuffer":{"type":"Buffer","data":[181,144,243,248,198,195,179,23,246,81,219,1,65,245,166,155,206,51,117,85]},"announce":[],"urlList":[]}}