{"title":"The Fugitive S01E01 Fear in a Desert City DVDRip DivX","uid":4254113,"size":419707089,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b607a693ce5201531dfa7efac54e6acb66c33405&amp;dn=The+Fugitive+S01E01+Fear+in+a+Desert+City+DVDRip+DivX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"circlensess","files":4,"time":1214156580,"description":"The Fugitive, ABC, September 1963-August 1967\nDr. Richard Kimble (David Janssen), wrongly accused of murdering his wife, escapes custody while en route to Death Row and must elude police and Lt. Philip Gerard (Barry Morse), who is obsessed with his capture. Kimble must constantly relocate and change his name while he continues his quest to find the real killer, a one-armed man (Bill Raisch) he saw leave the scene of the crime. The finale was the most-watched episode of all-time until the final episode of &quot;M*A*S*H.&quot; \n\nNot unlike the Western hero, which U.S. television had embraced since the 1950s, Kimble had the appeal of the rootless wanderer whose commitments to jobs, women or society were temporary, yet who at the same time deserved our sympathy as something of a tragic figure. The series&amp;#039; and the introspective character&amp;#039;s success lay largely with the appeal of actor David Janssen&amp;#039;s intensity in the part. The drama of the stories came not so much from the transient occupations of the fleeing hero, but from the dilemma of the Kimble character himself, something Janssen was able to convey with an almost nervous charm. ABC had wanted to renew the series for a fifth season, but Jansen declined, exhausted from the rigors of the previous four years. While other series with similar themes followed it is to The Fugitive&amp;#039;s credit that it remains one of the more fondly remembered of the 1960s drama series.\n\nPremiering on ABC on Tuesday 17 September 1963, The Fugitive went on to present some of the most fascinating human condition dramas of that decade, all told in a tight, self-contained semi-documentary style. By its second season the program was number 5 in the ratings (27.9) and later received an Emmy award for Outstanding Dramatic Series of 1965. For its fourth and final season the program was produced in color, having enjoyed three years of suitably film noir-like black and white photography, ending on a high note that drew the highest TV audience rating (72 percent) up to that time. Popularly known as the longest chase sequence in television history, The Fugitive ran through 118 episodes before a climactic two-part episode brought this highly regarded series to a close--with all the fundamental story strands concluded. The wrap-up ending was a rather rare and unusual decision on behalf of the producers as well as something of a television &quot;first&quot;. \nwww.tvguide.com, www.fiftiesweb.com, www.tv.com, Tise Vahimagi, imdb, Wikipedia, and other sources.\n\nThe Fugitive Season 1 (1963)\nS01E01 Fear in a Desert City\nFirst aired: 9/17/1963 \nRichard Kimble Kimble is an innocent man accused of murdering his wife. Kimble rides into Tucson, Arizona under the name James Lincoln, and checks into a hotel. He finds a job as a bartender at the Branding Iron, and meets the piano player Monica Welles, who has escaped from her stalking jealous husband Ed Welles. Vera Miles, Brian Keith guest star.\nCast: David Janssen as Dr. Richard Kimble, Barry Morse as Lt. Philip Gerard, Bill Raisch as Fred Johnson (The One-Armed Man), Diane Brewster (flashbacks) as Helen Kimble, J.D.Cannon as Lloyd Chandler, William Conrad as Narrator (voice)\nGuest cast: Harry Townes (Sgt. Burden), Dabbs Greer (Sgt. Fairfield), Paul Birch (Captain Carpenter , Vera Miles (Monica Welles), Brian Keith (Edward Welles), Bryan O&amp;#039;Byrne (Ticket Agent), Donald Losby (Mark Welles), Abigail Shelton (Evelyn), Barney Phillips (Cleve Brown) \nDVD&gt;DivX/640x480/984kbps/23.976fps/mp3/48KHz/stereo/102Kbps/50min/400Mb","torrent":{"xt":"urn:btih:b607a693ce5201531dfa7efac54e6acb66c33405","amp;dn":"The+Fugitive+S01E01+Fear+in+a+Desert+City+DVDRip+DivX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b607a693ce5201531dfa7efac54e6acb66c33405","infoHashBuffer":{"type":"Buffer","data":[182,7,166,147,206,82,1,83,29,250,126,250,197,78,106,203,102,195,52,5]},"announce":[],"urlList":[]}}