{"title":"UDEMY HAPPINESS ESSENTIAL SECRETS TO A FULLER LIFE TUTORIAL","uid":12044710,"size":357452549,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:b67b25fa12b9ae695b5da1614c04e7caf2907111&amp;dn=UDEMY+HAPPINESS+ESSENTIAL+SECRETS+TO+A+FULLER+LIFE+TUTORIAL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"RandalPaul","files":38,"time":1434868604,"description":"UDEMY HAPPINESS ESSENTIAL SECRETS TO A FULLER LIFE TUTORIAL\n\n\nWhat are the requirements?\n\n* Material in this course has helped thousands of people around the world. This is the first time we are offering our program on Udemy. Our experience indicates that the best results come from those who practice and apply the material on a regular basis. This course was intentionally developed without fancy, high-tech approaches, because the material is meant to be experienced in a way that is accessible to anyone who desires growth. We do strongly recommend that if you aren't certain whether you will 'do the work', contact us with your questions prior to purchasing. Enjoy and we LOVE to hear from our students!\n\nWhat am I going to get from this course?\n\n* Over 37 lectures and 2.5 hours of content!\n* Over 40 lectures on The Science of Happiness, habit formation, willpower and goal setting. Discover how to achieve sustainable happiness by practicing the exercises to experience massive shifts in your relationships, leadership, parenting, coaching, counseling and personal and business goals. Develop a greater level of energy and a driven sense of optimism. Use your emotions to achieve results as opposed to allowing negativity or pessimism to derail your best intentions.\n\nWhat is the target audience?\n\n* Are you wanting to experience greater levels of overall satisfaction in life? This class is for parents who want to help their children flourish, teachers who want to make an even greater impact on students, coaches who want to 'stand-out' from the coaching competition, leaders responsible for workplace results, self-improvement learners ready for the next step in their development","torrent":{"xt":"urn:btih:b67b25fa12b9ae695b5da1614c04e7caf2907111","amp;dn":"UDEMY+HAPPINESS+ESSENTIAL+SECRETS+TO+A+FULLER+LIFE+TUTORIAL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b67b25fa12b9ae695b5da1614c04e7caf2907111","infoHashBuffer":{"type":"Buffer","data":[182,123,37,250,18,185,174,105,91,93,161,97,76,4,231,202,242,144,113,17]},"announce":[],"urlList":[]}}