{"title":"All In with Chris Hayes 10-29-13.mp4","uid":9123240,"size":171529810,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b7466de5d58efd03da260e8dddd676016704983f&amp;dn=All+In+with+Chris+Hayes+10-29-13.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"liberal42","files":1,"time":1383172345,"description":"All In with Chris Hayes; October 29th, 2013.\n\nHouse Republicans predictably railed against the Obamacare exchanges in a hearing on the implementation of the Affordable Care Act Tuesday morning - apparently without realizing they were also criticizing a plan from their own side. Rep. Paul Ryan's budget would put in place the same kind of exchange system created by the ACA that GOPers find so offensive. Governor Deval Patrick of Massachusetts, where exchanges were first put into effect seven years ago, and Sam Seder, Host of the online podcast Majority Report and co-host of the Ring of Fire radio show, joined Chris Hayes to talk about this latest Republican hypocrisy.\n\nState Senator Nina Turner of Ohio also joined Hayes to talk about Ohio Governor John Kasich's recent discovery that his party is waging a war on the poor. Welcome to the new GOP, Governor.\n\nLater, Chris Hayes talked with Rep. Jeff Denham of California about the latest on the Democrats' push to pass comprehensive immigration reform. The Democrats' bill just got its second Republican supporter Tuesday in Rep. Ileana Ros-Lehtinen of Florida.\n\nPlus: On the anniversary of Superstorm Sandy, Rep. Hakeem Jeffries of New York, Nathalie Allegre, Coordinator at Alliance for a Just Rebuidling, and Radley Horton, Climate Scientist at Columbia University Earth Institute, member of Mayor Bloomberg's Special Initiative for Rebuilding and Resiliency, and consultant on the upcoming Showtime docu-series Years of Living dangerously, joined the table for a conversation about inequality and the growing frequency of climate change-related catastrophes. \n\nAdam Gordon, Staff Attorney at the Fair Share Housing Center, and Rep. Rush Holt of New Jersey also joined Hayes to talk about how New Jersey Governor Chris Christie doesn't deserve all the praise he received after Sandy hit.\n\nNot sure on future uploads beyond this week (dry run).\n\n","torrent":{"xt":"urn:btih:b7466de5d58efd03da260e8dddd676016704983f","amp;dn":"All+In+with+Chris+Hayes+10-29-13.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b7466de5d58efd03da260e8dddd676016704983f","infoHashBuffer":{"type":"Buffer","data":[183,70,109,229,213,142,253,3,218,38,14,141,221,214,118,1,103,4,152,63]},"announce":[],"urlList":[]}}