{"title":"Smith Micro PoserFusion 2012 SR3 LightWave v4.0 (32-64 bit) with","uid":7835808,"size":17597548,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b7589c807ba0998e925c21b5a773c4984d5b64b5&amp;dn=Smith+Micro+PoserFusion+2012+SR3+LightWave+v4.0+%2832-64+bit%29+with&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TorDigger","files":4,"time":1353185910,"description":"PoserFusion plug-ins\n\nPoserFusion plug-ins are perfect for industrial and architectural design, pre-visualization, theatrical set design, gaming prototype development, storyboarding, illustration and animation. PoserFusion will enable you to add 3D Poser characters to any project, saving you time and resources.\n\nThe family of PoserFusion plug-ins transform Poser Pro 2012 into a character animation solution, creating a pipeline that will transport Poser scenes into 3ds Max, Maya, CINEMA 4D and LightWave. PoserFusion will allow you to host and render full Poser scenes, including all their 3D elements such as clothing and hair within these powerful pro applications. Integrate either static or animated Poser figures with Vertex Weight Map rigging and dynamics that are fully textured and posable, with full morph targets for facial expression and body sculpting morphs.\n\nYour purchase of Poser Pro 2012 qualifies you to download a full set of the latest PoserFusion 2012 plug-ins for 3ds Max (Win), Maya (Mac &amp; Win), CINEMA 4D (Mac &amp; Win) and LightWave (Mac &amp; Win). PoserFusion serial numbers for each version were provided with your Poser Pro 2012 application serial number.\n\nThe Poser Pro 2012 manual, located in your Poser Pro 2012 program directory includes details on how to install PoserFusion plug-ins and work with Poser content in the host applications listed above. You will need to enter your serial number for each specific version of PoserFusion when you first launch the plug-in.\n\nThe Poser team at Smith Micro is committed to:\n\nDelivering support for the currently available* versions of the host applications listed above, throughout Poser Pro 2012's availability on the Smith Micro website.\nProvide updates as soon as practical to PoserFusion 2012 plug-ins with support for new versions of the host applications released throughout Poser Pro 2012's active development schedule.\nsupporting legacy versions of the host applications as long as technically feasible.\n\nHomepage: http://poser.smithmicro.com/poserfusion.html\n\nInstallation Instructions:\n\n1. Install program.\n2. Use given key to register application.\n3. Done, Enjoy.","torrent":{"xt":"urn:btih:b7589c807ba0998e925c21b5a773c4984d5b64b5","amp;dn":"Smith+Micro+PoserFusion+2012+SR3+LightWave+v4.0+%2832-64+bit%29+with","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b7589c807ba0998e925c21b5a773c4984d5b64b5","infoHashBuffer":{"type":"Buffer","data":[183,88,156,128,123,160,153,142,146,92,33,181,167,115,196,152,77,91,100,181]},"announce":[],"urlList":[]}}