{"title":"Marillion - Kayleigh","uid":4638627,"size":52105634,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b788916c7b453c02f06cb8e2fae9b554eee85c1e&amp;dn=Marillion+-+Kayleigh&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Blindpew","files":-1,"time":1231639055,"description":"Video Promo\n640x480\nxvid-tvrip\n\nKayleigh&quot; was a number 2 UK hit for British prog rock band Marillion in 1985. It remains the group's most successful single in terms of chart position. The single was kept from the UK Number 1 spot by charity single &quot;You'll Never Walk Alone&quot; by supergroup The Crowd in the summer of 1985. It made number 16 on the Dutch Top 40. &quot;Kayleigh&quot; is also the band's sole appearance on the Billboard Hot 100, hitting #74 in 1986.\nAlthough the lead singer and lyricist of the band, Fish, had at one point dated a woman whose forenames were Kay Lee, the song was more a compilation of several different women with whom he had had relationships.\nFish has said that his writing the song was 'his way of apologising to some of the women he had dated in the past.\n\nLyrics:\nDo you remember chalk hearts melting on a playground wall\nDo you remember dawn escapes from moon washed college halls\nDo you remember the cherry blossom in the market square\nDo you remember I thought it was confetti in our hair\nBy the way didnt I break your heart?\nPlease excuse me, I never meant to break your heart\nSo sorry, I never meant to break your heart\nBut you broke mine\n\nKayleigh is it too late to say Im sorry?\nAnd kayleigh could we get it together again?\nI just cant go on pretending that it came to a natural end\n\nKayleigh, oh I never thought Id miss you\nAnd kayleigh I thought that wed always be friends\nWe said our love would last forever\nSo how did it come to this bitter end?\n\nDo you remember barefoot on the lawn with shooting stars\nDo you remember loving on the floor in belsize park\nDo you remember dancing in stilettoes in the snow\nDo you remember you never understood I had to go\nBy the way, didnt I break your heart?\nPlease excuse me, I never meant to break your heart\nSo sorry, I never meant to break your heart\nBut you broke mine\n\nKayleigh I just wanna say Im sorry\nBut kayleigh Im too scared to pick up the phone\nTo hear youve found another lover to patch up our broken home\n\nKayleigh Im still trying to write that love song\nKayleigh its more important to me now youre gone\nMaybe it will prove that we were right\nOr ever prove that I was wrong\n","torrent":{"xt":"urn:btih:b788916c7b453c02f06cb8e2fae9b554eee85c1e","amp;dn":"Marillion+-+Kayleigh","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b788916c7b453c02f06cb8e2fae9b554eee85c1e","infoHashBuffer":{"type":"Buffer","data":[183,136,145,108,123,69,60,2,240,108,184,226,250,233,181,84,238,232,92,30]},"announce":[],"urlList":[]}}