{"title":"Zebra - The Best Of: In Black &amp; White [1998][320 KBPS]","uid":7869609,"size":180375923,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b92a67e02781d76da275e2e4d342b33f30b71fd8&amp;dn=Zebra+-+The+Best+Of%3A+In+Black+%26amp%3B+White+%5B1998%5D%5B320+KBPS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"LameDuck69","files":21,"time":1354160675,"description":"Zebra - The Best Of: In Black &amp; White [1998]\n\n\n\n\n\n01. Tell Me What You Want  \n02. But No More  \n03. Better Not Call  \n04. Bears  \n05. The La La Song  \n06. Lullaby  \n07. Hard Livin' Without You  \n08. One More Chance (1987 Workshoppe Demo)  \n09. Children Of The Heart (Unreleased From 3.5 Sessions)  \n10. Time  \n11. Take Your Fingers From My Hair (1978 Workshoppe Demo)  \n12. Wait Until The Summer's Gone  \n13. Riverside (3.5 Pre-Production Demo)  \n14. As I Said Before  \n15. Who's Behind The Door  \n16. Your Mind's Open  \n\n\n\n\n320 KBPS\n\nCover Art\n\n\n\n\n\n\nFrom Wikipedia:\n\n\nZebra is a hard rock band founded in 1975 in New Orleans, Louisiana. It features Randy Jackson (guitar and vocals), Felix Hanemann (bass, keyboards and vocals) and Guy Gelso (drums and vocals). Their mainstream debut on Atlantic Records was in 1983 with their eponymous album, highlighted by the singles &quot;Tell Me What You Want&quot; and &quot;Who's Behind The Door&quot;. Zebra got their start on the US East Coast club circuit, frequently playing at clubs on Long Island, NY.\n\nZebra started their career by playing covers of Led Zeppelin, The Moody Blues and Rush songs; it was their early fans' reaction to their Led Zeppelin renditions that helped convince the band to bring their act to New York. They had introduced their original material into their cover sets years before they were signed to Atlantic Records, including &quot;The La La Song&quot;, &quot;Free&quot; and &quot;Bears&quot; (originally entitled &quot;The Bears are Hibernating&quot;).\n\nZebra had been noticed by local colleges and even had some of their early original performances recorded by Long Island FM radio station WBAB, culminating in the inclusion of one of their songs on a release of &quot;WBAB Homegrown Album&quot;, which commemorated some of the station's best local acts and performances culled from their on-air &quot;Homegrown Hour&quot; program.\n\nThe band continued to tour throughout the 1980s but put a temporary hold in the early 1990s after being dropped by Atlantic Records. Randy Jackson formed his solo band, Randy Jackson's China Rain, and released its only album in the year 1993. Zebra finally reunited in 1997 and released Zebra IV in 2003, their first album of all-new material since 1986. A DVD of recent live performances, mostly from a show at the House of Blues in New Orleans, was released in the summer of 2007.\n\nOn July 10, 2010, during their 35th-anniversary performance at New Orleans' Mahalia Jackson Theater, Zebra was inducted into The Louisiana Music Hall of Fame.\n\n\n\n","torrent":{"xt":"urn:btih:b92a67e02781d76da275e2e4d342b33f30b71fd8","amp;dn":"Zebra+-+The+Best+Of%3A+In+Black+%26amp%3B+White+%5B1998%5D%5B320+KBPS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b92a67e02781d76da275e2e4d342b33f30b71fd8","infoHashBuffer":{"type":"Buffer","data":[185,42,103,224,39,129,215,109,162,117,226,228,211,66,179,63,48,183,31,216]},"announce":[],"urlList":[]}}