{"title":"I.Ought.to.be.in.Pictures.1982-Neil.Simon.RARE.VHS-RIP.720x576_x","uid":11058596,"size":1662048332,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:b9acef054d7ed272a26187641daa446b7886eac2&amp;dn=I.Ought.to.be.in.Pictures.1982-Neil.Simon.RARE.VHS-RIP.720x576_x&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Herpitor","files":-1,"time":1411146444,"description":"I Ought to Be in Pictures [written by Neil Simon]\n\nMany people regard this movie as a forgotten gem and copies of it are extremely hard to get. It's never been released on DVD in the USA or UK, and the only DVD  release seems to be a Region 2 Italian disk priced at nearly Â£30 on Amazon.\n\nTo fill the gap I've ripped a copy from an old VHS tape recording of a TV broadcast. AFAIK this is the only torrent in existence, so PLEASE SEED IT if you care about preserving old movies.\n\nPlease accept that this is a VHS recording so it won't be as crisp as a DVD. The colours will be slightly muddy, the film somewhat grainy and the resolution won't be too sharp. And yes, that's how we used to watch stuff all the time back in 80s when VHS ruled the roost. However, it's perfectly watchable and I encoded it as 2000 kbps to try and keep the artefacts to a miminum.\n\nI have a VERY slow rural connection so can seed only for a limited time. Be grateful if some other seeders can help out ASAP before I hit my bandwidth limit. Must be a billion or so people with connections faster than mine...\n\n\nFilm Details:\n\nTitle: I Ought to Be in Pictures\n\nYear: 1982\n\nIMDB: http://www.imdb.com/title/tt0084109/\n\nStars: Walter Matthau, Ann-Margret, Dinah Manoff\n\nDirector: Herbert Ross\n \nRuntime: 1:42\n \nStoryline: Grandmother has nothing to say when Libby tells her that she is off to LA to look up Dad, a Hollywood screenwriter. Grandmother has been in a New York cemetery for six years and Dad has been out of Libby's life for 16 of her 19 years. Libby arrives in LA on a Tuesday and phones Dad the one night that Stephanie, who does Jane Fonda's hair, stays over. Stephanie is there the next morning when Libby decides she needs to tell her story face-to-face.\n \n \n\nTORRENT DETAILS\n \nLanguage: English\n \nVideo: MKV 25 fps 2000kbps\n \nAudio: MP3 48000Hz 128kbps\n \nSize: 1,623 MB\n \nResolution: 720 x 576\n \nSource: PAL VHS TAPE of a TV broadcast.\n \nConverted from uncompressed AVI with Any Video Converter","torrent":{"xt":"urn:btih:b9acef054d7ed272a26187641daa446b7886eac2","amp;dn":"I.Ought.to.be.in.Pictures.1982-Neil.Simon.RARE.VHS-RIP.720x576_x","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9acef054d7ed272a26187641daa446b7886eac2","infoHashBuffer":{"type":"Buffer","data":[185,172,239,5,77,126,210,114,162,97,135,100,29,170,68,107,120,134,234,194]},"announce":[],"urlList":[]}}