{"title":"Brainbox - Brainbox (1969)","uid":3402912,"size":131579804,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b9e4c2afdebb72ae55a4e71b1ee38b3e1f2b4723&amp;dn=Brainbox+-+Brainbox+%281969%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SimonTemplar","files":12,"time":1130614857,"description":"ToonDoof. This one is for you. A fresh cd rip. 320kb  (remastered 1996 including bonus tracks)\n\n\n(Most realistic is the last line)\nHolland's Brainbox was part of the Benelux Invasion consisting of Stockholm's ABBA, Shocking Blue from the Netherlands, Denmark's the Savage Rose, and, of course, Blue Swede, a convergence a bit more subtle than the British Invasion and spanning over a decade. While H.P. Lovecraft kept changing members around the drummer, this band would release a record with totally new people in 1972, that work entitled Parts. \nYet the original Brainbox does have qualities somewhat resembling the earlier H.P. Lovecraft, and is a worthwhile collection of musically diverse and eclectic performances. The decent liner notes call this &quot;progressive pop,&quot; and in some respects it is, though they shift gears from the Simon &amp; Garfunkel classic &quot;Scarborough Fair/Canticle&quot; to the 17-minute plus original &quot;Sea of Delight,&quot; and take lots of other directions in between. The Damned had a song called &quot;New Rose,&quot; which is where the French record label got its name, and there was the aforementioned Savage Rose, but Brainbox start the album with &quot;Dark Rose,&quot; a blend of Jethro Tull meets the Mothers of Invention. Brainbox ups the ante by sliding into Tim Hardin and a very credible cover of &quot;Reason to Believe&quot; a full two years before Rod Stewart would get a B-side hit with it (the original A-side of the &quot;Maggie Mae&quot; single), they pull off a chameleon-like change on this to become folk rockers. Casimirz Lux has a very appealing voice with a bit of Stewart's rasp, making &quot;Reason to Believe&quot; a highlight of the album. The liner notes credit Jimmy Smith for writing &quot;Baby, What You Want Me to Do,&quot; but the tracking properly gives it to Jimmy Reed, and his Top 40 1960 hit is as bluesy as you can get here, the band changing styles yet again and showing their grasp and appreciation of American music. From progressive rock to folk-rock to blues-rock to the folk-pop of Simon &amp; Garfunkel, who is to say they weren't rewriting Blind Faith's lengthy &quot;Do What You Like&quot; by way of &quot;Sea of Joy&quot; for their epic &quot;Sea of Delight&quot;? The album is a dense amalgam of sounds and themes from England and America, but is reverent in its borrowing and presentation. Brainbox's rendition of &quot;Summertime&quot; sounds like Deep Purple adding heavy keyboard sounds and slowing up the Billy Stewart 1966 hit reinvention of the Gershwin tune from Porgy &amp; Bess. Of course, Janis Joplin did it two years earlier than Brainbox and psychedelicized it with an immortal performance ? but a good song is a good song, and this is Jan Akkerman before he would give us &quot;Hocus Pocus&quot; from Focus, and that fact makes the album more than just a curiosity. Since these gents were so enamoured of American music, it seems credible that they took the Vanilla Fudge sound ? famous in Europe a year before it hit in America ? and put it on a Janis Joplin favorite. Released with five bonus tracks on CD, including additional versions of &quot;Sea of Delight,&quot; this is much more than the &quot;bargain bin&quot; item many American record buyers passed it off as. It's a real diamond in the rough. \n \nTracks \n      01   Dark Rose  5:20  \n      02   Reason to Believe  2:23  \n      03   Baby, What You Want Me to Do  2:36  \n      04   Scarborough Fair  6:26  \n      05   Summertime  4:22  \n      06   Sinner's Prayer  2:31  \n      07   Sea of Delight  16:58  \n      08   Down Man  [bonus track]  2:38  \n      09   Woman's Gone [bonus track]  4:14  \n      10   Sea of Delight [try-out] 1:05  \n      11   Sea of Delight [take-one]  2:51  \n      12   Amsterdam, the First Days [bonus track]  \n\n","torrent":{"xt":"urn:btih:b9e4c2afdebb72ae55a4e71b1ee38b3e1f2b4723","amp;dn":"Brainbox+-+Brainbox+%281969%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9e4c2afdebb72ae55a4e71b1ee38b3e1f2b4723","infoHashBuffer":{"type":"Buffer","data":[185,228,194,175,222,187,114,174,85,164,231,27,30,227,139,62,31,43,71,35]},"announce":[],"urlList":[]}}