{"title":"PowerStrip 3.80.625 - McFilthyNasty","uid":4894627,"size":1448011,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ba714e2e12e9ac62ffaeb4acca32895061385952&amp;dn=PowerStrip+3.80.625+-+McFilthyNasty&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mcfilthynasty","files":1,"time":1242248853,"description":"PowerStrip 3.80.625 \n\n\nPowerStrip provides advanced, multi-monitor, programmable hardware support to a wide range of graphics cards - from the venerable Matrox Millennium I to the latest ATI Radeon HD3800 series. It is in fact the only program of its type to support multiple graphics cards from multiple chipset vendors, simultaneously, under every Windows operating system from Windows 95 to the x64-bit edition of Vista. A simple menu that pops up from the system tray provides access to some 500 controls over your display hardware, including sophisticated color correction tools, period level adjustments over screen geometry, and driver independent clock controls. A powerful application profiler can detect when programs are launched and respond by activating specific display settings, gamma adjustments, performance switches and even clock speeds - returning everything to normal when the program closes. In-game gamma hotkeys let you light up the darkest hallways during game play, and hardware control over refresh rates - with floating point precision - ensure you're never stuck at just 60Hz no matter what OS you're using. A quick setup wizard gets you up and running with minimal fuss, extensive context-sensitive help is available for all controls, and live updates are supported to ensure you're always running the latest release. Finally, an assortment of system and productivity tools - among them, extensive diagnostics, PCIe and AGP device configuration, EDID decoding, desktop icon management, a system idle thread, Windows resource monitoring, an anti-burn-in orbiting option, physical memory optimization, an on-screen display, and the most advanced monitor support in the industry - round out the compact 1MB package.\n\n\n\n\nScanned Clean....\n\n\nKeep torrents alive - SEED http://thepiratebay.se/user/mcfilthynasty\n\nEnjoy\n\t","torrent":{"xt":"urn:btih:ba714e2e12e9ac62ffaeb4acca32895061385952","amp;dn":"PowerStrip+3.80.625+-+McFilthyNasty","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba714e2e12e9ac62ffaeb4acca32895061385952","infoHashBuffer":{"type":"Buffer","data":[186,113,78,46,18,233,172,98,255,174,180,172,202,50,137,80,97,56,89,82]},"announce":[],"urlList":[]}}