{"title":"Ali Sethi-The Wish Maker - [ePub] - Traitor","uid":9551529,"size":675798,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bb4ca075f0099a28d89459aa319935ca4aa6b9cf&amp;dn=Ali+Sethi-The+Wish+Maker+-+%5BePub%5D+-+Traitor&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Xetron","files":1,"time":1391274708,"description":"A major new international voice debuts with a sweeping story of love, friendship, and family ties that brings to life the turbulent world of modern Pakistan.\n\nThe unforgettable story of a fatherless boy growing up in a household of outspoken women, The Wish Maker is also a tale of sacrifice, betrayal, and indestructible friendship. Zaki Shirazi and his female cousin Samar Api were raised to consider themselves &quot;part of the same litter.&quot; Together they watched American television and memorized dialogue from Bollywood movies, attended dangerous protests, and formed secret friendships. In a household run by Zaki's crusading political journalist mother and iron-willed grandmother, it was impossible to imagine a future that could hold anything different for either of them.\n\nBut adolescence approaches and the cousins' fates diverge. Samar's unconventional behavior-in which Zaki has played the role of devoted helper-brings severe consequences for her, while Zaki is sent out to discover the world for himself. It is only after years of separation from Samar that he is forced to confront the true nature of happiness, selfhood, and commitment to those he loves most.\n\nChronicling world-changing events that have never been so intimately observed in fiction and brimming with unmistakable warmth and humor, The Wish Maker is the powerful account of a family and an era, a story that shows how, even in the most rapidly shifting circumstances, there are bonds that survive the tugs of convention, time, and history.","torrent":{"xt":"urn:btih:bb4ca075f0099a28d89459aa319935ca4aa6b9cf","amp;dn":"Ali+Sethi-The+Wish+Maker+-+%5BePub%5D+-+Traitor","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb4ca075f0099a28d89459aa319935ca4aa6b9cf","infoHashBuffer":{"type":"Buffer","data":[187,76,160,117,240,9,154,40,216,148,89,170,49,153,53,202,74,166,185,207]},"announce":[],"urlList":[]}}