{"title":"NBA.1990.Playoffs.ECF.G3.(26 may).DET.Pistons.vs.CHI.Bulls","uid":6773156,"size":710024350,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:bbe3a5d22e0087761a65faf4c763bcc93217d94f&amp;dn=NBA.1990.Playoffs.ECF.G3.%2826+may%29.DET.Pistons.vs.CHI.Bulls&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Nepotu","files":1,"time":1319637966,"description":"NBA 1990 Playoffs - Eastern Conference Finals\n\nGame 3 - (1990.05.26):\n\n\nDETROIT Pistons (1) vs. CHICAGO Bulls (3)\n\n\nThe rip is from CBS Sports (USA)\n\nVideo format: 288p\n\nRosters:\n--------\nCHI Bulls: 10. B.J. Armstrong, 24. Bill Cartwright, 22. Charles Davis, 54. Horace Grant, 15. Jack Haley, 14. Craig Hodges, 23. Michael Jordan, 34. Stacey King, 11. Clifford Lett, 45. Ed Nealy, 5. John Paxson, 32. Will Perdue, 33. Scottie Pippen, 42. Jeff Sanders, Coach: Phil Jackson\n\nDET Pistons: 23. Mark Aguirre, 20. William Bedford, 4. Joe Dumars, 53. James Edwards, 33. Dave Greenwood, 35. Scott Hastings, 12. Gerald Henderson, 15. Vinnie Johnson, 3. Stan Kimbrough, 40. Bill Laimbeer, 35. Ralph Lewis, 10. Dennis Rodman, 22. John Salley, 11. Isiah Thomas, Coach: Chuck Daly\n\n\nA little bit of All Star Game history:\n\nAll Star Game 1968 (23 january)\n-------------------------------\nNEW YORK - Madison Square Garden (New York)\n\nEast - West 144-124 (37-25, 27-34, 37-32, 43-33)\n----\n\nEast: Jerry Lucas (CINCINNATI Royals-5), Willis Reed (NEW YORK Knicks-4), Wilt Chamberlain (PHILADELPHIA 76ers-9), Dave Bing (DETROIT Pistons-1), Oscar Robertson (CIN-8), Dick Barnett (NYK-1), Dave DeBusschere (DET-3), John Havlicek (BOSTON Celtics-3), Bill Russell (BOS-11), Gus Johnson (BALTIMORE Bullets-2), Sam Jones (BOS-5), Hal Greer (PHI-8), Coach: Alex Hannum (PHI)\n\nWest: Bob Boozer (CHICAGO Bulls-1), Elgin Baylor (LOS ANGELES Lakers-9), Zelmo Beaty (ST. LOUIS Hawks-2), Lenny Wilkens (STL-5), Jerry West (LAL-8), Bill Bridges (STL-2), Rudy LaRusso (SAN FRANCISCO Warriors-3), Don Kojis (SAN DIEGO Rockets-1), Archie Clark (LAL-1), Clyde Lee (SFW-1), Walt Hazzard (alias Mahdi Abdul-Rahman) (SEATTLE SuperSonics-1), Jim King (SFW-1), Nate Thurmond (SFW-4 injured), Coach: Bill Sharman (SFW)\n\nMVP ASG: Hal Greer (SYR)\n\n\n\nAFTER DOWNLOAD, PLEASE SEED!!! FOR ALL'S BENEFITS!","torrent":{"xt":"urn:btih:bbe3a5d22e0087761a65faf4c763bcc93217d94f","amp;dn":"NBA.1990.Playoffs.ECF.G3.%2826+may%29.DET.Pistons.vs.CHI.Bulls","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bbe3a5d22e0087761a65faf4c763bcc93217d94f","infoHashBuffer":{"type":"Buffer","data":[187,227,165,210,46,0,135,118,26,101,250,244,199,99,188,201,50,23,217,79]},"announce":[],"urlList":[]}}