{"title":"POtHS - Conspiracy - 034 - The War on Kids","uid":8703144,"size":5726143981,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bbf0efab37a14f09f3f7a1f1572afe87c7fc9283&amp;dn=POtHS+-+Conspiracy+-+034+-+The+War+on+Kids&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"POtHS11","files":-1,"time":1374094739,"description":"PO t HS\n\nPouring Out the Holy Spirit\n\nPOtHS - Conspiracy - 034 - The War on Kids\n\n\n\nPOtHS Comment: They are doing this right before your very eyes...open your eyes, get free.  It is always The Banksters that Paid them to do it.\n\nDescription:  The War on Kids The Definitive Documentary on the Failure of the Public Education System:\nThis is a 2009 award winning, critically acclaimed documentary of the complete and utter failure of the public education system and United States demonization of home schoolers. To purchase a high quality DVD of this and to get more documentation on this subject, visit http://www.thewaronkids.com\n\nWhile several documentaries on schools have come out since The War on Kids, these films tend to be either propaganda for charter schools or look at symptoms without any appreciation or understanding of underlying issues. To be a great documentary, it is essential to do the necessary work and dig deeper to uncover the heart of the problems observed. The numerous failures and pathologies associated with school are predominantly due to it autocratic structure. Because no one wants to voluntarily relinquish power, this fundamental problem is never addressed or even recognized.\n---------------------------------------------------------------------------------------------------------------------\n\nThe Silent Scream:\nABORTION - THE SILENT SCREAM COMPLETE VERSION (with permission from APF). Republished with Permission from Roy Tidwell of American Portrait Films as long as the following credits are shown:\n\nVHS/DVDs Available\nAmerican Portrait Films\nCall 1-800-736-4567\nwww.amport.com\n\nThe Silent Scream Complete Version - Abortion as Infanticide\n\nDr. Bernard Nathanson's classic video that shocked the world. He explains the procedure of a suction abortion, followed by an actual first trimester abortion as seen through ultrasound. The viewer can see the child's pathetic attempts to escape the suction curette as her heart rate doubles, and a &quot;silent scream&quot; as her body is torn apart. A great tool to help people see why abortion is murder. The most important video on abortion ever made. This video changed opinion on abortion to many people.\n\nIntroduction by Dr. Bernard Nathanson, host. Describes the technology of ultrasound and how, for the first time ever, we can actually see inside the womb. Dr. Nathanson further describes the ultrasound technique and shows examples of babies in the womb. Three-dimensional depiction of the developing fetus, from 4 weeks through 28 weeks. Display and usage of the abortionists' tools, plus video of an abortionist performing a suction abortion. Dr. Nathanson discusses the abortionist who agreed to allow this abortion to be filmed with ultrasound. The abortionist was quite skilled, having performed more than 10,000 abortions. We discover that the resulting ultrasound of his abortion so appalled him that he never again performed another abortion.\n\n\nSeed long and Prosper with Blessings from our Father. I have prayed to The Father, to Bless all that Seed Long.\n\nThis is in memory of my Mom who passed at 11:44 pm PST ON 1-25-2011. Now she knows.\n\nJESUS: Believe this about Jesus to move on to Greener Pastures.\n\nBorn of a Virgin, He was killed for our transgressions, His blood was shed as a sacrifice to atone for my sins. He was buried and ROSE three days later, according to The Scriptures. Praise the Lord for HE HAS RISEN. I am now forgiven for my sins, past, present and future and can live on with the Lord in Eternity, forever.\n\nRAPtURE (My transportation outta here).\n\nThe Blessed Hope.  If you believe in The Rapture you better believe The Above Statement and that the Sacrificed Blood of Jesus, on the Cross paid for your sins and there is NOTHING Else you can do to gain Salvation, The GRACE of Christ did it ALL. Now you just have to believe that with all your Heart, Mind and Soul or Maybe Get Left Behind. All PAST, Present and Future Sins are Forgiven with Jesus. (I wouldn't PUSH That Future sin statement to much!!!)\n\nIn a moment, in the twinkling of an eye, at the last trump: for the trumpet shall sound, and the dead shall be raised incorruptible, and we shall be changed...\n\n&quot;And He will send forth His angels with A GREAT TRUMPET and THEY WILL GATHER TOGETHER His elect from the four winds, from one end of the sky to the other.\n\n&quot;Do not marvel at this; for an hour is coming, in which all who are in the tombs will hear His voice,  Then we who are alive and remain will be caught up together with them in the clouds to meet the Lord in The Air, and there we will be forever be with him...hmmm sounds like some of us might be Immortal. (Ask your preacher about that)\n\nMore Torrents in this series at http://conspiracyhub.com/membershares.php?it=41 ALL TORRENTS are RELEASED here FIRST!!! The First down loaders of my torrents get the Main Hookups on my SERVER. This will get lightning fast downloads, FOR FREE. (The High Speed download wholesalers are going to hate me)I upload to OVER 13 Torrent sites and this site is uploaded 1st.\n\nMay Yahweh Bless You as He has me. Seed long and Prosper from the Blessings of \nEphesians 5:11\n11 And have no fellowship with the unfruitful works of darkness, but rather reprove (expose) them.\n                                             \n\n       :thankyou:    :thankyou:   Thank You JESUS\n\n[center]\n","torrent":{"xt":"urn:btih:bbf0efab37a14f09f3f7a1f1572afe87c7fc9283","amp;dn":"POtHS+-+Conspiracy+-+034+-+The+War+on+Kids","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bbf0efab37a14f09f3f7a1f1572afe87c7fc9283","infoHashBuffer":{"type":"Buffer","data":[187,240,239,171,55,161,79,9,243,247,161,241,87,42,254,135,199,252,146,131]},"announce":[],"urlList":[]}}