{"title":"Duke Ellington - Centennial Collection [The Birthday Sessions] f","uid":7821475,"size":1284351000,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:bc2040cc1db30413675637d11536e4c0d9ad98a8&amp;dn=Duke+Ellington+-+Centennial+Collection+%5BThe+Birthday+Sessions%5D+f&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rambam1776","files":-1,"time":1352834116,"description":"Duke Ellington - The Centennial Collection - The Birthday Sessions\n\nHappy Birthday, Duke! The Birthday Sessions, Vols. 1-5\n\nThese five CDs of material, available separately or in a box, were cut at two successive birthday celebrations for Ellington in 1953 and 1954 at McElroy's Ballroom in Portland, OR. They capture Ellington during his period with Capitol Records, which is usually not regarded as one of his better eras, mostly because he and the label never really got on the same wavelength. That has nothing to do with what we hear on these recordings, which were engineered by the legendary Wally Heider, and, as a result, sound at least five years fresher technically. Everyone involved sounds a lot more comfortable and happy than they did playing on Bluebird's 1952 Seattle Concert release -- this is about as relaxed a live show as one could imagine, and there's lots of good work here by some of Ellington's 1940s alumni, like Cat Anderson (trumpet) and Jimmy Hamilton (clarinet, tenor), who were cheated of studio time by the Musicians' Union strikes. Ellington had no qualms in this setting about mixing his current and classic repertory, retreading old ground and rethinking hits from as far back as 20 years earlier, and having fun with it. Anderson, Harry Carney, Hamilton, Ray Nance, Paul Gonsalves, Russell Procope, and Britt Woodman are the main soloists, with Nance and Jimmy Grissom handling the singing. One also gets a hint of just how complex Ellington's situation during this period really was -- the fact that he performed &quot;Bunny Hop Mambo,&quot; one of those Capitol dance numbers that serious fans loathed, indicates that he took it seriously. Each disc runs approximately 45 minutes, making for more than 200 minutes of music, and at $7 list per disc, that's a bargain -- anyone owning Mosaic's Ellington Capitol box should have this set, and anyone disappointed with the Seattle Concert should try at least one volume. These shows came out of an even more difficult period, and they're very solid performances.","torrent":{"xt":"urn:btih:bc2040cc1db30413675637d11536e4c0d9ad98a8","amp;dn":"Duke+Ellington+-+Centennial+Collection+%5BThe+Birthday+Sessions%5D+f","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc2040cc1db30413675637d11536e4c0d9ad98a8","infoHashBuffer":{"type":"Buffer","data":[188,32,64,204,29,179,4,19,103,86,55,209,21,54,228,192,217,173,152,168]},"announce":[],"urlList":[]}}