{"title":"Bernard Lewis - Race and Slavery in the Middle East (mobi, epub)","uid":6927270,"size":8771660,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bc6618545b3550474000af352ec5b99760b38b6b&amp;dn=Bernard+Lewis+-+Race+and+Slavery+in+the+Middle+East+%28mobi%2C+epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":2,"time":1325550705,"description":"Race and Slavery in the Middle East: An Historical Enquiry\n\nFrom before the days of Moses up through the 1960s, slavery was a fact of life in the Middle East. Pagans, Jews, Christians, and Muslims bought and sold at the slave markets for millennia, trading the human plunder of wars and slave raids that reached from the Russian steppes to the African jungles. But if the Middle East was one of the last regions to renounce slavery, how do we account for its--and especially Islam's--image of racial harmony? How did these long years of slavery affect racial relations? In Race and Slavery in the Middle East, Bernard Lewis explores these questions and others, examining the history of slavery in law, social thought, and practice over the last two millennia.\n\nThis fascinating study describes the Middle East's culture of slavery and the evolution of racial prejudice. Lewis demonstrates how nineteenth century Europeans mythologized the region as a racial utopia in debating American slavery. Islam, in fact, clearly teaches non-discrimination, but Lewis shows that prejudice often won out over pious sentiments, as he examines how Africans were treated, depicted, and thought of from antiquity to the twentieth century.\n\n&quot;If my color were pink, women would love me/But the Lord has marred me with blackness,&quot; lamented a black slave poet in Arabia over a millennium ago--and Lewis deftly draws from these lines and others the nuances of racial relations over time. Islam, he finds, restricted enslavement and greatly improved the lot of slaves--who included, until the early twentieth century, some whites--while blacks occasionally rose to power and renown. But abuses ring throughout the written and visual record, from the horrors of capture to the castration and high mortality which, along with other causes, have left few blacks in many Middle Eastern lands, despite centuries of importing African slaves.\n\nRace and Slavery in the Middle East illuminates the legacy of slavery in the region where it lasted longest, from the days of warrior slaves and palace eunuchs and concubines to the final drive for abolition. Illustrated with outstanding reproductions of striking artwork, it casts a new light on this critical part of the world, and on the nature and interrelation of slavery and racial prejudice.\n\nAuthor: Bernard Lewis\nPublisher: Oxford University Press\nPublication Date: April 30, 1992\n\nFormats:\n.epub (compatible with Sony Reader, Cruz Reader, iPad, iPodTouch/iPhone, etc.)\n.mobi (compatible with Amazon Kindle, etc.)\n\nFree Calibre eBook reader: &lt;a href=&quot;\nhttp://calibre-ebook.com/download&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://calibre-ebook.com/download&lt;/a&gt;\n","torrent":{"xt":"urn:btih:bc6618545b3550474000af352ec5b99760b38b6b","amp;dn":"Bernard+Lewis+-+Race+and+Slavery+in+the+Middle+East+%28mobi%2C+epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc6618545b3550474000af352ec5b99760b38b6b","infoHashBuffer":{"type":"Buffer","data":[188,102,24,84,91,53,80,71,64,0,175,53,46,197,185,151,96,179,139,107]},"announce":[],"urlList":[]}}