{"title":"Ancient Books - All Rare collections of CODICES","uid":3595426,"size":609340347,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bc8413fda46a1f29c8c76e14b5f8fcf187b727c5&amp;dn=Ancient+Books+-+All+Rare+collections+of+CODICES&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"elifrac","files":44,"time":1168719392,"description":"WHAT IS A CODEX?\n\nJust as with modern books, paper was the most common material out of which codices were made. The Maya made paper from the inner bark of fig trees (Ficus), called kop? in Maya and today commonly known as amate paper. Although they also used deer skin, cotton cloth and maguey paper, apparently the Maya preferred kop?.\n\n    The paper measured several meters long and, as in the case of the three known Maya codices, measured about 20 centimeters wide. The large codices were folded like screens, covered with layer of starch, and then with a thin, white, calcium carbonate paste.\n\n    Each page was separated by a thick, red frame and then horizontal and vertical lines were painted to further separate texts. The remaining page was divided into several squares, inside of each was an ideogram, which had some relation to those in other boxes. Glyphs relating to each other were drawn in the sections. Subjects varied from religion, astronomy, agricultural cycles and history to prophecies. One or more themes occupied each page and in all cases, the contents related to the spiritual world.\n\nThis is great research material. see for yourself.\n\n","torrent":{"xt":"urn:btih:bc8413fda46a1f29c8c76e14b5f8fcf187b727c5","amp;dn":"Ancient+Books+-+All+Rare+collections+of+CODICES","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc8413fda46a1f29c8c76e14b5f8fcf187b727c5","infoHashBuffer":{"type":"Buffer","data":[188,132,19,253,164,106,31,41,200,199,110,20,181,248,252,241,135,183,39,197]},"announce":[],"urlList":[]}}