{"title":"Berlitz: Poland Pocket Guide","uid":10251682,"size":29153082,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c0477e24699a45b4cbbebf110810973f2f8af787&amp;dn=Berlitz%3A+Poland+Pocket+Guide&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"adip2007","files":-1,"time":1401359175,"description":"Berlitz Pocket Guide Poland combines snappy text with full-colour photography to highlight the very best that this remarkable country has to offer. The Where To Go chapter details all the key sights that you will not want to miss; from constantly evolving capital Warsaw, to the port town of Gdansk in the north and the country's artistic and spiritual heart of Krakow in the south. The What to Do chapter explores Poland's musical scene and opportunities to sample its famed vodka, whilst the Eating Out chapter investigates the local cuisine and provides a list of recommended restaurants for you to try. Top 10 Attractions and A Perfect Tour itinerary present inspiration for experiencing the very best of Poland. Background information about the turbulent history of the country and the character of its people is also provided to help you really understand the culture you have come to experience. Clear and detailed maps plot all the major sights, and the Travel Tips section offers practical advice on how to get there and where to stay.","torrent":{"xt":"urn:btih:c0477e24699a45b4cbbebf110810973f2f8af787","amp;dn":"Berlitz%3A+Poland+Pocket+Guide","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0477e24699a45b4cbbebf110810973f2f8af787","infoHashBuffer":{"type":"Buffer","data":[192,71,126,36,105,154,69,180,203,190,191,17,8,16,151,63,47,138,247,135]},"announce":[],"urlList":[]}}