{"title":"The Completely Mental Misadventures of Ed Grimley (1988&amp;ndash;19","uid":7481770,"size":2346352687,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c07759484a352b02284c70eab4fd927c7757dad3&amp;dn=The+Completely+Mental+Misadventures+of+Ed+Grimley+%281988%26ndash%3B19&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"treecheetaholo","files":-1,"time":1343454514,"description":"                                Description\nEdward Mayhoff 'Ed' Grimley is a fictional character created and portrayed by Martin Short. Developed amongst The Second City improv comedy troupe, Grimley made his television debut on the sketch comedy show SCTV in 1982, leading to popular success for both Short and the persona. Short continued to portray Grimley on Saturday Night Live and in various other appearances. The character also starred in the 1988 animated series The Completely Mental Misadventures of Ed Grimley.\n\n\n\n\n                                Episode List\n\n1 \t&quot;Tall, Dark and Hansom&quot; \t1988 September 10\nEd fills in for his cousin driving a hansom cab, and ends up in a horse race.\n\n2 \t&quot;Ed's Debut&quot; \t1988 September 17\nEd mistakenly thinks he is asked to play triangle for the philharmonic and on the way to the concert hall is arrested and imprisoned for a bank robbery he did not commit.\n\n3 \t&quot;E.G., Go Home&quot; \t1988 September 24\nEd and his friend Wendall go on an amusement park rocket ride, taking them to another planet which is ruled by an alien queen with a voice like Bette Davis.\n\n4 \t&quot;Ed's in Hot Water&quot; \t1988 October 1\nLooking after the apartment building for his landlady Deidre Freebus while she and her husband are on vacation, Ed causes a huge flood which sends him out to sea where he meets up with long, lost aviatrix Hillary Black Smythe, who acts and sounds like Kate Hepburn.\n\n5 \t&quot;Crate Expectations&quot; \t1988 October 8\nEd gets trapped in a crate while trying to get a birthday present for Miss Malone.\n\n6 \t&quot;Grimley, P.F.C.&quot; \t1988 October 15\nIn the wrong line to return a library book, Ed joins the army and ends up second banana to a Bob Hope-like USO performer (voiced by Dave Thomas).\n\n7 \t&quot;Moby Is Lost&quot; \t1988 October 22\nMoby, Ed's pet goldfish, is missing and Ed hires a television-obsessed sea captain to lead the search.\n\n8 \t&quot;Good Neighbor Ed&quot; \t1988 October 29\nEd wins a contest but to fulfill the contest rules he needs to take a picture of all of his neighbors.\n\n9 \t&quot;Driver Ed&quot; \t1988 November 5\nMiss Malone needs to learn how to drive and calls upon Ed to teach her.\n\n10 \t&quot;Blowin' in the Wind&quot; \t1988 November 12\nEd is caught up in the same tornado that sends Dorothy to Oz, only he ends up on the farm with Aunt Em and Uncle Henry where a traveling summer stock show, with a Jerry Lewis-like director, are hoping for a shot at Broadway.\n\n11 \t&quot;Eyewitness Ed&quot; \t1988 November 19\nNeeding hot dog franks for a party, Ed makes a run to the store, which resembles the Bates Motel, and witnesses Der Bingle rob the proprietor (voiced by Eugene Levy) for which he testifies and must go into the Witness Protection Program.\n\n12 \t&quot;Eddy, We Hardly Knew Ye&quot; \t1988 November 26\nNeeding his tonsils out, Ed goes into the hospital where his roommate is a werewolf (voiced by Christopher Guest).\n\n13 \t&quot;The Irving Who Came to Dinner&quot; \t1988 December 3\nIrving Cohen pays a visit and helps Ed reveal a couple of hucksters.","torrent":{"xt":"urn:btih:c07759484a352b02284c70eab4fd927c7757dad3","amp;dn":"The+Completely+Mental+Misadventures+of+Ed+Grimley+%281988%26ndash%3B19","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c07759484a352b02284c70eab4fd927c7757dad3","infoHashBuffer":{"type":"Buffer","data":[192,119,89,72,74,53,43,2,40,76,112,234,180,253,146,124,119,87,218,211]},"announce":[],"urlList":[]}}