{"title":"Neon Genesis Evangelion (1080P, Dual-lang, eng subs.)","uid":13222057,"size":49643769811,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:c0e1f886dd00a53ea7ac46440686a3f421c5972d&amp;dn=Neon+Genesis+Evangelion+%281080P%2C+Dual-lang%2C+eng+subs.%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HeadstrongWolf","files":44,"time":1452804842,"description":"It's been a minute since I've uploaded a torrent.\r\n\r\nThis is basically a re-encode of another upload done by user Sephirotic @ Nyaa.se (Thank you!)\r\n\r\nThe original files hosted on Nyaa.se had huge file sizes, with episodes ranging to about 3gb each or so. However, the reference frames were too high, meaning it couldn't be played on most devices. (Such as my PS3 via Movian.)\r\n\r\nI re-encoded the video for 4 reference frames, but did slow encoding to preserve whatever quality I could.*\r\n\r\nIncluded in this torrent are some preview screenshots. \r\nAbout 7 from the series, marked with each episode it's from. (Including the infamous episode 16.)3 From Rebirth, and 4 from 26' (The second half of End of Evangelion.)\r\n\r\n\r\nJapanese audio. English audio. The works.\r\nThere are 2 English tracks on each file. The first is the normal subtitles, the second is signs (like Japanese katakana or kanji being translated on screen, without character diologue.)\r\n(Please note that Death &amp; Rebirth only have Japanese audio w/ English subtitles.)\r\n\r\nSome of the files have 3 subtitle tracks instead of 2. If there are 3 on the file, I'm not sure what the 2nd English track is, but 1 is the original subtitle and 3 is the signs only. 2, I'll figure it out later, but I included it just in case.\r\n\r\n\r\nTHERE ARE MULTIPLE DUBS AND SUBS AVAILABLE TO DOWNLOAD AND ADD IF YOUR LANGUAGE IS NOT LISTED. (Sorry, I just wanted to keep the file size as low as possible.)\r\n\r\nAvailable dubs - German (I think?), Spanish\r\nAvailable subs - Chinese, English, German, Italian, Portuguese, Spanish.\r\n\r\nOnce again, special thanks to Sephirotic @ Nyaa.se\r\n\r\nAnd to all the leeches and seeders, CONGRATULATIONS. \r\n\r\n\r\n*Please ntoe that in some instances, video noise was purposely included in the frames, such as episodes 25 and 26, where there is a lot of noise grain.\r\n\r\n**The original film reel for Episode 16 was lost in a flood, so the version provided for us is an upscale from the DVD. Not terrible looking, but it has the lowest file size. (Obviously.) The largest file in the torrent is Death, which is nearly 6gb, while he rest are beyween 1gb and 2.5gb (Including EOE)\r\n\r\n***Episode 19 is listed as V2 because user Sephirotic made an edition of the episode where the color tones were corrected, as that specific episode had strange changes in temperatures. See the original post here. \nhttp://www.nyaa.se/?page=view&amp;tid=743589\r\n\r\n****Death and Rebirth are Japanese audio only with English subtitles, because this was the first time the original version of Death was released. Rebirth is included because it contains sharper visuals than the first half of End of Evangelion. (And minor aesthetic &amp; timing differences.)","torrent":{"xt":"urn:btih:c0e1f886dd00a53ea7ac46440686a3f421c5972d","amp;dn":"Neon+Genesis+Evangelion+%281080P%2C+Dual-lang%2C+eng+subs.%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0e1f886dd00a53ea7ac46440686a3f421c5972d","infoHashBuffer":{"type":"Buffer","data":[192,225,248,134,221,0,165,62,167,172,70,68,6,134,163,244,33,197,151,45]},"announce":[],"urlList":[]}}