{"title":"[PS3] LEGO Indiana Jones: The Original Adventures","uid":9354658,"size":5224358121,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:c1446b032fe7a70a11e5faf6bc5423e43f75ed90&amp;dn=%5BPS3%5D+LEGO+Indiana+Jones%3A+The+Original+Adventures&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"fuckface69","files":-1,"time":1387154692,"description":" &lt;a href=&quot;http://www.lucasarts.com/games/legoindianajones/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.lucasarts.com/games/legoindianajones/&lt;/a&gt;\n\nWhips, pits and bricks - Indiana Jones returns in an adventure that's been building for years.\n\nThe man with the hat is back - and ready to prove he's a chip off the old block thanks to LEGO. Set in his original cinematic adventures, LEGO Indiana Jones features a comedic and unique take on the trilogy of Indiana Jones and the Raiders of the Lost Ark, Indiana Jones and the Temple of Doom and Indiana Jones and the Last Crusade.\n\nUsing your wits and daring, you guide Indy through exciting locales such as the jungles of South America to the mountaintops of India, and familiar scenarios such as the well-known boulder run where the world famous and iconic archaeologist has to escape a giant - and now intentionally blockier - rolling colossus. Indiana's fear of snakes will also play a large part in the game, incapacitating the hero until the slithering nasty is removed.\n\nThankfully for Indy, he doesn't have to brave all of these perils alone. Over 60 different characters from the films' mythology can be interacted with, including Jones Senior, Mola Ram, Short Round, and Willie Scott - and each of their body parts can be mixed and matched to build your own jumbled-up creations.\n\n* Swim, climb, shimmy and more through the Indiana Jones universe, using Indy's signature whip to attack, disarm, swing and interact\n* Team up with a friend in co-operative mode to battle enemies and seek out the world's greatest treasures\n* Use character specific abilities including excavation by Satipo, an umbrella slide by Marcus Brody, and control over Marion Ravenwood's monkey","torrent":{"xt":"urn:btih:c1446b032fe7a70a11e5faf6bc5423e43f75ed90","amp;dn":"%5BPS3%5D+LEGO+Indiana+Jones%3A+The+Original+Adventures","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1446b032fe7a70a11e5faf6bc5423e43f75ed90","infoHashBuffer":{"type":"Buffer","data":[193,68,107,3,47,231,167,10,17,229,250,246,188,84,35,228,63,117,237,144]},"announce":[],"urlList":[]}}