{"title":"Just Before Dawn (1981) [Jeff Lieberman, DVDRip]","uid":9789094,"size":1566394368,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c2361ee88049447992462b15fd45be6c0e2767d3&amp;dn=Just+Before+Dawn+%281981%29+%5BJeff+Lieberman%2C+DVDRip%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"KoolDee","files":-1,"time":1395218854,"description":"Just Before Dawn (1981)\nGenre: Horror / Slasher\nCountry: USA | Director: Jeff Lieberman\nLanguage: English | Subtitles: None\nAspect ratio: Widescreen 1.85:1 | Length: 01:30:07\nDVDRip, Xvid, AVI - 720x400 - 23.976fps\n\nIncludes audio commentary by director Jeff Liebermann (second audio track)\n\n*******************************************************************************\n\nFive campers arrive in the mountains to examine some property they have bought, but are warned by the forest ranger Roy McLean that a huge machete-wielding maniac has been terrorising the area. Ignoring the warnings, they set up camp, and start disappearing one by one. If that sounds too run-of-the-mill, there's a genuinely shocking plot twist half-way through... \n\n1981's Just Before Dawn is one of the best tales of wilderness horror out there. It's one of the finest-made slashers of the 80's and it easily blows movies like The Final Terror, Don't Go in the Woods, or The Prey out of the water.\n\nA group of young adults come to check out the mountain property that one of the group has just bought. However they are not alone in the wild. A hulking in-bred murderer, who seems to be in two places at once, is lurking and apparently hates trespassers.\n\nDirector Lieberman, who gave us such great B films as Squirm (1976) and Blue Sunshine (1977), does an excellent job with this smart thriller as well. The movie is nicely atmospheric, with a creeping sense of tension and some strong suspense. This film makes even the open wilderness seem frighteningly claustrophobic. The Oregon locations are beautiful and well captured by the crafty cinematography. The music score is a true original and awesome in contrast with the scenic visuals.\n\nDeborah Benson makes for a great lead, her presence was captivating. Gregg Henry delivers a good performance as Benson's lover and Chris Lemon provides some occasional charisma. The supporting cast, especially veteran actor Kennedy, also does quite well.\n\nA true gem of the slasher genre, that needs no gore to thrill. Definitely well worth seeking out for slasher fans and horror buffs alike. See it!\n\n*******************************************************************************\n &lt;a href=&quot;\nhttp://i.imgur.com/NLtJi5w.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/NLtJi5w.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:c2361ee88049447992462b15fd45be6c0e2767d3","amp;dn":"Just+Before+Dawn+%281981%29+%5BJeff+Lieberman%2C+DVDRip%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2361ee88049447992462b15fd45be6c0e2767d3","infoHashBuffer":{"type":"Buffer","data":[194,54,30,232,128,73,68,121,146,70,43,21,253,69,190,108,14,39,103,211]},"announce":[],"urlList":[]}}