{"title":"The Secret Adventures of Jules Verne 1-2 [retrOtv]","uid":3993512,"size":734992431,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c254d9b084f92ddb1e6cad54590439a401792a19&amp;dn=The+Secret+Adventures+of+Jules+Verne+1-2+%5BretrOtv%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"flixer","files":3,"time":1201190890,"description":"The Secret Adventures of Jules Verne follows the journey of boyish young author and inventor Jules Verne as he thwarts the dastardly plans of The League of Darkness with help from his mentor, Phileas Fogg, and Fogg&amp;#039;s cousin, sexy secret agent Rebecca Fogg. Aided in their quests by Phileas&amp;#039; faithful valet Passepartout, the quartet brave danger as they travel, in the luxurious airship Aurora, into the pages of steampunk legend.\n\n\n\n1. In the Beginning    6/18/2000\nThe adventure begins. In Paris, Jules Verne (Chris Demetral), a student with the ambition of becoming a great novelist and playwright, unwittingly attracts the attentions of the League of Darkness and its leader, Count Gregory, with his visions of fantastic machines and ideas for the future. The League, hoping to use Jules&amp;#039; ideas for their own nefarious purposes, kidnaps Verne and tries to steal the images directly from his imagination. He is saved by British secret agent Rebecca Fogg (Francesca Hunt) who had been sent to Paris to find the very machine being used to extract the images from Jules. Meanwhile in London, Rebecca&amp;#039;s distant cousin, former secret agent Phileas Fogg (Michael Praed), has embarked on a life of gambling after the death of his father, Sir Boniface Fogg, former head of the British Secret Service. Unaware of the greater plan, Phileas &quot;wins&quot; the airship Aurora and her navigator, Passepartout (Michel Courtemanch), during a game of cards.\n\n2. Queen Victoria and the Giant Mole   6/25/2000\nUsing an idea stolen from Jules Verne (from In the Beginning), the League of Darkness construct a giant underground tunneling machine, the &quot;Mole.&quot; The League first kills a diplomat to get papers giving their own agent access to Queen Victoria, whom they plan to kill. While Rebecca goes to investigate the sewers where the Mole is, Phileas first believes that Jules was involved since one of his drawings was found in connection with the Mole. After a bit of slapping around, he eventually believes Jules and recruits him to help track down the Mole. Jules creates a series of tracking devices, but is then kidnapped by the Mole&amp;#039;s female commander. They still want him to assist them, and torture him when he doesn&amp;#039;t. Rebecca has figured out who the League&amp;#039;s agent is at the Queen&amp;#039;s meeting, and goes after him with the tracking device the League uses to guide the Mole to its victims. The agent is skewered on the Mole&amp;#039;s bore, and with the aid of a giant magnet created by Passepartout, Phileas pulls up the Mole and punches out the Commander. Jules gets the gratitude of the Queen and the four decided to stay together.\n\nLeave a comment if you&amp;#039;d like to see more! :)","torrent":{"xt":"urn:btih:c254d9b084f92ddb1e6cad54590439a401792a19","amp;dn":"The+Secret+Adventures+of+Jules+Verne+1-2+%5BretrOtv%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c254d9b084f92ddb1e6cad54590439a401792a19","infoHashBuffer":{"type":"Buffer","data":[194,84,217,176,132,249,45,219,30,108,173,84,89,4,57,164,1,121,42,25]},"announce":[],"urlList":[]}}