{"title":"Critical Companion to James Joyce: A Literary Reference to His L","uid":4711844,"size":5365652,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c26eff616d8a4d08dc1f6b157b4bfce49db5d4d7&amp;dn=Critical+Companion+to+James+Joyce%3A+A+Literary+Reference+to+His+L&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"timnehguy","files":2,"time":1234056799,"description":"Critical Companion to James Joyce: A Literary Reference to His Life and Work (2006), revised edition of James Joyce A to Z: The Essential Reference to His Life and Work (1995) - by A. Nicholas Fargnoli and Michael Patrick Gillespie\n\nPDF, 465 pages\n\nFargnoli, a theology and English professor at Molloy College, and Gillespie, a writer experienced with Joyce's works, have combined forces to bring forth a revised edition, with more than 40 % new or updated. Intended for the nonspecialist, the volume provides an introductory overview of Joyce's life and works.\n\nThe first part of the work is a biography of Joyce, with several black-and-white photographs. The second part, the bulk of the volume, is made up of entries for Joyce's works. Each entry contains a publishing history and commentary. There may also be overviews of chapters, critical analysis of major themes, profiles of characters, and excerpts from contemporary reviews. The third part is a dictionary of people, themes, characters, and places that had a direct influence on Joyce's life and works. The last part of the volume contains the appendixes, including a &quot;Chronological Bibliography of Joyce's Works and Adaptations&quot;; documents pertaining to Ulysses and Finnegans Wake; family trees; lists of periodicals and Web sites; a topical bibliography; and a good chronology of events during Joyce's lifetime.","torrent":{"xt":"urn:btih:c26eff616d8a4d08dc1f6b157b4bfce49db5d4d7","amp;dn":"Critical+Companion+to+James+Joyce%3A+A+Literary+Reference+to+His+L","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c26eff616d8a4d08dc1f6b157b4bfce49db5d4d7","infoHashBuffer":{"type":"Buffer","data":[194,110,255,97,109,138,77,8,220,31,107,21,123,75,252,228,157,181,212,215]},"announce":[],"urlList":[]}}