{"title":"Bullies_ A Friendship - Alex Abramovich","uid":13924002,"size":4420913,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c4e6c48d79c19213e6f1054f1fcac3b935898a83&amp;dn=Bullies_+A+Friendship+-+Alex+Abramovich&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mr_mando","files":3,"time":1458362365,"description":"The powerful account of one writer's unlikely friendship with his childhood bully, now the president of a motorcycle club in one of America's most dangerous cities.\r\n\r\nOnce upon a time, Alex Abramovich and Trevor Latham were mortal enemies: miniature outlaws in a Long Island elementary school, perpetually at each other's throats. Then they lost track of each other. Decades later, when they met again, Abramovich was a writer and Latham had become President of the East Bay Rats, a motorcycle club in Oakland.\r\n\r\nIn 2010, Abramovich moved to California to immerse himself in Latham's world - one of fight clubs, booze-filled nights, and beat-downs on the city's streets. But dangerous, dysfunctional Oakland was also becoming one of America's most rapidly gentrifying cities, and the questions Abramovich had arrived with were thrown into brutal relief: How do we live with the burden of violence? How do we overcome it? Do we overcome it?\r\n\r\nAs Trevor, the Rats, and the city they live in careen between crises and moments of renaissance, Abramovich explores issues of friendship, family, history, and destiny - and looks at what happens when those things fail. Bullies is at once a vivid, visceral narrative of an unusual friendship and an incisive portrait of a beautiful, terrible city","torrent":{"xt":"urn:btih:c4e6c48d79c19213e6f1054f1fcac3b935898a83","amp;dn":"Bullies_+A+Friendship+-+Alex+Abramovich","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4e6c48d79c19213e6f1054f1fcac3b935898a83","infoHashBuffer":{"type":"Buffer","data":[196,230,196,141,121,193,146,19,230,241,5,79,31,202,195,185,53,137,138,131]},"announce":[],"urlList":[]}}