{"title":"Naruto Episode 5 (480p)","uid":10732706,"size":40111805,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c511d64a94634313604a5fce46ea4f2f33d48a93&amp;dn=Naruto+Episode+5+%28480p%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"shareregi","files":2,"time":1407646336,"description":"After his sneak attack failed, Sasuke attempts to fight Kakashi before being buried up to his neck in earth. From there, Kakashi subjects Sakura to a genjutsu of Sasuke bleeding to death before dealing with Naruto when he decides to help himself to everyone's lunches. Once the time of the test is up, Naruto tied up to a pole, Kakashi deems all members of Team 7 utter failures as he reveals that his test was unpassable because the three lacked skills in team work. From there, Kakashi explains the essential need for ninja groups to work as a unit while stating his own ideal that while ninja who break the rules are scum, those who abandon their friends are worse than scum. From there, Kakashi offers to give Team 7 one final chance and leaves them with one order to follow: not to feed Naruto. However, knowing that they need Naruto at full strength for what Kakashi has in store for a make-up test, Sasuke and Sakura fed their friend. Having watched the entire event, Kakashi dramatically appears before them. As Kakashi apparently prepares to punish them all, Sakura stands up to him explains that they gave Naruto food because he's a member of their team. Ultimately, finding a group who actually met his test's standards, Kakashi reveals Team 7 have passed his test and accepts them as his students. ","torrent":{"xt":"urn:btih:c511d64a94634313604a5fce46ea4f2f33d48a93","amp;dn":"Naruto+Episode+5+%28480p%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c511d64a94634313604a5fce46ea4f2f33d48a93","infoHashBuffer":{"type":"Buffer","data":[197,17,214,74,148,99,67,19,96,74,95,206,70,234,79,47,51,212,138,147]},"announce":[],"urlList":[]}}