{"title":"Japan - Oil On Canvas 1983 [EAC - FLAC] (oan)","uid":4689824,"size":460636745,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c672de1f85622c4671a114113fc1bbc61f7a9f85&amp;dn=Japan+-+Oil+On+Canvas+1983+%5BEAC+-+FLAC%5D+%28oan%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"oneanight","files":-1,"time":1233352903,"description":"\n\n\nOil on Canvas is a live album by the British band Japan, released in 1983 by Virgin Records.\nAlthough it is a live recording of their established material, the album also contains three new\nstudio tracks (&quot;Oil on Canvas&quot;, &quot;Voices Raised in Welcome, Hands Held in Prayer&quot; and\n&quot;Temple of Dawn&quot;), recorded separately by Sylvian, Sylvian/Jansen and Barbieri respectively.\n(The name of Barbieri's track is taken from the novel The Temple of Dawn by the acclaimed\nJapanese novelist Yukio Mishima.)\n\nAlthough the album was released some months following the band's much publicised split in\nlate 1982, it was ironically Japan's highest charting album in the UK (where it reached #5).\nThe album was certified &quot;Gold&quot; by the BPI in 1988 for 100,000 copies sold.\n\nThe live tracks on the double-album were taken from Japan's performances in November\n1982, during their final live concert tour. Since guitarist Rob Dean had left the band two years\npreviously, Japanese session musician Masami Tsuchiya was added to the line up to play\nguitar and additional keyboards. The band also used backing tracks to supply additional\ninstrumental parts (for example, in contrast to some previous tours where a guest\nsaxophonist was recruited, many of Karn's saxophone lines were played from tape).\n\nA video version of Oil On Canvas was also available from Virgin Records. This was rereleased\non DVD in 2006 as &quot;The Very Best of Japan&quot;, which also features many of the\nband's promotional videos.\n\nEight years after the release of Oil on Canvas the four members of Japan, David Sylvian,\nSteve Jansen, Mick Karn and Richard Barbieri, reunited for another studio album - but then\nunder the group moniker Rain Tree Crow.\n\nReview by Ned Raggett allmusic\n\nThe final Japan release was sold and marketed as a live album, though actually it's a bit of a\ncatchall -- it is indeed mostly from concerts, but also includes a variety of studio instrumentals\nand a re-recorded version of &quot;Nightporter&quot; mixed in to sound like it's part of the show. The\nvarious re-releases of the albums over the years confused matters further, with resequencings,\nthe excision of cuts, and more adding to general confusion about the release\n(not to mention the fact that some reissues completely omitted where the shows were\nrecorded anyway!). Two of the instrumentals, &quot;Oil on Canvas&quot; itself and &quot;Temple of Dawn,&quot;\nare brief, gentle pieces by Sylvian and Barbieri respectively. &quot;Voices Raised in Welcome,\nHands Held in Prayer&quot; is a more involving effort, combining a quiet, gamelan-inspired rhythm\nwith found-sound samples from what appears to be a religious ceremony. As for\n&quot;Nightporter,&quot; it's a nice enough new version but isn't notably different or varied from the\nearlier studio take. The remaining live cuts show that the exquisite tension and serene\nsounds in the studio were easily transferred to the stage in all their elegant complexity. The\nTin Drum selections, which make up most of the release, make the case even more that\nJapan was as much a prog band as a glam one, Sylvian's captivating vocals flowing over\nAsian-derived scales and melodies, the guitar parts handled by guest performer Masami\nTsuchiya, who also plays some keyboards. &quot;Visions of China&quot; sounds especially grand,\nJansen's entrancing drumming seemingly impossible to be created and yet clearly existing.\nThe extended introduction to &quot;Ghosts,&quot; Karn's saxophone welling up from the distance like a\nsiren call, is another highlight, along with the slightly rocked-up -- but only just -- &quot;Methods of\nDance.&quot;\n\n\nThis is The 2006 Remaster\n\n\n   1. (01:26) - Oil On Canvas\n   2. (05:00) - Sons Of Pioneers\n   3. (06:43) - Gentlemen Take Polaroids\n   4. (05:37) - Swing\n   5. (03:47) - Cantonese Boy\n   6. (03:35) - Visions Of China\n   7. (06:23) - Ghosts\n   8. (03:31) - Voices Raised In Welcome, Hands Held In Prayer\n   9. (06:49) - Nightporter\n  10. (05:39) - Still Life In Mobile Homes\n  11. (06:08) - Methods Of Dance\n  12. (04:35) - Quiet Life\n  13. (05:29) - The Art Of Parties\n  14. (05:45) - Canton\n  15. (01:48) - Temple Of Dawn\n\n\nPlaying Time.........: 01:12:15\nTotal Size...........: 432.01 MB\n\n &lt;a href=&quot;\nhttp://www.discogs.com/Japan-Oil-On-Canvas/release/1135452&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.discogs.com/Japan-Oil-On-Canvas/release/1135452&lt;/a&gt;","torrent":{"xt":"urn:btih:c672de1f85622c4671a114113fc1bbc61f7a9f85","amp;dn":"Japan+-+Oil+On+Canvas+1983+%5BEAC+-+FLAC%5D+%28oan%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c672de1f85622c4671a114113fc1bbc61f7a9f85","infoHashBuffer":{"type":"Buffer","data":[198,114,222,31,133,98,44,70,113,161,20,17,63,193,187,198,31,122,159,133]},"announce":[],"urlList":[]}}