{"title":"Pierre Lemaitre - Irene and Alex (norsk)","uid":13366183,"size":4117976,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c70f01d6ca8f7b35390d00a8d9acbb8dc50b797e&amp;dn=Pierre+Lemaitre+-+Irene+and+Alex+%28norsk%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LotOfBollocks","files":5,"time":1454167557,"description":"Pierre Lemaitre \nhttps://no.wikipedia.org/wiki/Pierre_Lemaitre \nhttps://en.wikipedia.org/wiki/Pierre_Lemaitre\r\n\r\nIrène (#1): Utgitt originalt i 2006 med tittelen: Travail soigné\r\nOverbetjent Camille Verhoeven befinner seg i en uvanlig periode i livet. Han er lykkelig gift med den vakre Irène og skal snart bli far. \r\nMen når en ny drapssak lander på pulten hans, et dobbeltdrap som er så ekstremt at selv de mest hardbarkede blant kollegene blir forferdet,\r\nfår han bange anelser. Det virker ikke som det ligger noe motiv bak skrekkscenariet, men da det dukker opp en forbindelse til minst ett\r\ntidligere uløst drap, blir det klart at de har med en seriemorder å gjøre. Pressen er raskt og skadefro på banen og setter særlig Verhoeven\r\ni et dårlig lys.  Men det er Verhoeven som står bak det store gjennombruddet: Dobbeltdrapet er en nøyaktig kopi av en scene i Bret Easton \r\nEllis's bok American Psycho, og det skal vise seg at morderen lar seg inspirere av flere kriminalforfattere.\r\n«Forbløffende original fransk thriller, en kriminalroman som tilhører sjangerens øverste sjikt både når det gjelder spenning og\r\nlitterær kvalitet,» skrev Torbjørn Ekelund i Dagbladet da Pierre Lemaitres Alex kom på norsk i fjor. Ikke bare kritikerne var begeistret,\r\ndet var leserne også.\r\n\r\n\r\nAlex (#2): Utgitt originalt i 2011\r\nThrilleren &quot;Alex&quot; hylles av norske kritikere. &quot;Forbløffende original fransk thriller. (…) en kriminalroman som tilhører\r\nsjangerens øverste sjikt både når det gjelder spenning og litterær kvalitet,&quot; skrev Torbjørn Ekelund i Dagbladet.   \r\nHvem kjenner egentlig Alex? Hun er vakker. Sexy. Tøff. Er det derfor hun er blitt kidnappet, innesperret og utsatt for det utenkelig?   \r\nOverbetjent Camille Verhoeven og hans menn famler i blinde: ingen mistenkte, ingen ledetråd, og håpet svinner fra time til time. \r\nDet eneste de vet, er at en kvinne er blitt revet vekk fra fortauet på en gate i Paris og kastet inn i en hvit varebil.  \r\nMen når politiet finner ut av hvor hun har vært innestengt, er situasjonen langt ifra den de trodde.   \r\n&quot;Alex&quot; er thrilleren som får det til å gå iskaldt nedover ryggen din. Det handler om morderisk galskap og er drevet av en djevelsk logikk. \r\nDu legger den ikke fra deg","torrent":{"xt":"urn:btih:c70f01d6ca8f7b35390d00a8d9acbb8dc50b797e","amp;dn":"Pierre+Lemaitre+-+Irene+and+Alex+%28norsk%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c70f01d6ca8f7b35390d00a8d9acbb8dc50b797e","infoHashBuffer":{"type":"Buffer","data":[199,15,1,214,202,143,123,53,57,13,0,168,217,172,187,141,197,11,121,126]},"announce":[],"urlList":[]}}