{"title":"A Tangled Web (338)","uid":7312548,"size":503477,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c765fff3c74d1034843f59423814bdce06585098&amp;dn=A+Tangled+Web+%28338%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TMV1978","files":2,"time":1338391890,"description":"This is one of only 2 novels that LM Montgomery wrote for adults.  As with my upload of 'The Blue Castle' (the other adult novel) I wanted a copy of this for my Kindle, but couldn't find one.  Again I found the text on the Australian version of Project Gutenberg and converted it to .mobi.  I hope others enjoy it too.\n\n\nFrom the Goodreads description:\n\nOver the years sixty members of the Dark family and sixty Penhallows have married one another--but not without their share of fighting and feuding. Now Aunt Becky, the eccentric old matriarch of the clan, has bequeathed her prized possession: a legendary heirloom jug. But the name of the jug's new owner will not be revealed for one year. In the next twelve months beautiful Gay Penhallow's handsome fiance Noel Gibson leaves her for sly and seductive Nan Penhallow; reckless Peter Penhallow and lovely Donna Dark, who have hated each other since childhood, are inexplicably brought together by the jug; Hugh and Joscelyn Dark, separated on their wedding night ten years ago for reasons never revealed, find a second chance--all watched over by the mysterious Moon Man, who has the gift of second sight. Then comes the night when Aunt Becky's wishes will be revealed... and the family is in for the biggest surprise of all.","torrent":{"xt":"urn:btih:c765fff3c74d1034843f59423814bdce06585098","amp;dn":"A+Tangled+Web+%28338%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c765fff3c74d1034843f59423814bdce06585098","infoHashBuffer":{"type":"Buffer","data":[199,101,255,243,199,77,16,52,132,63,89,66,56,20,189,206,6,88,80,152]},"announce":[],"urlList":[]}}