{"title":"Everything Sinks!","uid":15506081,"size":7839587802,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c76ecc09e8237e08931c5a49aec069dee44bd422&amp;dn=Everything+Sinks%21&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"Psychodad149","files":45,"time":1470585545,"description":"Everything Sinks!\r\n\r\nThree movies here: The Submersion of Japan, Japan Sinks, and The World Sinks Except Japan.\r\n\r\nTranslation note: the first two both have the same title in Japanese, Nihon Chinbotsu, but which were released in English with slightly different titles. The first was also known slightly as Tidal Wave.\r\n\r\nAll have English subtitles. However, Submersion of Japan defaults to a Chinese language dub, but Japanese can be easily selected in your video player. The second evidently was made for a Russian audience, and playing defaults to Russian soundtrack and subtitles but can be changed it Japanese soundtrack and English subtitles. The last is straightforwardly Japanese with English subs. \r\n\r\nThe first is a Toho production from 1973, and is sometimes characterized as a Godzilla movie without Godzilla. The monster in this movie, is nature, or the Earth itself. Subduction of tectonic plates is causing Japan to slip below the surface of the sea. The movie alternates between examinations of the political intrigue as Japan's leaders negotiate for the rest of the world to take in as many Japanese refugees as possible, a few personal stories, and special effects which are really quite good. Toho's skill in miniatures shines brightly here and is not compromised by the stomping of kaijuu. The story as a whole is quite poignant, and effectively paints the saga of a people and culture cast into diaspora. \r\n\r\nThe second is a simply a remake of the first, in which Toho was involved, but credits are shared between them and several other production companies (Dentsu, Tokyo Broadcasting, Mainichi Broadcasting, and others.) Made in 2006, the special effects are noticeably slicker, and the story itself focuses more on the different individuals. It also diverges a bit from the plot of the 1973 movie; I'm not sure it is an improvement on the first.\r\n\r\nThe third. Oh, the third! The World Sinks Except Japan is a broad parody of the others. It is quite funny at times, but I would agree with some critiques I have seen that the pacing is uneven and tends to bog down in spots. The plot is obvious from the title, and as it opens, the cataclysm is already well under way. Notoriously xenophobic Japan is swarming with gaijin, and Japanese hospitality is quite strained. As it opens, we see the former US president in a night club (wearing an American flag necktie) with his (former) Secretary of State, discussing their plight. This place is, it seems, a regular watering hole for any number of government officials, both expatriate and Japanese, and the Japanese Prime Minister himself soon joins them to help set up plot and premise. \r\n\r\nSaid Japanese xenophobia is a major theme in this movie, and is the basis of a lot of the humor. It is difficult to say, though, how much that xenophobia is being lampooned and how much it is being indulged. In one sequence, for example, we learn that Japanese monster movies are more popular than ever, and much of that popularity stems from scenes of monsters stomping on foreigners, or in one case, a giant robot falling on his behind and squashing a screaming throng of Americans. In order to help keep all the refugees under control, the government creates a Gaijin Attack Team, black-uniformed storm troopers.\r\n\r\nAny weaknesses are more than compensated for by the ending - in my own humble opinion. An outrageous, uproarious twist of events which had me quite literally &quot;LOL&quot;ing quickly turned humorously, achingly, poignant, and put me to mind (oddly enough) of the final scenes of &quot;Dr. Strangelove&quot;.  The simple incidental music of American folk song &quot;Going Home&quot; is just heart-wrenching, be sure to find the lyrics. The movie's last line, from the narrator, is heartbreakingly haunting.\r\n\r\nBottom line -- very different from any other Japanese movie you have probably seen, live action or anime, and definitely worth the time. It's maybe not a great movie, but it's a fun movie, and that is something lacking in a lot of moviedom. I would suggest watching the first one, then this, and saving the 2006 Japan Sinks for last. \r\n\r\nFinal words -- it was a heckuva job finding decent copies of all these to put together! I hope everyone appreciates this effort. As far as I know, this torrent is the only source to put these three movies together. Share and enjoy!\r\n\r\nThis offering is a work of the Penny Robinson Fan Club. Please visit us at our online home -- http://pennyrobinsonfanclub.net/  and consider making a donation to help us keep up our efforts","torrent":{"xt":"urn:btih:c76ecc09e8237e08931c5a49aec069dee44bd422","amp;dn":"Everything+Sinks%21","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c76ecc09e8237e08931c5a49aec069dee44bd422","infoHashBuffer":{"type":"Buffer","data":[199,110,204,9,232,35,126,8,147,28,90,73,174,192,105,222,228,75,212,34]},"announce":[],"urlList":[]}}