{"title":"Democracy Now - 20 jan 2012","uid":6971041,"size":457184617,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:c7a0cb9992301407e14e3737b3d7085883a33b99&amp;dn=Democracy+Now+-+20+jan+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1327093533,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Jan 20, 2012\n\n- GOP Candidates Debate Ahead of South Carolina Primary\n- Second Officer Backs Trial for Manning\n- Afghans Protest Deadly NATO Raid\n- France Suspends Training of Afghan Troops After Shooting\n- Syrian Protests Follow More Killings; Arab League Extends Monitoring Mission\n- Top U.S. General Visits Israel for Iran Talks\n- Iran: Scientist Assassins May Have Used U.N. Info\n- 5 Moroccans Self-Immolate in Unemployment Protest\n- U.S. Shuts Down File-Sharing Site, &quot;Anonymous&quot; Hackers Retaliate\n- Military Suicides Hit New Record High\n- U.S. Confirms Liberian Leader Worked for CIA\n- Obama Visits Apollo Theater in New York City Fundraising Trip\n- 6 Marines Killed in Afghanistan\n- Vermont Barred from Shuttering Vermont Yankee Nuclear Plant\n\n\nSpecial reports\n\n- GOP Contest Rattled Before SC Primary as Perry Exits, Newt's Ex-Wife Speaks Out, Santorum Takes Iowa\n\nRepublican presidential candidates gathered in Charleston, South Carolina, Thursday night for their final debate before Saturday's primary. The debate capped a busy day that saw the departure of Texas Gov. Rick Perry, Rick Santorum's defeat of Mitt Romney in the Iowa caucus recount, and new details of Newt Gingrich's infidelities during his second marriage. We air clips from the debate and speak to Kevin Alexander Gray, a civil rights activist and community organizer in South Carolina, and Wayne Slater, a senior political writer at the Dallas Morning News and author of &quot;Bush's Brain: How Karl Rove Made George W. Bush Presidential.&quot;\n\n\n- Ahead of South Carolina Primary, GOP Candidates Employ Race-Baiting Tradition to Win Southern Vote\n\nLeading up to the South Carolina primary, several Republican presidential candidates have been criticized for comments made over issues of race. This week Newt Gingrich defended his description of President Obama as &quot;the food stamp president,&quot; while offering praise for President Andrew Jackson, the architect of the Indian Removal Act. We speak to South Carolina civil rights activist Kevin Alexander Gray and longtime political reporter Wayne Slater about how Republicans have adopted the long-held &quot;Southern strategy&quot; of race baiting in order to win over bigoted white voters. &quot;Democrats come here to get their black ticket punched. Republicans come here to punch black people,&quot; Gray says.\n\n\n- Tariq Ali: Obama's Expansion of Af-Pak War &quot;Has Blown Up in His Face&quot;\n\nAmid ongoing U.S.-Pakistani tensions and fears of a military coup in Pakistan, we are joined by British-Pakistani political commentator, historian, activist, filmmaker and novelist, Tariq Ali. Ali discusses Pakistan's internal turmoil, as well as Pakistani attitudes toward U.S. foreign policy, the GOP presidential contest, and the prospect of a military strike against Iran. &quot;[Pakistanis] are basically suffering because Obama, arrogantly, escalated the war in Afghanistan and Pakistan and thought he could get away with it. That has now blown up in his face,&quot; Ali says.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:c7a0cb9992301407e14e3737b3d7085883a33b99","amp;dn":"Democracy+Now+-+20+jan+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7a0cb9992301407e14e3737b3d7085883a33b99","infoHashBuffer":{"type":"Buffer","data":[199,160,203,153,146,48,20,7,225,78,55,55,179,215,8,88,131,163,59,153]},"announce":[],"urlList":[]}}