{"title":"Uri Caine - Gustav Mahler in Toblach (1999) [EAC/FLAC/Secure]","uid":5544100,"size":640699530,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c89c81d4329c634a9f5f66a728c60dbc1e0b92a6&amp;dn=Uri+Caine+-+Gustav+Mahler+in+Toblach+%281999%29+%5BEAC%2FFLAC%2FSecure%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"loeffel","files":15,"time":1273324786,"description":"Some really interesting music on the meeting point between Classical (Gustav Mahler) and Jazz (Uri Caine). Live recording.\n\nOn 1997's Urlicht/Primal Light (Winter &amp; Winter), pianist and composer Uri Caine blended jazz, bossa nova, funk and klezmer music to deconstruct Gustav Mahler's symphonies and songs and illuminate the Jewish roots of the classical composer. Surprisingly, both classical and jazz critics raved and the International Mahler Society awarded the CD its prize as the most innovative Mahler recording of the year. Caine has followed up with a live recording of this material, The Uri Caine Ensemble: Gustav Mahler in Toblach (Winter &amp; Winter). The double-disc set preserves the eclectic mix of Caine's arrangements and gives the group's soloists a chance to stretch out. On a new CD by the septet Zohar, Keter (Knitting Factory Records), Caine applies a similarly inventive touch to traditional Jewish tunes and original compositions. For the Painted Bride concert, Caine's ensemble includes trumpeter Ralph Alessi, bassist Michael Formanek, drummer Cornell Rochester, violinist Diane Monroe, clarinetist Don Byron and DJ Olive on turntables. The Philadelphia-raised Caine conducts a masterclass at the Settlement Music School the day before the concert.\n\nARTISTS\nRalph Alessi (trumpet); Aaron Bensoussan (vocals, oud); David Binney (alto sax); Jim Black (drums); Uri Caine (piano, keyboards); Mark Feldman (violin); Michael Formanek (acoustic bass); DJ Olive (turntables, live electronics)\n\nTRACKS\n1. Sym No.5: Funeral March\n2. Songs Of The Death Of Children: I Often Think They Have Merely Gone Out!\n3. Songs Of The Death Of Children: Now Will The Sun Rise As Brightly\n4. The Boy's Magic Horn: The Drummer Boy\n5. Intro To Sym No.5: Adagietto\n6. Sym No.5: Adagietto\n7. Sym No.1: Titan, 3rd Movt\n8. I Went Out This Morning Over The Country Side, Sym No.2 'Resurrection': Andante Moderato\n9. Sym No.2 'Resurrection': Primal Light\n10. The Song Of The Earth: Interlude To The Farewell\n11. The Song Of The Earth: The Farewell\n\nPlease leave a comment if this was interesting.","torrent":{"xt":"urn:btih:c89c81d4329c634a9f5f66a728c60dbc1e0b92a6","amp;dn":"Uri+Caine+-+Gustav+Mahler+in+Toblach+%281999%29+%5BEAC%2FFLAC%2FSecure%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c89c81d4329c634a9f5f66a728c60dbc1e0b92a6","infoHashBuffer":{"type":"Buffer","data":[200,156,129,212,50,156,99,74,159,95,102,167,40,198,13,188,30,11,146,166]},"announce":[],"urlList":[]}}