{"title":"The Hobbit 1968 BBC 4 Radio Drama","uid":4390311,"size":205126542,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:c8d647412fdd6717dd242ae066181392ad9892c6&amp;dn=The+Hobbit+1968+BBC+4+Radio+Drama&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EradanIngolemo","files":-1,"time":1221138865,"description":"About the Release:\nBBC Radio 1968 - The Hobbit - Full Cast Dramatisation - podded by cheops\n------------------------------------------------------------------------\n\nThis series was adapted by Michael Kilgariff and produced by John Powell in eight half-hour mono episodes for BBC Radio 4.\n\nThe radio series follows the plot of the original novel (revised 1951 version) very closely, except for the addition of The Tale Bearer, a narrator whose account of the story is often interrupted and embellished by the protagonist Bilbo Baggins in the role of secondary narrator.\n\nEight episodes of approx 30 minutes each in high quality MP3.\n\nBilbo, a stay-at-home hobbit, is approached by the wizard Gandalf to undertake a dangerous adventure, and despite his initial reluctance he soon finds himself accompanying Thorin Oakenshield and his party of dwarves on a long and difficult quest to recover the dwarves' treasure from Smaug the dragon, encountering trolls, goblins, Gollum (acquiring a magic ring near Gollum's cave), wargs, eagles, giant spiders, elves and men along the way. In the process Bilbo is transformed from a clumsy, timid and rather comic figure into a dignified and occasionally heroic everyman.\n\nJ.R.R. Tolkien's timeless and beloved tale is presented in a stunning dramatization that resounds with all the excitement of a theater performance--and all the charm of a vintage radio show. Originally conceived for BBC broadcast and produced by the world's foremost creators of radio entertainment, this lavish production melds a full cast with stirring music and sound effects to bring this magnificent classic to life.\n\nWith:\n-----\nThe Tale Bearer....Anthony Jackson\nBilbo Baggins....Paul Daneman\nGandalf....Heron Carvic\nGollum....Wolfe Morris\nThorin Oakenshield....John Justin\nElrond....John Pullen\nThe Elvenking....Leonard Fenton\nBeorn....Denys Hawthorne\nBard the Bowman....Peter Williams\nBalin....Peter Pratt\nSmaug....Francis de Wolff\n\n-----------------------\nType : mpeg 1 layer III\nBitrate : 128\nMode : joint stereo\nFrequency : 44100 Hz\nEncoder : Lame 3.88\n-----------------------\n\nNote from the Releaser (current, that is):\n\nI torrented this in November'07 from Isohunt and as of now that release seems to be dead. Neither there's such torrent here on TPB. Thus I create new release and will seed it...like for evermore, I think. (I'll be the Ultimate Hobbit'68 Seeder! Sweet deal!)\nThis drama was encoded by Cheops (probably a group of men), and I release it exactly as I had downloaded it - even left Cheops logo in the folder. My upload speed goes up to 60 kB/s, so the first lecher will have the release in about 1.5-2 hours.\nHope you'll enjoy the masterpiece. I totally do.\n\n\nUPDATE 24.06.2009: Here is the score of this drama:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/4972458&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/4972458&lt;/a&gt;","torrent":{"xt":"urn:btih:c8d647412fdd6717dd242ae066181392ad9892c6","amp;dn":"The+Hobbit+1968+BBC+4+Radio+Drama","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8d647412fdd6717dd242ae066181392ad9892c6","infoHashBuffer":{"type":"Buffer","data":[200,214,71,65,47,221,103,23,221,36,42,224,102,24,19,146,173,152,146,198]},"announce":[],"urlList":[]}}