{"title":"Empire (NL SUBS) 2Lions-Team","uid":5480868,"size":4510121826,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:c8e3fe923a388fc9fc3eba68d59479934542c85d&amp;dn=Empire+%28NL+SUBS%29+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Pioen","files":-1,"time":1270415602,"description":"Empire (2005)       \n\n \n  Verenigde Staten\nActie / Drama\n253 minuten (miniserie, 6 delen)\n\ngeregisseerd door John Gray, Kim Manners en Greg Yaitanes\nmet Santiago Cabrera, Jonathan Cake en Vincent Regan\n\nRome, 44 voor Christus. Julius Caesar keert na zijn triomf in Spanje terug naar Rome. Daar treft hij een staat aan die in verval verkeert en wordt bestuurd door een door macht gecorrumpeerde Senaat. Er zal bloed gaan vloeien en dan zal op een man de zware taak gaan rusten om het Romeinse Rijk te besturen... Octavius, de 17-jarige neef van Caesar, is een van de Romeinen die Caesar toejuicht bij zijn terugkomst uit Spanje. Maar onder het selecte gezelschap van edelen dat Caesar omringt, smeult onrust, woede en wrok. Slechts enkele dagen later, op 15 maart, wordt Caesar het slachtoffer van een samenzwering waarbij ook de senatoren Cassius en Brutus zijn betrokken; 23 steekwonden maken een einde aan het leven van de gevierde dictator. Met zijn laatste krachten benoemt Caesar zijn impulsieve en onervaren neef Octavius tot opvolger. Generaal Marcus Antonius maakt zelf aanspraak op de troon en accepteert niet dat iemand die is opgegroeid in luxe en nog nooit een slagveld van dichtbij gezien heeft er met de buit vandoor gaat. Daarbij wordt hij gesteund door de moordenaars van Caesar, die korte metten willen maken met alle afstammelingen van de dictator.\n\n\n\nEnglish\n\nThe story is set in Rome around 44 B.C., just after the assassination of Julius Caesar. Octavius, aged 17, who was named heir by Caesar, is challenged by Marc Anthony. A civil war ensues, ending in a showdown between Octavius and Marc Anthony.\n\nSpotinformatie \nCategorie : Beeld \nFormaat : DVD5 \nBron : Retail\nAudio : English\nCover : Yes\n \nOndertitels : Nederlands (instelbaar)\n \nGenre : Actie\nDrama\n \nWeblink : &lt;a href=&quot; http://www.moviemeter.nl/film/31547&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.moviemeter.nl/film/31547&lt;/a&gt;\nWeblink : &lt;a href=&quot; http://www.imdb.com/title/tt0403759&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt0403759&lt;/a&gt; \n\n*****************************************\n\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n\n\n\n\n2Lions the site to be for all your Dutch MOVIES and more\n\n******************************************\n\n\nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !! \n\n \n\n\n \n \n \n","torrent":{"xt":"urn:btih:c8e3fe923a388fc9fc3eba68d59479934542c85d","amp;dn":"Empire+%28NL+SUBS%29+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8e3fe923a388fc9fc3eba68d59479934542c85d","infoHashBuffer":{"type":"Buffer","data":[200,227,254,146,58,56,143,201,252,62,186,104,213,148,121,147,69,66,200,93]},"announce":[],"urlList":[]}}