{"title":"Ys Origin (GOG)","uid":12072610,"size":1691511394,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c9b9eb65190aa887af0d5ead9a34a72bb5faa96e&amp;dn=Ys+Origin+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mercs215","files":4,"time":1435556847,"description":"Includes the full game along with all the GOG.com game goodies.\n\nInstall instructions:\n1. Run &quot;setup_ys_origin_2.0.0.1&quot;\n2. Play\nIf you like this game, support the developers and BUY IT!\n\nTitle: Ys Origin\nGenre: Role-playing - Action - Fantasy\nWorks on: Windows (XP, Vista, 7, 8)\nLanguages: Text only: English\nModes: Single-player\nReleased: May 31, 2012\nCompany: Nihon Falcom Corporation / XSEED Games\nStore page: https://www.gog.com/game/ys_origin\n\nAbout:\n700 years before the events of Ys I &amp; II, the land of Ys was on the brink of destruction. Demons came in droves and forced the twin Goddesses who ruled the land to whisk their subjects away from the surface, into the safe embrace of the clouds. The demons were persistent, however, erecting a massive tower in pursuit. The battle that raged upon the ground had begun ascending for a second round up above.\nOne day, amidst this turmoil, the Goddesses stole away into the night, vanishing from Ys altogether. And there's only one place they could have gone: the Devil's Tower.\nA search party of knights and sorcerers was hastily formed and dispatched to the surface in hopes of retrieving these runaway deities. Among its members were apprentice knight Yunica Tovah and troubled sorcerer Hugo Fact.\nThis is their story. Or at least, it's how each of them remembers it.\nExpanding upon the gameplay elements introduced in Ys: The Ark of Napishtim and further developed in Ys: The Oath in Felghana, Ys Origin perfects the formula by adding different styles of play and new features never before seen in the Ys universe. Best described as an arcade-like platformer RPG with Metroidvania elements and a complex, multi-faceted narrative, Ys Origin is the perfect mix of action, exploration and story. Screen-filling bosses with complex AI, unique platforming elements, innovative puzzles and a deeply involving mystery await within the wildly varied confines of this classic Ys dungeon.\nCome see how long you can last in the Devil's Tower...\nThree unique playable characters in story mode, with additional variations unlockable through other modes.\nFive difficulty levels ranging from &quot;Very Easy&quot; for casual players to &quot;Nightmare&quot; for true Ys masters.\nUnlockable &quot;Time Attack&quot; and &quot;Boss Rush&quot; modes for showing off ultimate boss-taming abilities.\nUnlockable Arena Mode pits players against massive hordes of enemies for unique gameplay rewards.\nMinutely configurable high-resolution graphics with true widescreen support.\nFully adjustable controls supporting virtually any USB gamepad, as well as a standard keyboard and mouse setup.\n\nMinimum system requirements:\nWindows: Windows XP / Vista / 7 / 8\nProcessor: Pentium III / 1 GHz\nMemory: 1 GB RAM\nGraphics: 64 MB VRAM 3D accelerator compatible w/ DirectX 9.0c, DirectXÂ®:9.0c,\nHard Drive: 2 GB HD space\nSound: Compatible with DirectX 9.0c\nMouse\nKeyboard","torrent":{"xt":"urn:btih:c9b9eb65190aa887af0d5ead9a34a72bb5faa96e","amp;dn":"Ys+Origin+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9b9eb65190aa887af0d5ead9a34a72bb5faa96e","infoHashBuffer":{"type":"Buffer","data":[201,185,235,101,25,10,168,135,175,13,94,173,154,52,167,43,181,250,169,110]},"announce":[],"urlList":[]}}