{"title":"Slayers Evo-R [01-13/13] XviD ac3 ITA JAP DVDrip [tntvillage.tk]","uid":6655654,"size":4136267776,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c9dba0876a4f3f2be09dbd9ffc8006d7237f27ac&amp;dn=Slayers+Evo-R+%5B01-13%2F13%5D+XviD+ac3+ITA+JAP+DVDrip+%5Btntvillage.tk%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"salvoiorfida","files":-1,"time":1315268784,"description":"[img]http://shounen.chungyc.org/wp-content/uploads/2008/11/slayers-evolution-r.jpg[/img]\nIntroduzione:\n\nDopo piÃƒÂ¹ di 11 anni di assenza dagli schermi televisivi, ritorna la saga fantasy piÃƒÂ¹ famosa degli anni '90, con nuovi episodi che riprendono dalla fine di Slayers Try. Megumi Ayashibara ritorna a vestire i panni della maga Lina e come di consueto interpreta entrambe le sigle. Il regista ÃƒÂ¨ lo stesso delle precedenti serie, Takashi Watanabe, lo studio di animazione invece ÃƒÂ¨ il J. C. Staff che nelle precendenti serie di Slayers si era solamente occupato della produzione. :clap:\n\nNasce come una serie di light novel scritta da Hajime Kanzaka nel corso degli anni novanta. La storia racconta di Lina Inverse e Gourry Gabriev e delle loro avventure, facendo parodia dei giochi di ruolo fantasy.\nL'anime si compone di varie serie televisive e di numerosi OAV e film pubblicati successivamente alla serie televisiva, ma che si svolgono in realtÃƒÂ  prima degli eventi di quest'ultima ed in cui Lina ÃƒÂ¨ accompagnata da una maga assillante e presuntuosa di nome Naga. La storia si svolge in un mondo fondamentalmente medievale dove la magia occupa un ruolo fondamentale. La serie animata ÃƒÂ¨ organizzata in cicli dal tono inizialmente umoristico che poi lentamente diventano sempre piÃƒÂ¹ serie tanto che alla fine culminano in eventi nei quali il destino dell'universo ÃƒÂ¨ appeso ad un filo. Tuttavia anche i momenti piÃƒÂ¹ seri sono smorzati da piccole gag comiche, dando a Slayers un tocco davvero unico nel suo genere.\nL'adattamento italiano della serie televisiva ÃƒÂ¨ stato curato da Mediaset, che ne ha modificato il titolo in Un incantesimo dischiuso tra i petali del tempo (per Rina).\n\nQuinta serie di Slayers, ma strettamente legata a Revolution di cui ÃƒÂ¨ praticamente la seconda parte (si noti il gioco di parole Revolution con Evolution-R solo spostando la R).\n\nImperdibile per i fan della storica serie .... :birra: \n\nTrama:\n\nContinua l'avventura, e continua ad aleggiare il fantasma di Rezo: forse c'ÃƒÂ¨ un modo per salvare i concittadini di Pokota. Una piccola chicca per chi ha visto anche i film vede la comparsa di un'armatura animata dallo spirito di una ragazza che ha perso la memoria ma ha una risata assurda.... :neutral: \n\nDettagli:\n\nLingue: Italiano Japponese\nFormato Video: Xvid 16:9 720 x 400 pixel\nFormato Audio: ac3 2 canali stereo 192 kbs\nDimensione : 310 mb circa ciascuno episodio\nfps=23.976\n\nMORE INFO: &lt;a href=&quot;\nhttp://www.tntvillage.tk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tntvillage.tk&lt;/a&gt;\n---------------------------","torrent":{"xt":"urn:btih:c9dba0876a4f3f2be09dbd9ffc8006d7237f27ac","amp;dn":"Slayers+Evo-R+%5B01-13%2F13%5D+XviD+ac3+ITA+JAP+DVDrip+%5Btntvillage.tk%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9dba0876a4f3f2be09dbd9ffc8006d7237f27ac","infoHashBuffer":{"type":"Buffer","data":[201,219,160,135,106,79,63,43,224,157,189,159,252,128,6,215,35,127,39,172]},"announce":[],"urlList":[]}}