{"title":"Coast to Coast AM April 18 2013","uid":8389539,"size":55918343,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:caa61034b491dec4f185f6fe3ce9561d967cd080&amp;dn=Coast+to+Coast+AM+April+18+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"runcdfirst","files":5,"time":1366384021,"description":"#we.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t04-18-13\nHost: \tGeorge Noory\nGuests: \tHugh Newman, Stephen Bassett\n\nIn the middle two hours, author and explorer Hugh Newman discussed his work on earth grids and megalithic sites as well as his research into Indigo Children. He put forward the concept that there is an energy grid within the Earth and that this internal structure was both known about by the ancients and used by them to create monuments such as Stonehenge. According to Newman, in areas where these energy lines cross, orb phenomena known as &quot;earth lights&quot; and altered states of consciousness have been reported as well as a greater yield for crop growth.\n\nRegarding Indigo Children, Newman marveled that there appears to be a generation of kids who possess increased intelligence and psychic abilities. He theorized that these children are &quot;old souls&quot; that are reincarnating in our modern times in order to &quot;usher in this higher level of consciousness&quot; for the human race. Newman also lamented that these children are often misunderstood by their parents and teachers, which results in their being diagnosed with ADD or autism and being prescribed dangerous pharmaceutical drugs. Ultimately, since these children first began emerging in the late 1970's, Newman suggested that they could become the future leaders of our planet and use their gifts to help guide Earth into a more harmonious state.\nCitizen's Hearing\n\nIn the first hour, activist Stephen Bassett talked about the upcoming Citizen's Hearing on Disclosure to be held at the National Press Club in Washington D.C. from April 29th to May 3rd. He noted that previous UFO press conferences failed to create &quot;critical mass&quot; in the media, since they were only held over a few hours. However, this event will be held over several days, featuring top researchers and former military personnel presenting evidence to former members of Congress participating in a simulated hearing on UFOs. Bassett expressed hope that this massive effort will result in such overwhelming evidence for the reality of UFOs that the mainstream media will be forced to investigate the phenomenon.\n\nThe final hour of the program was devoted to Open Lines and coverage of the unfolding manhunt for the Boston Marathon bombers.\n\nNews segment guests: Catherine Austin Fitts &amp; Robert Zimmerman\nWebsite(s):\n\n    megalithomania.co.uk\n    hughnewman.co.uk\n    megalithamerica.com\n    avalonrising.co.uk\n    paradigmresearchgroup.org\n    citizenhearing.org\n\nBook(s):\n\n    The Psychic Children: Dolphins, DNA and the Planetary Grid\n    Earth Grids\n\n","torrent":{"xt":"urn:btih:caa61034b491dec4f185f6fe3ce9561d967cd080","amp;dn":"Coast+to+Coast+AM+April+18+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"caa61034b491dec4f185f6fe3ce9561d967cd080","infoHashBuffer":{"type":"Buffer","data":[202,166,16,52,180,145,222,196,241,133,246,254,60,233,86,29,150,124,208,128]},"announce":[],"urlList":[]}}