{"title":"Hear 1.1.4","uid":7484842,"size":5113528,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:cabd9f4dc1b4e83bc5a47961cb00c30f0d0e628b&amp;dn=Hear+1.1.4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"openarena","files":-1,"time":1343549696,"description":"Hear greatly improves audio quality in movies and music throughout all of your Mac OS X applications. With Hear, music is richer, movie sound and dialog is clearer and games will blow you out of your chair!\n\n3D Sound - Like movies? like'em more with virtual cinema quality sound experience. Sound will approach you from all angles, even from behind. You are there with Hear.\nEqualizer - Perfect your sound with Hear's studio quality N-band equalizer with built-in peak limiter. You've got control.\nSpeaker Correction - Control speaker resonance to increase frequency range and enhance sound.\nCenter Channel Control - Control the volume and width of the sound coming from your own virtual center-stage for performance-grade audio effects. A concert in your house.\nVirtual Subwoofer - No Sub? No problem. Let Hear use your existing speakers to boost your bass. Don't you need more thump in your life?\nAmbience - Fine tune reverb to emulate any venue from phone booth to concert hall. Either way, it's music to your ears.\nFidelity control - Music the way it was meant to be heard. Restore frequency, coloring and intensity lost during the recording process. Put more &quot;hi&quot; in your &quot;fi&quot;.\nMuch more - Hear can control the volume and quality of each application independently. You can control enable and disable each effect independently. You can apply the effects in any order for dramatic results. You can define and recall presets at any time. You can enjoy Hear's effects through your computer's speakers, headphones and external speakers. And you can do it all in an easy-to-understand user interface.\n\nWhat's New\nVersion 1.1.4\n\n- Added compatibility with OS X 10.8's Gatekeeper\n- Added support for Opera 12\n\nRequirements\nPPC / Intel, Mac OS X 10.5 or later. ","torrent":{"xt":"urn:btih:cabd9f4dc1b4e83bc5a47961cb00c30f0d0e628b","amp;dn":"Hear+1.1.4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cabd9f4dc1b4e83bc5a47961cb00c30f0d0e628b","infoHashBuffer":{"type":"Buffer","data":[202,189,159,77,193,180,232,59,197,164,121,97,203,0,195,15,13,14,98,139]},"announce":[],"urlList":[]}}