{"title":"Wrt54G Sveasoft Firmware Talisman 1.04 (Freeman Edition)","uid":3498665,"size":2705824,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:cc8b5cbbc2248d6c8324d2a860ff8214f48a7cde&amp;dn=Wrt54G+Sveasoft+Firmware+Talisman+1.04+%28Freeman+Edition%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"djshyguy","files":1,"time":1151358765,"description":"\nQuoted from http://wrt54g.thermoman.de/\n&quot;\nAs you might know, Linksys released the source code of the WRT54G firmware under GPL a while ago. Sveasoft (as well as other projects like WiFi-Box) took this code, added some features and patches and released an improved version of the firmware.\nThis worked fine until one day, Sveasoft decided to close their firmware from public access and to charge 20$ from anyone who would want to download the code.\nSo far so good, however since the GPL allows free redistribution of the obtained program (in this case firmware), one of their customers decided to put the firmware binaries on a P2P network, making them available for everyone.\nI don&amp;#039;t know who this person is, but I thank him for his kindness and in order to help people out, I decided to mirror those files on this website.\n\nWhen Sveasoft figured out about the P2P versions, they posted an announcement stating they would be manipulated, corrupt your router&amp;#039;s memory or even contain backdoors.\nTo me, this was obviously a FUD strategy (fear, uncertainty and doubt) so I tried using those versions and they work just fine for me.\nMy believe about FUD was confirmed when Sveasoft started deleting posts asking for (or containing) checksums of the firmware. Why wouldn&amp;#039;t they provide checksums if their intend was to protect their users (paying or not) and the good name of their firmware?\nThe only obvious answer is: those versions are identical to the ones released by Sveasoft, there probably has never been a manipulated version of their firmware on P2P.\n&quot;\n\nThis is the latest SVEASOFT linksys router firmware. Works for wrt54g v 2.0 and up. Add way more features to your router!\n\nLet me know if this works, first time uploading torrent!","torrent":{"xt":"urn:btih:cc8b5cbbc2248d6c8324d2a860ff8214f48a7cde","amp;dn":"Wrt54G+Sveasoft+Firmware+Talisman+1.04+%28Freeman+Edition%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc8b5cbbc2248d6c8324d2a860ff8214f48a7cde","infoHashBuffer":{"type":"Buffer","data":[204,139,92,187,194,36,141,108,131,36,210,168,96,255,130,20,244,138,124,222]},"announce":[],"urlList":[]}}