{"title":"Ric Ocasek - Emotion In Motion  (2nafish)","uid":5293481,"size":145577988,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:cca866060b4b5eba61bef25c47399577fe8b9e51&amp;dn=Ric+Ocasek+-+Emotion+In+Motion++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1263980384,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 4000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nRic Ocasek (born Richard T Otcasek on March 23, 1949) is an American of Czech heritage, musician, and music producer. He was born in Baltimore, Maryland, and attended Bowling Green State University. He is the former vocalist and rhythm guitarist for The Cars. He has been a producer for several other groups including Weezer, Bad Brains, Bad Religion, Nada Surf, No Doubt, Guided by Voices, Bran Van 3000, and Suicide.\n\nThis Side of Paradise is the second solo studio album released by Ric Ocasek, lead singer and songwriter of The Cars. Though it was a solo album, other members of The Cars made cameo appearances. The track &quot;True to You&quot; featured Benjamin Orr on backing vocals, Elliot Easton on guitar, and Greg Hawkes on keyboards/backing vocals. Hawkes also featured throughout the entire album on keyboards and bass. Ocasek's second album was released in 1986 by Geffen Records. Production was by Chris Hughes (drummer for Adam and the Ants).\n\nSteve Stevens from Billy Idol's band, Roland Orzabal from Tears for Fears, Tony Levin from King Crimson/Peter Gabriel, Tom Verlaine of Television and G. E. Smith of Hall &amp; Oates/SNL band guest on the various songs.\n\nThe first single from the album, &quot;Emotion in Motion&quot;, which was aided in its promotion by a popular video that received heavy airplay on MTV, reached #1 on the Mainstream Rock Tracks for one week, becoming Ocasek's only solo chart-topper (as a member of The Cars, he topped the chart with the singles &quot;You Might Think&quot; and &quot;Magic&quot; in 1984, and &quot;Tonight She Comes&quot; in 1985).\n\nThe singer released his first solo album in 1982. Beatitude is a somewhat more experimental variation of The Cars' New Wave rock sound. A more synthesizer-heavy follow up, This Side Of Paradise, was released in 1986. A #15 hit single, &quot;Emotion in Motion&quot;, accompanied the album.\n\nThe Cars split in 1988, and Ocasek disappeared from the public eye for a couple of years, resurfacing in 1990 with Fireball Zone. One track, &quot;Rockaway&quot;, enjoyed a brief stay on the charts, but his solo albums have seen disappointing sales, especially compared to his success with the Cars. He subsequently released other solo works throughout the decade, including 1993's Quick Change World, 1996's Getchertikitz (a collaboration with Suicide's Alan Vega), and 1997's Billy Corgan-produced Troublizing (which Ocasek supported with a very brief tour, his first since leaving the Cars). In 2005, Ocasek released another album, Nexterday, to little fanfare, but positive reviews.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:cca866060b4b5eba61bef25c47399577fe8b9e51","amp;dn":"Ric+Ocasek+-+Emotion+In+Motion++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cca866060b4b5eba61bef25c47399577fe8b9e51","infoHashBuffer":{"type":"Buffer","data":[204,168,102,6,11,75,94,186,97,190,242,92,71,57,149,119,254,139,158,81]},"announce":[],"urlList":[]}}