{"title":"Reverse Tether Final By bobiras2009","uid":7613609,"size":83253,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:ccadeee3c570c14aaaadea2844ff51b038b01d21&amp;dn=Reverse+Tether+Final+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"bobiras2009","files":-1,"time":1347138737,"description":"For make Requests go here: https://forum.suprbay.org/showthread.php?tid=129845\n\nI will not upload requests that post in the comments in my torrents.           \n                 \n\n                                By bobiras2009\t\t\n\n\n\nIf you appreciate my work you can leave a commnent and seed this for as long you can to help me upload more.\n\nRequirements: Android v2.1+\nOverview: ReverseTether allows you to access your computer's internet connection on your device via USB, thus, reverse tethering. It's the first and only app of its kind on the Market, no other app does such a thing.\n\n\nReverseTether allows you to access your computer's internet connection on your device via USB, thus, reverse tethering. It's the first and only app of its kind on the Market, no other app does such a thing.\n\n\nThis app may be useful for you if:\n- if you don't have a mobile data plan.\n- if you have a limited plan and would like to spare your bytes and money whenever you're at home/work/school.\n- if you're roaming and would like to avoid roaming data charges.\n- if you prefer speed and want an internet that is faster* than any wifi/3g/4g/lte. (*as fast as your modem)\n- if you don't have access to wifi / don't need wifi just for your device.\n- if you don't trust the security/privacy of your wifi network.\n- if your wifi connection is weak, slow or keeps disconnecting.\n- if you're sick of eating terrible food at burger places just for wifi access.\n- if you would like to access your local network from your device for backups or storage.\n\nBasically, since you're already connected to usb to recharge or sync, why not also have a super fast, unlimited, secure internet connection for no additional charges, for whatever reason, like sync your mail, contacts or calendars, download and update apps, pre-cache maps, use online-only apps/games, etc...\n\nKey features:\n- You'll be able to connect to the internet via USB with a single click. No advanced skills required whatsoever.\n- The connection will appear on your device as 3G so that all apps including Market function seamlessly as if you're actually connected to 3G.\n- It will first guide you in 2 easy steps to setup your computer for it to work.\n- No pc-side software installation is needed at all.\n- It provides an option to automatically connect as soon as you plug in USB.\n- To disconnect, simply unplug USB. To connect again, plug back USB. Voila. Easy.\n- A manual configuration option is also available for advanced users.\n\n\nRecent changes:\n- Now supporting more devices thanks to the continuous user feedback.\n- NOTE to ICS users: Please uninstall the app before updating.\nLess description Â»\n\nLatest version: build.2012.04.05.paid (for Android version 2.1 and higher)\n\n\n                                By bobiras2009\t\t","torrent":{"xt":"urn:btih:ccadeee3c570c14aaaadea2844ff51b038b01d21","amp;dn":"Reverse+Tether+Final+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ccadeee3c570c14aaaadea2844ff51b038b01d21","infoHashBuffer":{"type":"Buffer","data":[204,173,238,227,197,112,193,74,170,173,234,40,68,255,81,176,56,176,29,33]},"announce":[],"urlList":[]}}