{"title":"Combustion In Pre-Industrial By Clifford Jone PDF [DTW]","uid":13247649,"size":11152137,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:ccd52d90df8784a42bac43a2547c46185fe93775&amp;dn=Combustion+In+Pre-Industrial+By+Clifford+Jone+PDF+%5BDTW%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"DTW888","files":5,"time":1453133592,"description":"[center][color=gray][size=160]Combustion In Pre-Industrial English Literature\r\n [/color][/size][/center]\r\n\r\n[center][img]http://i.imgur.com/gDbqi73.jpg[/img][/center]\r\n\r\n[center][color=blue][b]\r\nISBN: 978-87-403-1208-9\r\n1 edition\r\nPages : 225[/color][/b][/center]\r\n\r\n\r\n[center][color=red][size=150]Book Description[/color][/size][/center]\r\n\r\n[center][color=gray] The book takes authors over the time span from Chaucer to Jane Austen and analyses their work for features of combustion. Coal and export and import thereof feature throughout the book, the time span of which predates the oil industry. There is a good deal on accidental fires. Shakespeare receives considerable coverage as one of a total on one hundred and one authors who feature. Others include John Donne and (from much later) Francis Scott Key.\r\n\r\nThe Great Fire of London features several times as does the American War of Independence. The organisation of the book is author by author in chronological order. There is usually a portrait of the author and introduction in tabular form of quotes from his or her work relevant to combustion. There is discussion point by point, and in many ways the emphasis of the book is application of knowledge of combustion retrospectively to writings from a time when such knowledge was not available. There were two points of interest, recurrent in the book, to arise from this. One is that such knowledge was often intuited long before it was formally expressed according to scientific principles. The second is that in application of combustion or in prevention of unwanted combustion ingenuity which surprises an expert reader is often apparent. This is the first book to investigate English literature in this way, and the author has brought to its writing both a lifetime’s professional involvement with combustion matters and also an interest in English literature which, though not his source of income, he has had since boyhood. The result is a satisfying synthesis of material expected to be of interest to scientists as well as to professional historians of science.\r\n..[/color][/center]\r\n\r\n\r\n[center][img]http://s10.postimg.org/l1kh8y3gp/cooltext1925887515.gif[/img][/center]","torrent":{"xt":"urn:btih:ccd52d90df8784a42bac43a2547c46185fe93775","amp;dn":"Combustion+In+Pre-Industrial+By+Clifford+Jone+PDF+%5BDTW%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ccd52d90df8784a42bac43a2547c46185fe93775","infoHashBuffer":{"type":"Buffer","data":[204,213,45,144,223,135,132,164,43,172,67,162,84,124,70,24,95,233,55,117]},"announce":[],"urlList":[]}}