{"title":"[PC ISO] Ski Resort Extreme (7z)","uid":8355491,"size":526681787,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:cd679b51795cb99fd7d5dcb3a7369b4f3c73af46&amp;dn=%5BPC+ISO%5D+Ski+Resort+Extreme+%287z%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TOMHASBURGER","files":-1,"time":1365483384,"description":"This is a re-upload because this game seems to be unable to attain anywhere so I went through my old files and finally found it. Please please seed, I know even I rarely seed things because switching computers so much, but do what you can to keep this alive, re-upload to file sharing sites if you want. Thank you for seeding :)\n\nWikipedia - Ski Resort Extreme is a computer simulation game which puts the player in charge of creating and running a ski resort. It was developed and released in 2004 by Cat Daddy Games who also developed the very similar Ski Resort Tycoon and Ski Resort Tycoon II.\n\nSki Resort Extreme puts the player in the shoes of a ski resort developer whose aim is to attract varied groups of skiers and snowboarders by catering to their needs and expectations, be it ski runs, equipment, entertainment or amenities.\n\nResorts may be started from scratch, with more or less money depending on the difficulty level. Alternatively, players may take challenges where the task is to fix the problems of an existing resort in a specified period of time.\n\nThe game also allows the player to create a terrain with the map editor, with the option to import one's own height map.","torrent":{"xt":"urn:btih:cd679b51795cb99fd7d5dcb3a7369b4f3c73af46","amp;dn":"%5BPC+ISO%5D+Ski+Resort+Extreme+%287z%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd679b51795cb99fd7d5dcb3a7369b4f3c73af46","infoHashBuffer":{"type":"Buffer","data":[205,103,155,81,121,92,185,159,215,213,220,179,167,54,155,79,60,115,175,70]},"announce":[],"urlList":[]}}