{"title":"Civil War Edu Resource - Shelby Foote - Bruce Catton - TTC","uid":4312228,"size":6196340572,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ce3f61139078e3042c410b8335ed49eca39c2c4d&amp;dn=Civil+War+Edu+Resource+-+Shelby+Foote+-+Bruce+Catton+-+TTC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rambam1776","files":1041,"time":1216869973,"description":"What I have done here is to take a number of individual torrents from multiple sources, correct and update the tags, add battle maps in certain cases, and combine them all as one large download. There are six principal sections. \n\n1 ? The complete Civil War Masterpiece of Bruce Catton. Pulitzer Prize Winner and generally accepted as the finest historian ever of the Civil War.\n\n2 ? The complete trilogy of the masterful Shelby Foote, who was prominently featured in Ken Burns? PBS  - THE CIVIL WAR. This is easily to most readable.\n\n3 ? The Teaching Company?s Civil War Lecture Series, as taught by the eminent Prof. Gary Gallagher.\n\n4 ? Lincoln?s Greatest Speech, by Ronald C. White, is the coda to the war. - In this compelling account, noted historian Ronald C. White Jr. shows how Lincoln&amp;#039;s speech was initially greeted with confusion and hostility by many in the Union; commended by the legions of African Americans in attendance, abolitionist leader Frederick Douglass among them; and ultimately appropriated by his assassin John Wilkes Booth forty-one days later.  Filled with all the facts and factors surrounding the Second Inaugural, Lincoln&amp;#039;s Greatest Speech is both an important historical document and a thoughtful analysis of Lincoln&amp;#039;s moral and rhetorical genius.\n\n5 ? A good cross section of the Music of the American Civil War.\n\n6 ? A collection of civil war photos and the incomparable Osprey battle series books. I cannot offer enough thanks to the original uploaders who made these available.\n\nI would have dearly liked to have included the Pulitzer Prize winning Oxford History of America volume BATTLE CRY OF FREEDOM by James M. McPherson, the best single volume history of the American Civil War, but I cannot find a torrent of it anywhere. Included in the tags of these files are links to various educational websites, and battle maps are included. Anyone wishing to learn about the war (make sure you see the Ken Burns Documentary!) at a collegiate level will be well served by this torrent. The books included are the typical ones assigned by most history professors. If you know a student who will be taking American History in college, point them at this upload. The information following is from Wikipedia, regarding the authors and these seminal works. Great thanks to all the original uploaders!\n\n-\tRambam1776\n\n\n\nBruce Catton (October 9, 1899 ? August 28, 1978) was a journalist and a notable historian of the American Civil War. He won a Pulitzer Prize for history in 1954 for A Stillness at Appomattox, his study of the final campaign of the war in Virginia.\nCatton was known as a narrative historian who specialized in popular histories that emphasized the colorful characters and vignettes of history, in addition to the simple dates, facts, and analyses. His works, although well-researched, were generally not presented in a rigorous academic style, supported by footnotes. In the long line of Civil War historians, Catton is arguably the most prolific and popular of all, with Shelby Foote his only conceivable rival. Oliver Jensen, who succeeded him as editor of American Heritage magazine, wrote: &quot;There is a near-magic power of imagination in Catton&amp;#039;s work that seemed to project him physically into the battlefields, along the dusty roads and to the campfires of another age.&quot;\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Bruce_Catton&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Bruce_Catton&lt;/a&gt;\n\n\n\nThe Civil War: A Narrative (1974), a three volume, 3,000-page, 1.2 million-word history of the American Civil War by Shelby Foote, is the work for which he is best known. While it touches on political and social themes, the main thrust of the work is military history. The individual volumes include Fort Sumter to Perryville (1958), Fredericksburg to Meridian (1963), and Red River to Appomattox (1974).\n\nFort Sumter to Perryville\nThe first volume covers the roots of the war to the Battle of Perryville on October 8, 1862. All the significant battles are here, from Bull Run through Shiloh, the Seven Days Battles, Second Manassas to Antietam, and Perryville in the fall of 1862, but so are the smaller and often equally important engagements on both land and sea: Ball&amp;#039;s Bluff, Fort Donelson, Pea Ridge, Island No. Ten, New Orleans, Monitor versus Merrimac, and Stonewall Jackson&amp;#039;s Valley Campaign.\n\nFredericksburg to Meridian\nThe second volume is dominated by the almost continual confrontation of great armies. The starting point for this volume is the Battle of Fredericksburg, fought on December 13, 1862, between General Robert E. Lee&amp;#039;s Army of Northern Virginia and the Army of the Potomac commanded by Maj. Gen. Ambrose E. Burnside. For the fourth time, the Army of the Potomac attempts to take Richmond, resulting in the bloodbath at Fredericksburg. Then Joseph Hooker tries again, only to be repulsed at Chancellorsville as Stonewall Jackson turns his flank, resulting in Jackson&amp;#039;s death.\n\nIn the West, one of the most complex and determined sieges of the war has begun. Here, Ulysses S. Grant&amp;#039;s seven relentless efforts against Vicksburg demonstrate Lincoln and Grant&amp;#039;s determination.\n\nWith Vicksburg finally under siege, Lee again invades the North. The three-day conflict at Gettysburg receives plenty of attention in the book. (The lengthy chapter on Gettysburg has also been published as a separate book, Stars in Their Courses.)\n\nRed River to Appomattox\nFoote brings to a close the story of four years of turmoil and strife that altered American life forever. The final volume opens with the beginning of the two final, major confrontations of the war: Grant against Lee in Virginia, and Sherman pressing Johnston in North Georgia in 1864. The narrative describes the events and battles from Sherman&amp;#039;s march to the sea to Lincoln&amp;#039;s assassination and the surrender of Lee at Appomattox.\n\n\nShelby Dade Foote, Jr. (November 17, 1916 ? June 27, 2005) was an American novelist and a noted historian of the American Civil War. With geographic and cultural roots in the Mississippi Delta alluvium, Foote&amp;#039;s life and writing paralleled the radical shift from the agrarian planter system of the Old South to the Civil Rights era of the New South. Foote was relatively unknown to the general public for most of his career until his appearance in Ken Burns&amp;#039; PBS documentary The Civil War in 1990, where he introduced a generation of Americans to a war that he believed was &quot;central to all our lives.&quot;[1]\n\nWhen Burns&amp;#039; documentary aired in September, 1990, Foote appeared in almost ninety segments, about one hour of the eleven-hour series. Foote&amp;#039;s drawl, erudition, and quirk of speaking as if the war were still going on made him a favorite. He was described as &quot;the toast of Public TV,&quot; &quot;the media&amp;#039;s newest darling,&quot; and &quot;prime time&amp;#039;s newest star,&quot; and the result was a burst of book sales. In one week at the end of September, 1990, each volume of the paperback The Civil War: A Narrative sold 1,000 copies per day. By the middle of 1991, Random House sold 400,000 copies of the trilogy. Foote later told Burns, &quot;Ken, you&amp;#039;ve made me a millionaire.&quot;\n\nFoote&amp;#039;s commentary in the Burns film made many substantive comments about battles, generals, and issues. He also explained a puzzling question on nomenclature: why does the same battle often have two names? Foote&amp;#039;s answer: Northerners are usually from cities, so rivers and streams are noteworthy; whereas Southerners are usually rural, so they find towns noteworthy. Some examples:\n \tFirst and Second Battle of Bull Run/First and Second Manassas; \n \tBattle of Antietam (Creek)/Sharpsburg. \n\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Shelby_Foote&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Shelby_Foote&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:ce3f61139078e3042c410b8335ed49eca39c2c4d","amp;dn":"Civil+War+Edu+Resource+-+Shelby+Foote+-+Bruce+Catton+-+TTC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce3f61139078e3042c410b8335ed49eca39c2c4d","infoHashBuffer":{"type":"Buffer","data":[206,63,97,19,144,120,227,4,44,65,11,131,53,237,73,236,163,156,44,77]},"announce":[],"urlList":[]}}