{"title":"FS2004 Perfect Flight Airbus A380.zip","uid":3380390,"size":47277399,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ce415a65a420835bd96eae018fe9c99c5421a527&amp;dn=FS2004+Perfect+Flight+Airbus+A380.zip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"legendary_goku","files":1,"time":1126129026,"description":"Designed in close collaboration with major airlines, airport and airworthiness authorities, the A380 brings new standards of comfort and better economics in an aircraft that is more environmentally responsible. Whilst doing all of this, it allows growth and reduced congestion from today's airports with minimum change. Most importantly, the A380 introduces competition to the large aircraft sector, completing the Airbus product portfolio. n\nThe A380, which will seat 555 passengers in a glass interior layout, will enter airline service in 2006\n\n\n Fly The Airbus A380 includes: \n\n    *\n\n       Gmax model, fully animated and superb interior view \n\n    *\n\n      60 (!) A380 Liveries: Aerolineas Argentinas; Aer Lingus; Air Canada; Air Caledonie; Air China; Air France; Air Greenland; Air Inter; Air Jamaica; Airtours International; Air Portugal; Air Transat; Austrian Airlines; British Midland International; BWIA; Canada 3000; Cathay Pasific; Corsair; Cyprus Air; Dragonair; Garuda Indonesia; Iberworld; Edelweiss Air; Egypt Airlines; Emirates; Eva Air; Gulf Air; House Colors; Iberia; JMC Air; Korean Airlines; LTU International Airways; Lufthansa; Kuwait Airways; Tam Brasil; Lan Chile; Malaysia Airlines; MidEast Airlines; Monarch Airlines; MyTravel Airways; Northwest Airlines; Olympic Airways; Philippine Airlines; Qantas; Qatar Airways; Royal Jordanian; Royal Brunei; Sabena; SAS Scandinavian;Singapore Airlines;  Skyservice; SN Brussels; South African Airways; Srilankan Airlines; Swissair; Thai Airways; Thomas Cook; Turkish Airlines; Virgin Atlantic; US Airways; \n\n    *\n\n      A380 2d Panels \n\n    *\n\n      Virtual Cockpit (3d) \n\n    *\n\n      Stereo Sounds \n\n    *\n\n      Reflective textures mapping \n\n    *\n\n      Interactive Checklist and Kneeboard (You have direct access to all Documentation directly inside the Kneeboard) \n\n    *\n\n      ABL Adventure Manager - This exclusive feature allows you to design all Adventures you want. We are the first worldwide Company that has implemented the new Adventure Basic Language  \n\n\nE,joy this package It's the full install! No keygen or crack needed Just run the installation and enjoy! I hope that u guys like it! grtz, domi\n\n","torrent":{"xt":"urn:btih:ce415a65a420835bd96eae018fe9c99c5421a527","amp;dn":"FS2004+Perfect+Flight+Airbus+A380.zip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce415a65a420835bd96eae018fe9c99c5421a527","infoHashBuffer":{"type":"Buffer","data":[206,65,90,101,164,32,131,91,217,110,174,1,143,233,201,156,84,33,165,39]},"announce":[],"urlList":[]}}