{"title":"[JulesJordan] Bella Bellz (Big Booty Slut Gets A Big Black Cock","uid":14219941,"size":978194000,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:ce47d6671170edcd9f43076c19ef7bbbeb233605&amp;dn=%5BJulesJordan%5D+Bella+Bellz+%28Big+Booty+Slut+Gets+A+Big+Black+Cock&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"distinc","files":1,"time":1460032761,"description":".......:::Screenshots:::.......\r\n\r\n \nhttp://imagedisco.net/?v=4096858646\r\n \nhttp://imagedisco.net/?g=508115306\r\n\r\n\r\n\r\nPLOT:\r\n\r\nBIG BOOTY ALERT! DO NOT WATCH THIS SCENE IF YOU ARE NOT A FAN OF BIG, JUICY ASSES! IF YOU ARE BOTHERED BY A GIGANTIC-ASS WHITE GIRL BOUNCING HER CHEEKS UP AND DOWN AND TAKING A MASSIVE BLACK COCK IN ALL OF HER HOLES - DO NOT WATCH THIS SCENE. Who the fuck are we kidding?! You know where you are - JulesJordan.com - so click play and watch this scene featuring tattooed bubble-butt slut, Bella Bellz riding some BBC! It might just be her favorite hobby and this black stallion gives it to her. Prince Yahshua's Undisputed #2 is packed to the brim with scenes like this one and Bella has gone blonde but still loves that dark meat - and she takes it hard in this scene. Prince spreads her legs and grabs her pretty little feet while he rails her nice and fast, licking those little piggies before she goes back for a second helping of cock down her throat. She makes it nice and slippery to slide into her tight asshole while she fingers herself. This whore loves to play with her pussy with a cock in her booty and that booty does some WORK! It never stops bouncing except when she shows off her gaping hole! Whether she's taking it or riding it, the cock is happy when it's inside Bella Bellz and Prince rewards her with a big ol' helping of chocolate sauce!","torrent":{"xt":"urn:btih:ce47d6671170edcd9f43076c19ef7bbbeb233605","amp;dn":"%5BJulesJordan%5D+Bella+Bellz+%28Big+Booty+Slut+Gets+A+Big+Black+Cock","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce47d6671170edcd9f43076c19ef7bbbeb233605","infoHashBuffer":{"type":"Buffer","data":[206,71,214,103,17,112,237,205,159,67,7,108,25,239,123,187,235,35,54,5]},"announce":[],"urlList":[]}}