{"title":"Toby Harnden - Dead Men Risen (Mobi + Epub)","uid":8215713,"size":10973142,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ceaabf4172a2ed12211c521b9850c55e9c711ad5&amp;dn=Toby+Harnden+-+Dead+Men+Risen+%28Mobi+%2B+Epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"kevinkray","files":-1,"time":1362335121,"description":"WINNER OF THE ORWELL PRIZE 2012. This is the gripping story of the men of the Welsh Guards and their bloody battle for survival in Afghanistan in 2009. Underequipped and overstretched, they found themselves in the most intense fighting the British had experienced in a generation. They were led into battle by Lieutenant Colonel Rupert Thorneloe, a passionate believer in the justness of the war who was deeply dismayed by the way it was being resourced and conducted. Thorneloe was killed by an IED during Operation Panther's Claw, the biggest operation mounted by the British in Helmand. Dead Men Risen draws on secret documents written by Thorneloe, which raise questions from beyond the grave that will unnerve politicians and generals alike. The Welsh Guards also lost Major Sean Birchall, commanding officer of IX Company, and Lieutenant Mark Evison, a platoon commander whose candid personal diary was unnervingly prophetic. Not since the Second World War had a single British battalion lost officers at the three key levels of leadership. Harnden transports the reader into the heart of a conflict in which a soldier has to be prepared to kill and die, to ward off paralysing fear and watch comrades perish in agony. Given unprecedented access to the Welsh Guards, Harnden conducted hundreds of interviews in Afghanistan, England and Wales. He weaves the experiences of the guardsmen and the loved ones they left behind into a seamless and unsparing narrative that sits alongside a piercing analysis of the political and military strategy. No other book about modern warfare succeeds on so many levels.","torrent":{"xt":"urn:btih:ceaabf4172a2ed12211c521b9850c55e9c711ad5","amp;dn":"Toby+Harnden+-+Dead+Men+Risen+%28Mobi+%2B+Epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ceaabf4172a2ed12211c521b9850c55e9c711ad5","infoHashBuffer":{"type":"Buffer","data":[206,170,191,65,114,162,237,18,33,28,82,27,152,80,197,94,156,113,26,213]},"announce":[],"urlList":[]}}