{"title":"Cosmopolitan Middle East December 2012 (UAE)","uid":7932835,"size":111527609,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ced1c65ee54fc87be703e3267bf51b2124af3468&amp;dn=Cosmopolitan+Middle+East+December+2012+%28UAE%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"RAHMANAT1","files":3,"time":1355761573,"description":"RE-UPLOAD \n\nCosmopolitan is an international magazine for women. It was first published in 1886 in the United States as a family magazine, was later transformed into a literary magazine and eventually became a women's magazine in the late 1960s. Also known as Cosmo, its content as of 2011 included articles on relationships and how to have proper sex, health, careers, self-improvement, celebrities, as well as fashion and beauty. Published by Hearst Magazines, Cosmopolitan has 63 international editions, is printed in 32 languages and is distributed in more than 100 countries.\n\nThe magazine, and in particular its cover stories, have become more sexually explicit in tone, and covers have models wearing revealing clothes. Kroger, America's largest grocery chain, used to cover up Cosmopolitan at checkout stands because of complaints about sexually explicit headlines.The UK edition of Cosmopolitan, which began in 1972, was well known for sexual explicitness, with strong sexual language, male nudity and coverage of such subjects as rape. In 1999 CosmoGIRL!, a spinoff magazine targeting a teenage female audience, was created for international readership, but closed in December 2008.\t","torrent":{"xt":"urn:btih:ced1c65ee54fc87be703e3267bf51b2124af3468","amp;dn":"Cosmopolitan+Middle+East+December+2012+%28UAE%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ced1c65ee54fc87be703e3267bf51b2124af3468","infoHashBuffer":{"type":"Buffer","data":[206,209,198,94,229,79,200,123,231,3,227,38,123,245,27,33,36,175,52,104]},"announce":[],"urlList":[]}}