{"title":"Porn Legend Ginger Lynn - Classic Porn XXX","uid":8952224,"size":181065177,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:cedace5c294f537e754d5bfbe94648b5563b5130&amp;dn=Porn+Legend+Ginger+Lynn+-+Classic+Porn+XXX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"KidAtomic","files":-1,"time":1379910695,"description":"Ginger Lynn in a scene from Too Naughty To Say No\n\nPerformer AKA \tGynger Lynn, Ginger Allen, Ginger Lynn Allen, Ginger, Ginger Lynne\nDirector AKA \tGinger Lynn Allen\nBirthday\tDecember 14, 1962\nAstrology\tSagittarius \nBirthplace\tRockford, IL \nYears Active as Performer\t1984-2011 (Started around 22 years old)\nYear Active as Director\t2003\nEthnicity\tCaucasian\nNationality\tAmerican\nHair Color\tBlond\nMeasurements\t34B-24-34\nHeight\t        5 feet, 3 inches (160 cm)\nWeight\t        110 lbs (50 kg)\n\nTattoos\tKissing lips on right butt cheek; Right ankle; Back of neck (all done after she retired in 1986)\n\nNon-Ear Piercings\tNone\n\nComments\t\n- 1st anal scene: Pretty As You Feel (1984)\n\nGinger Lynn (born Ginger Lynn Allen; December 14, 1962) is an American pornographic model, prominent in 1980s videos. She also had occasional roles in low-budget B-movies. AVN has ranked her at #7 in a list of the 50 greatest porn stars of all time. After ending her adult-entertainment career she began using her full name of Ginger Lynn Allen and found work in a variety of B-movies. She had a late career comeback to the adult industry and made a brief series of movies. During this two-year period she toured the country doing interviews for radio shows and appearances at adult-entertainment stores.\n\nBorn in Illinois, Ginger Lynn Allen moved to California in 1982 after hearing about her grandfather's heart attack. Following her grandfather's death, a male friend came to live with her and became her &quot;first nice boyfriend&quot;. Allen was the major financial supporter in the relationship and needed to find a higher-paying job.[citation needed] When she answered an advertisement from the World Modeling Agency in September 1983, she was immediately hired and did a pictorial for Penthouse, which brought her to the attention of the adult film industry.\n\nAllen began as a nude model and then began performing in hardcore sex films as Ginger Lynn by December of 1983. Her first pornographic film role was in Surrender in Paradise, in which she starred with Jerry Butler. Allen's &quot;girl next door&quot; good looks led to a quick rise in her popularity and eventually she became one of the most popular female performers in adult-entertainment history. She had her own line of videos through Vivid Entertainment with director Bruce Seven. Allen received the Best New Starlet award in 1985 and is an inductee to the X-Rated Critics Organization (XRCO) and Adult Video News (AVN) Halls of Fame. Career highlights include her performance as the neighbor who introduces Tom Byron to sex in Kinky Business (1984) and her work in Slumber Party with Eric Edwards.\n\nAllen's work was also distinguished by explicit and inventive &quot;dirty talking&quot; during her performances. She was the first Vivid Entertainment Vivid Girl, beating out the then-underaged Traci Lords. She was later called to testify on Lords' behalf against porn producers; she refused, and according to her, was then targeted by the Internal Revenue Service for falsification of a tax return. Allen had at least six scenes with porn legend John Holmes early in her career and was the first onscreen female partner of prolific porn actor Peter North.\n\nIn February 1986 Allen decided to stop making adult videos and to establish a career in mainstream films using her full name. She appeared in several non-adult films, television shows and even interactive movie segments of the Wing Commander computer games.[2] She started her career in mainstream features with a small part in the western Young Guns II, which co-starred her former boyfriend Charlie Sheen's brother, Emilio Estevez.[3]\n\nAllen returned to the adult-film industry in 1999 for three movies: Torn (1999), White Lightning (2000) and New Wave Hookers 6 (2000). In December 2005 she appeared in American Pie: Band Camp (2005) playing the supporting role of Nurse Sanders. In March 2006 she became a host of Playboy Radio's Sirius Satellite Radio show, Night Calls Radio, with former adult film actress Christy Canyon. In June 2007 Allen performed for two of Kink.com's hardcore websites, Ultimate Surrender and Sex and Submission. In 2008, Allen appeared in the films Dirty Rotten Mother Fuckers with James Deen (24 years younger than her) and Seasoned Players 4 with Tom Byron, then performed in more than a dozen hardcore releases in each of the next two years.\n\nLynn had a long-term relationship with Los Angeles radio personality Ralph Garman.\n\nShe had a two-year relationship with Charlie Sheen from 1990 to 1992, including accompanying him through drug rehabilitation. Lynn met Sheen in early 1990 on the set of Young Guns II, after she had left adult movies five years previously. In 1991 Lynn was convicted in a federal tax-evasion case and ended up serving 4Â½ months in prison. Charlie Sheen and Martin Sheen wrote letters to the court in support of Allen during her trial. She also spent time in a rehabilitation center during this period because of cocaine abuse. Lynn and Sheen's relationship continued until Sheen was called upon to testify in the Heidi Fleiss trial. Although their relationship was not monogamous, the revelation that he had been with prostitutes was the start of the end of their relationship.\n\nIn a 2003 interview she described herself as the &quot;single mother of a five-year-old son.&quot;\n\nDespite the well-known allegations that Sheen is physically violent towards women, Lynn said she never saw the actor become abusive in the slightest, &quot;Not one time did he raise his voice. No violence,&quot; she said.\n","torrent":{"xt":"urn:btih:cedace5c294f537e754d5bfbe94648b5563b5130","amp;dn":"Porn+Legend+Ginger+Lynn+-+Classic+Porn+XXX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cedace5c294f537e754d5bfbe94648b5563b5130","infoHashBuffer":{"type":"Buffer","data":[206,218,206,92,41,79,83,126,117,77,91,251,233,70,72,181,86,59,81,48]},"announce":[],"urlList":[]}}