{"title":"Cuckold Fantasies vol. 24","uid":7525540,"size":642880316,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:cee006bb8323eb3083d73a826add752445b78fdd&amp;dn=Cuckold+Fantasies+vol.+24&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"merzedes","files":-1,"time":1344772139,"description":"\n\n\nForced Bi with Black Bull! Creampie Eating! Ball Licking by sissy husband!\n \n\n\nHot MILF Joclyn Stone enjoys dominating and controlling her wimpy husband, but what she really needs is a big dick. Enter black super-stud Jayson. Jocyln eagerly pulls his HUGE COCK out of his pants and gobbles it into her mouth.\n\n\n\nWhen her husband returns home to find his wife giving a stranger a BLOWJOB, he tries to protest. Joclyn reminds him who's in charge. She's already locked his puny penis in a CHASTITY cage, and now she's going to make him watch while she get pleased by her big black lover.\n \nShe makes both men stand side by side and laughs at she compares the size of their dicks. She forces her husband to his knees and makes him wear a frilly pink dress. She makes him wear high heels and do a little dance.\n \n \n \nJoclyn brings her hubby close while she sucks Jayson's cock. Hubby thinks that's as much humiliation as he can stand... then Joclyn shoves his mouth onto that cock as well. Although repelled by the FORCED BISEXUAL act, he's also clearly turned on.\n \n \n \nJoclyn makes him lick and suck Jayson's big black shaft and balls, laughing as he becomes more enthusiastic.\n \n \n \nShe sits on her hubby's face while she continues sucking cock. She makes hubby lick and worship her ass, the forces him to guide Jayson's massive member into her pussy. She makes him lick her clit as Jayson fucks her, hubby's head getting slammed with each long thrust.\n \n \n \nThey fuck in multiple positions while the poor husband watches and is made to occasionally lube up that giant cock with his mouth. When Jayson finally explodes in and on Joclyn's pussy, hubby is forced to slurp up the gooey CREAMPIE.\n \nJoclyn sits on her husband's face letting all the cum drip into his mouth. She allows him to JERK OFF, then makes him eat his own cum.\n\n\n\n\nScreens &lt;a href=&quot;\nhttp://www.romanvideo.net/shop/product_info.php?products_id=1563&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.romanvideo.net/shop/product_info.php?products_id=1563&lt;/a&gt;\n\n\n\nAnd if you like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n\n \n\nCheers  :-) \n","torrent":{"xt":"urn:btih:cee006bb8323eb3083d73a826add752445b78fdd","amp;dn":"Cuckold+Fantasies+vol.+24","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cee006bb8323eb3083d73a826add752445b78fdd","infoHashBuffer":{"type":"Buffer","data":[206,224,6,187,131,35,235,48,131,215,58,130,106,221,117,36,69,183,143,221]},"announce":[],"urlList":[]}}