{"title":"Unknown Armies 2nd Edition","uid":9613736,"size":22100360,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cf9cc660fca6d142fe74232557f1b707e86d2982&amp;dn=Unknown+Armies+2nd+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"qrry","files":-1,"time":1392378843,"description":"(That's not a scan, but a print-friendly official PDF grom here: &lt;a href=&quot;\nhttp://www.warehouse23.com/products/AG6020PDF&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.warehouse23.com/products/AG6020PDF&lt;/a&gt;\nEnjoy and support the authors, if you can!)\n\n\nWhat Will You Risk To Change The World?\n\nSomething big is going down. You don't know what. But you can feel it all around you. It's in the air, in the headlines of newspapers, in the blurry images on television. It is a secret you have yet to grasp, although the first syllable has been spoken in a dream you cannot quite recall.\n\nYou need to know more. The world you know is not enough for you. You want to go deeper. At times you want to let go of reality and let yourself slip into the delirium of pure understanding. Anything would be preferable to the ignorance of daily life. You know there is a place, defined by ideas if not by atoms, and it holds the key to your desires.\n\nBut there is danger there. People vanish, die horribly, become madmen, for the sake of whatever the secret is that lies at the heart of the unseen world.\n\nThat world is the occult underground. Find it, before it finds you.\n\nUnknown Armies is a roleplaying game of power and consequences. This second edition rulebook is reorganized and rewritten to better serve new players and to build stronger campaigns. It includes new schools of magick, new avatars, and much more.","torrent":{"xt":"urn:btih:cf9cc660fca6d142fe74232557f1b707e86d2982","amp;dn":"Unknown+Armies+2nd+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf9cc660fca6d142fe74232557f1b707e86d2982","infoHashBuffer":{"type":"Buffer","data":[207,156,198,96,252,166,209,66,254,116,35,37,87,241,183,7,232,109,41,130]},"announce":[],"urlList":[]}}