{"title":"Kristin Hannah - The Nightingale","uid":13470376,"size":499722255,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d006d13049a775147a5c6c9e6807626593ca703b&amp;dn=Kristin+Hannah+-+The+Nightingale&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Cybotage","files":17,"time":1454971538,"description":"In love we find out who we want to be.\r\nIn war we find out who we are.\r\n\r\nFRANCE, 1939\r\n\r\nIn the quiet village of Carriveau, Vianne Mauriac says goodbye to her husband, Antoine, as he heads for the Front. She doesn’t believe that the Nazis will invade France...but invade they do, in droves of marching soldiers, in caravans of trucks and tanks, in planes that fill the skies and drop bombs upon the innocent. When France is overrun, Vianne is forced to take an enemy into her house, and suddenly her every move is watched; her life and her child’s life is at constant risk. Without food or money or hope, as danger escalates around her, she must make one terrible choice after another.\r\n\r\nVianne’s sister, Isabelle, is a rebellious eighteen-year-old girl, searching for purpose with all the reckless passion of youth. While thousands of Parisians march into the unknown terrors of war, she meets the compelling and mysterious Gäetan, a partisan who believes the French can fight the Nazis from within France, and she falls in love as only the young can...completely. When he betrays her, Isabelle races headlong into danger and joins the Resistance, never looking back or giving a thought to the real--and deadly--consequences.\r\n\r\nWith courage, grace and powerful insight, bestselling author Kristin Hannah takes her talented pen to the epic panorama of WWII and illuminates an intimate part of history seldom seen: the women’s war. The Nightingale tells the stories of two sisters, separated by years and experience, by ideals, passion and circumstance, each embarking on her own dangerous path toward survival, love, and freedom in German-occupied, war-torn France--a heartbreakingly beautiful novel that celebrates the resilience of the human spirit and the durability of women. It is a novel for everyone, a novel for a lifetime.\r\n\r\n\r\n\r\nRead by Polly Stone\r\nFormat: MP3\r\nUnabridged","torrent":{"xt":"urn:btih:d006d13049a775147a5c6c9e6807626593ca703b","amp;dn":"Kristin+Hannah+-+The+Nightingale","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d006d13049a775147a5c6c9e6807626593ca703b","infoHashBuffer":{"type":"Buffer","data":[208,6,209,48,73,167,117,20,122,92,108,158,104,7,98,101,147,202,112,59]},"announce":[],"urlList":[]}}