{"title":"Court Yard Hounds - Amelita [2013][EAC,log,cue. FLAC]","uid":8928423,"size":291613907,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d22e933c55293ff39ec222373f5d6cd7d64f310d&amp;dn=Court+Yard+Hounds+-+Amelita+%5B2013%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"dickspic","files":15,"time":1379411442,"description":"Artist:Court Yard Hounds\nRelease:Amelita \nReleased: 2013\nLabel: Columbia\nCatalog#: 88883 74759 2\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle: country\n\n\nSunshine (3:40)\nAmelita (4:12)\nThe World Smiles (3:24)\nAimless Upward (3:55)\nA Guy Like You (3:43)\nRock All Night (3:45)\nPhoebe (3:57)\nDivided (3:25)\nGets You Down (3:56)\nWatch Your Step (3:34)\nThe Road You Take (4:56)\n\nThree years on from Court Yard Hounds' eponymous debut, Natalie Maines had returned from her self-imposed silence, touring with Emily Robinson and Martie Maguire as the Dixie Chicks in both 2010 and 2013, but Maines showed no interest in recording new material (her 2013 solo debut largely consisted of covers). Robinson and Maguire, in contrast, are very committed to moving forward via Court Yard Hounds, writing a set of 11 new songs -- many penned with Martin Strayer -- and working once again with producer Jim Scott on Amelita, their 2013 sequel to their 2010 debut. Things have changed in Court Yard Hounds' inner world -- notably, Robinson divorced between the two CYH records -- and that's reflected within the very sound of Amelita, which is lighter and livelier than the carefully considered debut. Some of this is due to the production -- there's air here, letting the harmonies and acoustic guitars breathe -- but, strangely enough for a pair of sisters who have played together professionally for nearly a quarter century, the biggest difference is that Court Yard Hounds have developed their own identity. Robinson and Maguire are using the inherent sweetness of their harmonies to their advantage, allowing themselves to have a gentle touch that sometimes is deceptive, as there is a good amount of swagger and even snark hidden underneath that honeyed surface. Here, Court Yard Hounds embrace freedom to be something different than the Dixie Chicks, which also means they're not quite identifying as contemporary country, either. &quot;Phoebe&quot; is a modified bluegrass stomp and &quot;Sunshine&quot; comes streaming in on breezy harmonies, while &quot;Rock All Night&quot; and &quot;Watch Your Step&quot; are anchored in roots rock, but Amelita is, at its heart, an adult pop album and it's a gorgeous one at that: it glides by easily but it digs deep.","torrent":{"xt":"urn:btih:d22e933c55293ff39ec222373f5d6cd7d64f310d","amp;dn":"Court+Yard+Hounds+-+Amelita+%5B2013%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d22e933c55293ff39ec222373f5d6cd7d64f310d","infoHashBuffer":{"type":"Buffer","data":[210,46,147,60,85,41,63,243,158,194,34,55,63,93,108,215,214,79,49,13]},"announce":[],"urlList":[]}}