{"title":"Nokia firewall, VPN, and IPSO configuration guide","uid":4747431,"size":8344065,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d25c25896a5854bc43fbeea462dadf5b424ab92c&amp;dn=Nokia+firewall%2C+VPN%2C+and+IPSO+configuration+guide&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"VasiaZozulia","files":1,"time":1235953003,"description":"The Only Book and Companion Web Site Covering Nokia's Firewall/VPN Appliances, which is the #3 security appliance worldwide.\n\nSyngress has a long history of publishing market-leading books for system administrators and security professionals on commercial security products, particularly Firewall and Virtual Private Network (VPN) appliances from Cisco, Check Point, Juniper, SonicWall, and Nokia (see related titles for sales histories). The Nokia Firewall, VPN, and IPSO Configuration Guide will be the only book on the market covering the all-new Nokia Firewall/VPN Appliance suite. Nokia Firewall/VPN appliances are designed to protect and extend the network perimeter.\n\nAccording to IDC research, Nokia Firewall/VPN Appliances hold the #3 worldwide market-share position in this space behind Cisco and Juniper/NetScreen. IDC estimated the total Firewall/VPN market at $6 billion in 2007, and Nokia owns 6.6% of this market. Nokia's primary customers for security appliances are Mid-size to Large enterprises who need site-to-site connectivity and Mid-size to Large enterprises who need remote access connectivity through enterprise-deployed mobile devices. Nokia appliances for this market are priced form $1,000 for the simplest devices (Nokia IP60) up to $60,0000 for large enterprise- and service-provider class devices (like the Nokia IP2450 released in Q4 2007). While the feature set of such a broad product range obviously varies greatly, all of the appliances run on the same operating system: Nokia IPSO (IPSO refers to Ipsilon Networks, a company specializing in IP switching acquired by Nokia in 1997. The definition of the acronym has little to no meaning for customers.) As a result of this common operating system across the product line, The Nokia Firewall, VPN, and IPSO Configuration Guide will be an essential reference to users of any of these products. Users manage the Nokia IPSO (which is a Linux variant, specifically designed for these appliances) through a Web interface called Nokia Network Voyager or via a powerful Command Line Interface (CLI). Coverage within the book becomes increasingly complex relative to the product line.\n\nThe Nokia Firewall, VPN, and IPSO Configuration Guide and companion Web site will provide seasoned network administrators and security professionals with the in-depth coverage and step-by-step walkthroughs they require to properly secure their network perimeters and ensure safe connectivity for remote users. The book contains special chapters devoted to mastering the complex Nokia IPSO command line, as well as tips and tricks for taking advantage of the new &quot;ease of use&quot; features in the Nokia Network Voyager Web interface. In addition, the companion Web site offers downloadable video walkthroughs on various installation and troubleshooting tips from the authors.\n\n* Only book on the market covering Nokia Firewall/VPN appliances, which hold 6.6% of a $6 billion market\n* Companion website offers video walkthroughs on various installation and troubleshooting tips from the authors\n* Special chapters detail mastering the complex Nokia IPSO command line, as well as tips and tricks for taking advantage of the new &quot;ease of use&quot; features in the Nokia Network Voyager Web interface","torrent":{"xt":"urn:btih:d25c25896a5854bc43fbeea462dadf5b424ab92c","amp;dn":"Nokia+firewall%2C+VPN%2C+and+IPSO+configuration+guide","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d25c25896a5854bc43fbeea462dadf5b424ab92c","infoHashBuffer":{"type":"Buffer","data":[210,92,37,137,106,88,84,188,67,251,238,164,98,218,223,91,66,74,185,44]},"announce":[],"urlList":[]}}