{"title":"Miley Cyrus - When I Look At You  (2nafish)","uid":5394595,"size":141512708,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:d5fb7070a60c3f5fd8da56090d6cf16cc558592b&amp;dn=Miley+Cyrus+-+When+I+Look+At+You++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1267143357,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;When I Look at You&quot; is a power ballad performed by American recording artist and actress Miley Cyrus, featured on the 2010 film The Last Song. It will be released as the second single from Cyrus' extended play The Time of Our Lives (2009) by Hollywood Records; it will also be the lead single from the The Last Song soundtrack. The song has thus far peaked at number fifty-nine on the Canadian Hot 100 and number eighty-eight on the US Billboard Hot 100. It is set to be officially released on mainstream radio on February 16, 2010.\n\nThe music video for &quot;When I Look at You&quot; was directed by Adam Shankman, producer of The Last Song. It was filmed on August 16, 2009 in Savannah, Georgia. Shankman tweeted that the music video would be released in October 2009, but it was leaked to the Internet on September 11, 2009.\n\nThe video features Cyrus playing a grand piano and frolicking with Hemsworth in various Georgia locations while singing. A second version of the music video replaces scenes of Hemsworth and Cyrus frolicking with clips from the movie.\n\nThe Time of Our Lives is an extended play by American pop recording artist Miley Cyrus. It was released on August 28, 2009 under Hollywood Records as a Wal-Mart exclusive. It was specially made to reciprocally promote Cyrus's joint clothing line with Max Azria. Cyrus worked with several producers and writers on the album, mainly Dr. Luke and John Shanks, the latter who produced Cyrus's successful song &quot;The Climb.&quot; Musically, the album has an inclination towards rock and represented a musical transition for Cyrus. The songs are generally inspired by love and portray some of Cyrus's personal struggles and life, though she only co-wrote &quot;Before the Storm.&quot;\n\nThe extended play received critical success, with reviewers claiming it was an intelligent transition. The Time of Our Lives found commercial success by reaching the second position of the Billboard 200 for two weeks and becoming Cyrus's fourth top ten album.\n\nThe lead single from the album, &quot;Party in the U.S.A.,&quot; became Cyrus's highest charting and Hollywood Records' fastest selling single; it reached number two in the Billboard Hot 100 and the top ten in various nations. She is also to release another single in correlation to the 2010 film, The Last Song, entitled &quot;When I Look at You&quot;. The album was promoted through mainly live performances at numerous venues, notably Cyrus' first international tour, the Wonder World Tour, and a controversial performance at the 2009 Teen Choice Awards. The EP has sold over 1,280,000 copies in United States to date.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:d5fb7070a60c3f5fd8da56090d6cf16cc558592b","amp;dn":"Miley+Cyrus+-+When+I+Look+At+You++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5fb7070a60c3f5fd8da56090d6cf16cc558592b","infoHashBuffer":{"type":"Buffer","data":[213,251,112,112,166,12,63,95,216,218,86,9,13,108,241,108,197,88,89,43]},"announce":[],"urlList":[]}}