{"title":"SNOG Healthy Treats Cookbook [Epub] [StormRG]","uid":11101862,"size":45534588,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d60af9e140575470d18b5a946ea909d745b12622&amp;dn=SNOG+Healthy+Treats+Cookbook+%5BEpub%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"krystine","files":-1,"time":1411678718,"description":"SNOG Healthy Treats Cookbook\nAuthor: Pablo Uribe &amp; Rob Baines\nPublished: 2014\nPublisher: Ryland Peters &amp; Small\nISBN: 9781849750806\nFormat: Retail Epub\nReader Required:\nEpub- Adobe Digital Editions, Calibre, MoonReader for Android\n\n\nTested on the above readers with no problems on laptop and Android tablet. \nDon't hesitate to PM me if you have any questions or problem with the download, as comments on the torrent are easy to miss. \nPlease allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nEnjoy! \n\n\nSnog is the hip new food brand responsible for bringing deliciously healthy frozen yogurt to London. Rob Baines and Pablo Uribe discovered frozen no-fat organic yogurt, (topped with fresh fruit and drizzled with the natural sweetener agave nectar) in Miami and the idea for an innovative business was born. They now have four super-stylish London stores - in South Kensington, Soho, Westfield and Covent Garden - serving frozen yogurt, toppings, drinks and gluten-free bakes. All are healthy and totally delicious treats you can enjoy without the guilt. In this irresistible new cookbook they share 60 of their favourite recipes with chapters on Frozen Treats, Gluten-free Baked Treats, Raw Food Treats and Smoothies &amp; Drinks. Each recipe makes the most of delicious natural ingredients and is accompanied by an inspirational health tip. From Pomegranate Vanilla Pod Frozen Yogurt to a Iced Almond Chai, being good never tasted so great.\n\nBefore founding Snog, Pablo Uribe worked in architecture and interior design, including designing a Miami beach house for Calvin Klein, and Rob Baines worked in investment banking and the speciality coffee market.\n","torrent":{"xt":"urn:btih:d60af9e140575470d18b5a946ea909d745b12622","amp;dn":"SNOG+Healthy+Treats+Cookbook+%5BEpub%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d60af9e140575470d18b5a946ea909d745b12622","infoHashBuffer":{"type":"Buffer","data":[214,10,249,225,64,87,84,112,209,139,90,148,110,169,9,215,69,177,38,34]},"announce":[],"urlList":[]}}