{"title":"The Baltic: A History by Michael North","uid":14469289,"size":3389296,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d81e3a9fb89750cd16a696fcbdaf1c07409b2df6&amp;dn=The+Baltic%3A+A+History+by+Michael+North+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Dr.Soc","files":1,"time":1461887362,"description":"The Baltic: A History by Michael North \r\nEnglish | ISBN: 0674744101 | 2015 | 448 pages | PDF | 3 MB\r\n\r\nIn this overview of the Baltic region from the Vikings to the European Union, Michael North presents the sea and the lands that surround it as a Nordic Mediterranean, a maritime zone of shared influence, with its own distinct patterns of trade, cultural exchange, and conflict. Covering over a thousand years in a part of the world where seas have been much more connective than land, The Baltic: A History&quot; transforms the way we think about a body of water too often ignored in studies of the world s major waterways. The Baltic lands have been populated since prehistory by diverse linguistic groups: Balts, Slavs, Germans, and Finns. North traces how the various tribes, peoples, and states of the region have lived in peace and at war, as both global powers and pawns of foreign regimes, and as exceptionally creative interpreters of cultural movements from Christianity to Romanticism and Modernism. He examines the golden age of the Vikings, the Hanseatic League, Gustavus Adolphus of Sweden, and Peter the Great, and looks at the hard choices people had to make in the twentieth century as fascists, communists, and liberal democrats played out their ambitions on the region s doorstep. With its vigorous trade in furs, fish, timber, amber, and grain and its strategic position as a thruway for oil and natural gas, the Baltic has been and remains one of the great economic and cultural crossroads of the world.&quot;","torrent":{"xt":"urn:btih:d81e3a9fb89750cd16a696fcbdaf1c07409b2df6","amp;dn":"The+Baltic%3A+A+History+by+Michael+North+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d81e3a9fb89750cd16a696fcbdaf1c07409b2df6","infoHashBuffer":{"type":"Buffer","data":[216,30,58,159,184,151,80,205,22,166,150,252,189,175,28,7,64,155,45,246]},"announce":[],"urlList":[]}}