{"title":"Serenity HD 720","uid":9683369,"size":13803229351,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:d82086d331e2b5f6bd339e7501a287870bd7135f&amp;dn=Serenity+HD+720&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"godrulz","files":2,"time":1393707390,"description":"Serenity (film)\nFrom Wikipedia, the free encyclopedia\n\nSerenity is a 2005 American space western film written and directed by Joss Whedon. It is a continuation of Whedon's short-lived 2002 Fox science fiction television series Firefly and stars the same cast, taking place after the events of the final episode. Set in 2517, Serenity is the story of the captain and crew of Serenity, a &quot;Firefly-class&quot; spaceship. The captain and first mate are veterans of the Unification War, having fought on the losing side. Their lives of petty crime are interrupted by a psychic passenger who harbors a dangerous secret.\nThe film was released in North America on September 30, 2005 by Universal Pictures. It received generally positive reviews and was #2 during its opening weekend but it did not make back its budget until its home media release. Serenity won numerous awards, including the 2006 Hugo Award for Best Dramatic Presentation.\n\nPlot[edit]\n\nIn the 26th century, humanity has left an overpopulated and decimated Earth and moved to a new star system, colonizing many planets and moons.\nThe Alliance has won a war against the Colonies, less established planets in the outer solar system. A young girl named River Tam is the most promising of a number of young people being mentally and physically conditioned against their will by Alliance scientists. Rescued by her brother Simon, the two find refuge aboard the Firefly-class transport ship Serenity, captained by gun-for-hire Malcolm &quot;Mal&quot; Reynolds, a Colonial veteran. An Alliance agent, the Operative, is charged with finding and killing River, as high Alliance politicians have accidentally exposed top secrets to her psychic abilities.\nAboard Serenity, Mal takes River along on a bank robbery, against her brother's objections. They are attacked by Reavers, wildly savage humans who eat their victims alive. They escape, but Simon decides that he and River will leave Serenity at the next port. While Mal meets fences Fanty and Mingo at a bar, a TV commercial causes River to attack the patrons with effective martial arts. Just before she can shoot Mal, Simon arrives and shouts a &quot;safe word&quot; which causes her to fall asleep. Mal carries River back to Serenity, but the incident is captured on camera. The crew contacts a reclusive hacker known as Mr. Universe who analyzes the commercial and discovers a subliminal message being broadcast across Alliance space designed specifically to trigger River. He notes that River whispered &quot;Miranda&quot; before attacking.\nWhile hiding out on Haven, a mining colony and home of Shepherd Book, Mal receives a call from Inara, a former passenger, offering work. Suspecting a trap but fearing she is in danger, Mal goes to her sanctuary and is confronted by the Operative. He promises to let Mal go free if he turns River over, but he refuses and, thanks to Inara's quick thinking, she and Mal escape. After another of River's outbursts, the crew discover that Miranda is a remote planet that had become uninhabitable. Serenity returns to Haven while the crew ponder their next move. They discover that the outpost has been destroyed and the residents slaughtered, including Shepherd Book. They then learn The Operative is killing all of Mal's contacts to deny him a safe haven. He promises that he will pursue them until he gets River. Mal decides to travel to Miranda to see if he can learn the truth of the situation.\nThe route to Miranda is blocked by a region swarming with Reavers, so Mal disguises Serenity as a Reaver ship (an act that his first mate, Zoe, strongly protests). After sailing through a fleet of Reaver vessels, the crew discovers a habitable planet with cities filled with mummified corpses. They discover a recording by an Alliance survey team explaining that an experimental chemical, designed to suppress aggression in the residents, was introduced into the air processing system. The agent worked too well, and the colonists became so docile they eventually stopped reproducing, speaking and eating, simply allowing themselves to peacefully die. However, a small portion of the population had the opposite reaction, becoming aggressive and violent with no sense of logic or reason, eventually becoming the Reavers.\nMal contacts Mr. Universe to arrange to have the log broadcast across all the communication spectrum but the Operative is already there and has Mr. Universe lure them in, before mortally wounding him. Mal suspects Serenity is heading into a trap, so while traveling back through Reaver space, he opens fire on one of their ships. The Reavers pursue Serenity to Mr. Universe's planet, where they stumble upon the waiting Alliance fleet and engage them in battle. The Operative's ship is destroyed, but he survives by riding an escape pod to safety. Serenity is damaged by a pursuing Reaver ship but manages to crash land. Shortly after the crash, Hoban &quot;Wash&quot; Washburne is killed by Reavers that attack the ship, and the crew flees. Finding Mr. Universe dead and his equipment wrecked, Mal learns of a secret backup transmitter from a message recorded by the dying Mr. Universe. The crew makes a stand against the Reavers to buy Mal the time to send the message. After a firefight, the crew retreat behind a set of blast doors, but the doors only partially close. Zoe and Kaylee are wounded. Simon discovers he has left his medical kit behind; as he rises to retrieve it, he is shot. Severely wounded, he apologizes to River for failing her. She tearfully replies that it is her turn to take care of him. She charges through the opening in the blast doors, triggers the closing mechanism and throws the medical kit through the opening before the Reavers swarm over her and drag her away.\nMal reaches the transmitter, but The Operative is close behind. In hand-to-hand combat Mal is badly wounded, but manages to disable his opponent and bind him to a railing, forcing him to watch the recording. Mal returns to his crew, and the blast doors open to reveal that River has dispatched all of the Reavers. However, the wall behind her explodes and Alliance troops rush in. The Operative recognizes his defeat and that his vision of a 'better world' is inherently flawed, and he orders his men to stand down and treat the wounded in Mal's crew.\nAfter the crew erect memorials to Shepherd Book, &quot;Wash&quot; and Mr. Universe, they patch up Serenity. Kaylee and Simon consummate their relationship. The disillusioned Operative tells Mal that the Alliance government has been weakened and that he will try his best to present his former foe in the best light, but cannot guarantee that others will not be sent after Mal and his crew. Inara decides to rejoin the crew of the &quot;Serenity&quot;, and the ship lifts off with River as Mal's new copilot","torrent":{"xt":"urn:btih:d82086d331e2b5f6bd339e7501a287870bd7135f","amp;dn":"Serenity+HD+720","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d82086d331e2b5f6bd339e7501a287870bd7135f","infoHashBuffer":{"type":"Buffer","data":[216,32,134,211,49,226,181,246,189,51,158,117,1,162,135,135,11,215,19,95]},"announce":[],"urlList":[]}}