{"title":"Tootie's June 2014 Mix (Studio Version)","uid":10644388,"size":642765792,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d98891264008ad3105a47561dd4a70692f41207c&amp;dn=Tootie%27s+June+2014+Mix+%28Studio+Version%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"CyberTootie","files":1,"time":1406521290,"description":"Tootie's June 2014 Mix was a custom music compilation concept by Tootie. The concept was a unique endeavor for Tootie. It was to become part of Tootie's monthly mix series, but the concept called for the mix to be sourced solely from recordings of Tootie's DJ performance of the mix's tracklist, which consisted entirely of electronic dance music (EDM). The DJ performance, which was also somewhat broadcast live over the internet, occurred on June 13, 2014 during Silvia's Weekend Adventure of 2014. However, due to mistakes and technical difficulties, Tootie decided to also release a more polished version of the mix. The different versions of the mix were dubbed the Live Version and the Studio Version respectively. The different versions of the mix are largely similar, however the Live Version includes Tootie's vocals as heard during his DJ performance.\n\nFor this Studio Version, Tootie took to mixing the tracks with Adobe Audition 3 and mixed the tracks as was planned for the live performance for the most part, although some small changes were made in that regard. Also, the Studio Version does not utilize the sound effects or the within-song DJ effects of the live performance, and two track volume levels were changed between the live performance and the production of the Studio Version.\n\nRecordings from VirtualDJ were utilized for the portions of songs that had to be time-shifted for beat synchronization and FFT filtering was performed within Audition for track intermixing purposes, otherwise the tracks are as pure as they normally are in a Tootie mix.\n\n   Mondkopf - Werewolf Theme\n   The Lost Boyz - On a Full Moon\n   The Prodigy - Smack My Bitch Up (Noisia Remix)\n   Computer Club feat. Frankmusik - Losing Streak\n   Evermore - It's Too Late (Dirty South Remix)\n   MSTRKRFT feat. John Legend - Heartbreaker (Wolfgang Gartner Remix)\n   Roger Sanchez feat. Lisa Pure - Lost (D-Trax &amp; Dimitri Valeff Remix)\n   Moguai - ACIIID\n   The Lonely Island feat. Lil Jon &amp; Sam F - When Will the Bass Drop\n   Steve Aoki, Diplo &amp; Deorro feat. Steve Bays - Freak\n   Richard Vission feat. Luciana - When It Feels This Good\n   Lady Gaga - Swine\n   Miss Kittin &amp; The Hacker - Frank Sinatra (2001 Remix)\n   deadmau5 feat. Melleefresh - Hey Baby\n   Armin van Buuren - Ping Pong\n   MAKJ feat. Lil Jon - Let's Get Fucked Up\n   TsT &amp; twoloud  - Drop It Like This\n   Wolfgang Gartner - Wolfgang's 5th Symphony\n   deadmau5 - Strobe\n\nDetails:\nFormat: FLAC, level 7\nLength: 1:40:02.113\nAverage bitrate: 857 kbps\nEmbedded CUE Sheet\n\nPlayback verified with foobar2000.","torrent":{"xt":"urn:btih:d98891264008ad3105a47561dd4a70692f41207c","amp;dn":"Tootie%27s+June+2014+Mix+%28Studio+Version%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d98891264008ad3105a47561dd4a70692f41207c","infoHashBuffer":{"type":"Buffer","data":[217,136,145,38,64,8,173,49,5,164,117,97,221,74,112,105,47,65,32,124]},"announce":[],"urlList":[]}}