{"title":"The Passenger","uid":3769514,"size":1487830801,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d9882336296cc39ab6d47735fc713ed6274a41e6&amp;dn=The+Passenger&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lord_terabyte","files":4,"time":1186812190,"description":"XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX\nXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX\nXXXXXXXXX The Passenger XXXXXXXXX\nXXXXXXXXXX DVD to AVI XXXXXXXXXXX\nXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX\nXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX\n\nIMDB INFO: http://www.imdb.com/title/tt0073580/\n\nVideo size: 624x336\nAudio 1: MPEG Layer-3, 48000hz, 16bps, 2ch (The Film)\nAudio 1: MPEG Layer-3, 48000hz, 16bps, 2ch (Commentary by Jack Nicholson)\nAudio Bit Rate: 128kbps CBR\nFrame Rate: 23 frames/second\nVideo Compression: Xvid\nAspect Ratio: 1.85:1\nRunning Time: 126 Minutes\nLanguage: English\nSubtitles: English, Francais, Espanol, Portugues, Chinese &amp; Thai (External)\nFilesize: 1400 Megabytes\n\n\nPlot: The Passenger is one of those movies that is all about the vision of the director, in this case, screen legend Michelangelo Antonioni. Starring none other than Jack Nicholson, and featuring a plot billed as an international romantic thriller, The Passenger defies expectations by turning the genre on its head, making the characters and the story secondary to theme and tone. London-based Journalist David Locke (Nicholson) is working in North Africa when a fellow traveler by the name of David Robertson, who looks remarkably like him, happens to die suddenly. Burned out and depleted, Locke decides to assume the dead man?s identity, drops everything, and starts again as a new man with a new life. With no idea of who Robertson was or what he did for a living, Locke uses Robertson?s datebook as a guide as he travels through Europe and Africa, takes meetings with people he finds out are gun runners, and ends up falling for a beautiful young woman (Maria Schneider). As Robertson, David Locke thinks he has found an exhilirating new freedom, but the fact is he&amp;#039;s in over his head: there are people looking for him and his life could be in danger.\n\nThe movie is a thriller in structure only. While designed for suspense, it?s just a premise for Antonioni to explore on themes of identity, humankind?s seemingly futile relationship to the world around us, and isolation. For Antonioni, the action is the means by which the image unfolds, and not the other way around. The actors and the plot are set pieces, simply smaller means to a larger end, and the image and atmosphere supersede all else. A slow pace, long, lingering shots, a focus on emptiness, and a detached, almost brutally objective point of view are the trademarks on full display here. Especially notable is the stunning seven-minute long shot in the final scene, one of the most famous in cinema history, which Nicholson, in his commentary, tags as an &quot;Antonioni joke.&quot; It caps a crowning achievement by one of the big screen?s most visionary directors.\t\t","torrent":{"xt":"urn:btih:d9882336296cc39ab6d47735fc713ed6274a41e6","amp;dn":"The+Passenger","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9882336296cc39ab6d47735fc713ed6274a41e6","infoHashBuffer":{"type":"Buffer","data":[217,136,35,54,41,108,195,154,182,212,119,53,252,113,62,214,39,74,65,230]},"announce":[],"urlList":[]}}