{"title":"dDub - Awake at Dawn","uid":4608424,"size":86164585,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d9e0f40e153996a55fd9002c95200d3c4b4d6cb2&amp;dn=dDub+-+Awake+at+Dawn&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"nz_flyboy","files":11,"time":1230510374,"description":"The Indian elephant has a gestation period of 22 months. The gestation period for dDUB's Awake at Dawn has been considerably longer. It's been so long in fact that the line-up of the band when the album finally saw the light of day was nearly totally different from when the recording started. Now while an NZ Idol winner might be able to knock out an album in 7 days the extra long recording period appears to have sat well with one of NZ's hardest working live bands.\n\nStarting off with the long and languorous I See a Sign a pattern is very quickly established for the rest of the album. There's more delay than the Auckland public transport system, the off-beat dominates, the bass is dark and mixed to the front and the lyrics are delivered in a sometimes plaintive and sometimes celebratory voice by Sideshow Bob haired front man Derek Browne. The horns which dominate nearly every track are rich and full and have a timbre reminiscent of a brass section in a Spanish bolero. The Flow, which will be familiar to anyone who listens to b-Net radio in New Zealand, is presented here in its full 7 minute and 2 second glory and live favourites such as Juju Mama and Give it Some keep the party going just like a hot night at the Dux, Bodega or the Safari Lounge.\n\nAnyone who's seen dDUB live over the past 6 years will not be disappointed. Awake at Dawn perfectly captures the spirit of a band who are renowned for the tightness of their live set. Dub and reggae have traditionally been genres that Wellington and Christchurch bands have excelled in (is there more pot smoked south of the Bombay Hills?) however with Awake at Dawn Auckland finally stakes its place in the Aotearoa dub scene.","torrent":{"xt":"urn:btih:d9e0f40e153996a55fd9002c95200d3c4b4d6cb2","amp;dn":"dDub+-+Awake+at+Dawn","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9e0f40e153996a55fd9002c95200d3c4b4d6cb2","infoHashBuffer":{"type":"Buffer","data":[217,224,244,14,21,57,150,165,95,217,0,44,149,32,13,60,75,77,108,178]},"announce":[],"urlList":[]}}