{"title":"En.El.Nombre.Del.Rey.(2008).DVDrip.AC3.5.1.Xvid.Spanish.Lanzamie","uid":4978598,"size":1460214096,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:da4b27e12dc3f880cf6e4afe2e28321541702613&amp;dn=En.El.Nombre.Del.Rey.%282008%29.DVDrip.AC3.5.1.Xvid.Spanish.Lanzamie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LDivx","files":4,"time":1246140724,"description":"En el nombre del Rey (2008)\n Aventuras | 150 min. | En DVD \nTÃƒÂ­tulo: En el nombre del Rey\nTÃƒÂ­tulo original: In the Name of the King: A Dungeon Siege Tale\nPaÃƒÂ­s: USA \nEstreno en USA: 11/01/2008 \nEstreno en EspaÃƒÂ±a: 27/02/2009 \nProductora: Event Film \nDirector: Uwe Boll \nGuiÃƒÂ³n: Glenn M. Benest, David Freeman, Doug Taylor \nReparto: Jason Statham, Leelee Sobieski, John Rhys-Davies, Ray Liotta, Matthew Lillard, Burt Reynolds, Will Sanderson, Ron Perlman, Claire Forlani, Brian J. White, Kristanna Loken, Gabrielle Rose\nSinopsis: \nNueva pelÃƒÂ­cula basada en un videojuego, esta vez el Dungeon Siege \nLa vida de un hombre muy trabajador, conocido simplemente como Farmer (Jason Statham), cambiarÃƒÂ¡ para siempre cuando una banda intrusa de Krugs (bestias animales esclavas de un malvado hechicero) arrase a su paso la tranquila localidad de Stonebridge, asesinando a su hijo y secuestrando a su mujer, Solana (Claire Forlani). Movido por el dolor, el pacÃƒÂ­fico campesino lidera a su mentor Norick (Ron Perlman) y a su cuÃƒÂ±ado Bastian (Will Sanderson) en busca del ejÃƒÂ©rcito Krug para liberar a Solana. Durante la invasiÃƒÂ³n Krug de la campiÃƒÂ±a, Merick, el mago real, descubre el verdadero origen de su fuerza: su viejo rival Gallian (Ray Liotta), un hechicero formidable y hambriento de poder. Gallian planea utilizar su infernal milicia para derrocar al rey Konreid (Burt Reynolds) y colocar a su tÃƒÂ­tere, el quejica Duke Fallow (Matthew Lillard), en el trono. Mientras los ejÃƒÂ©rcitos del rey cabalgan a su encuentro con los sanguinarios Krug, Farmer y sus compaÃƒÂ±eros pasan desapercibidos por los traicioneros puertos de montaÃƒÂ±a de Ehb con destino a tierras desconocidas. Una arriesgada incursiÃƒÂ³n nocturna a un campamento Krug se vuelve trÃƒÂ¡gica cuando Norick y Bastian son capturados, y Farmer escapa con vida por los pelos. Desesperado por encontrar a su mujer y a sus amigos, Farmer se une al ejÃƒÂ©rcito real en una batalla ÃƒÂ©pica. Sus extraordinarias heroicidades llaman la atenciÃƒÂ³n tanto de Gallian como de Merick, que sospecha que el simple campesino esconde un secreto. En una confrontaciÃƒÂ³n definitiva que determinarÃƒÂ¡ el destino de Ehb, Farmer podrÃƒÂ¡ reclamar sus derechos de nacimiento y derrotar a Gallian, o permitir que el malvado hechicero se haga con el control de la regiÃƒÂ³n. ","torrent":{"xt":"urn:btih:da4b27e12dc3f880cf6e4afe2e28321541702613","amp;dn":"En.El.Nombre.Del.Rey.%282008%29.DVDrip.AC3.5.1.Xvid.Spanish.Lanzamie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da4b27e12dc3f880cf6e4afe2e28321541702613","infoHashBuffer":{"type":"Buffer","data":[218,75,39,225,45,195,248,128,207,110,74,254,46,40,50,21,65,112,38,19]},"announce":[],"urlList":[]}}