{"title":"James Brabazon - My Friend the Mercenary (Audiobook)","uid":6814119,"size":399782703,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:dbbaa15c64f15fb746cee55fe9cc50cda7f32748&amp;dn=James+Brabazon+-+My+Friend+the+Mercenary+%28Audiobook%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":106,"time":1321133108,"description":"&quot;My Friend The Mercenary&quot; is based on James Brabazon's spell-binding account of his own experiences as a war reporter in war torn West Africa and of his evolving friendship with South African mercenary Nick Du Toit. The book is superbly written, mesmerizing as well as highly amusing in retelling the author's experiences from West Africa as well as in revealing the plans to topple the leadership of Equatorial Guinea. The book (which literally reads like a thriller) puts the reader onto a pure a roller coaster into the murky waters of &quot;guns for hire&quot; but also into issues of morality and objectivity that pertains to reporting from a war zone. For readers interested in learning more about the tragic-comical plans to topple the government of President Obiang, this book offers a wealth of inside information retold with lots of charm and wit all however based on thorough research. &quot;My Friend The Mercenary&quot; is thus in a totally different league than the book &quot;The Wonga Coup&quot; by Adam Roberts (which also retells the faild coup attempt), and is much more well-researched and written than the hasty workings of Roberts.","torrent":{"xt":"urn:btih:dbbaa15c64f15fb746cee55fe9cc50cda7f32748","amp;dn":"James+Brabazon+-+My+Friend+the+Mercenary+%28Audiobook%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dbbaa15c64f15fb746cee55fe9cc50cda7f32748","infoHashBuffer":{"type":"Buffer","data":[219,186,161,92,100,241,95,183,70,206,229,95,233,204,80,205,167,243,39,72]},"announce":[],"urlList":[]}}