{"title":"The Welfare of Dogs","uid":4795557,"size":2336193,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dc96d1c5545c123ec5f00f7f6d4a365947451b15&amp;dn=The+Welfare+of+Dogs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"iornix","files":-1,"time":1237865056,"description":"This book is one of a series of textbooks on the Welfare of Animals. The dog is the most widely distributed of all the domesticated animals and is used for a wider range of activities than any other species. Dogs live in close proximity to humans as pets but also as free-ranging street and village dogs. The majority of dogs live short lives as street or village dogs and their lifestyle and welfare is often poor. Many dogs work with humans and are also used for sport and entertainment. This book discusses the management of all types of dogs and how this affects their welfare.\n\nIn wealthy societies the health and nutrition of valuable working and sport dogs is generally good. However, their function may predispose them to injury as for example racing greyhounds. Pet dogs are often deeply loved, well fed and healthy but many exhibit behaviours which are considered to be caused by anxiety. In addition many may spend a large proportion of their lives alone. This is inappropriate for a social animal. The welfare of laboratory dogs which is of concern to many people is discussed as is the welfare of animals held in shelters waiting for re-homing or euthanasia.\n\nThis book is of interest to everyone interested in dogs and their welfare. These include dog owners, veterinarians, animal shelter staff, students and academics.\n\nThe Welfare of Dogs\nBy Kevin Stafford\nPublished by Springer, 2007\nISBN 1402061447, 9781402061448\n280 pages","torrent":{"xt":"urn:btih:dc96d1c5545c123ec5f00f7f6d4a365947451b15","amp;dn":"The+Welfare+of+Dogs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc96d1c5545c123ec5f00f7f6d4a365947451b15","infoHashBuffer":{"type":"Buffer","data":[220,150,209,197,84,92,18,62,197,240,15,127,109,74,54,89,71,69,27,21]},"announce":[],"urlList":[]}}