{"title":"Gotham City Sirens 01-26 (2009-2011|Digital|SoU-Empire)","uid":10056611,"size":1432395347,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:df2618d10bb08325a6ec04e54aef0f638cb17e12&amp;dn=Gotham+City+Sirens+01-26+%282009-2011%7CDigital%7CSoU-Empire%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1398674512,"description":"Gotham City Sirens was a short-lived series that featured three deadly divas of Gotham - Harley Quinn, Poison Ivy, and Catwoman - living and working together and doing their anti-hero (or villain) thing. The series was written by longtime Batman scribe and Batman: The Animated Series co-creator Paul Dini, and was a fun and lighthearted take on the these lovey ladies and the shenanigans they got into. For the most part, that is - sometimes it could get serious, but comedy was a driving factor of many of the stories and Harley especially was used as good comic relief whenever possible. Still, Dini fleshed out the sometimes odd and tumultuous relationship between the trio and the strange bond that they formed as a result. If you are at all interesting in these characters or exploring the larger world of Batman's rogues, this is worth a read.\n\nThese are all 26 issues in digital copies by Son of Ultron-Empire. This series was previously done by TheHand-Empire in digital; however this version fixes some errors and is in a higher resolution. Thanks the the scanners for their hard work; please seed, and enjoy! :-) ","torrent":{"xt":"urn:btih:df2618d10bb08325a6ec04e54aef0f638cb17e12","amp;dn":"Gotham+City+Sirens+01-26+%282009-2011%7CDigital%7CSoU-Empire%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df2618d10bb08325a6ec04e54aef0f638cb17e12","infoHashBuffer":{"type":"Buffer","data":[223,38,24,209,11,176,131,37,166,236,4,229,74,239,15,99,140,177,126,18]},"announce":[],"urlList":[]}}