{"title":"Doctors Pusscriptions XXX DVDRip x264-KuKaS","uid":12351141,"size":2141475828,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:df2c00b660d9d33726d1fc759fc2c505e25bbb8c&amp;dn=Doctors+Pusscriptions+XXX+DVDRip+x264-KuKaS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TKTh3K1ng","files":2,"time":1441427104,"description":"Screenshots:\n &lt;a href=&quot;\nhttp://imgsking.com/image/CCg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgsking.com/image/CCg&lt;/a&gt;\n\n\nDr. Booty's Pusscriptions\n\nAll his life, Brick has only ever wanted two things: to be a firefighter, and to fuck wet pussy. When he sees Dr. Jada Stevens walk in, all he can think of is that fine ass body of hers! Luckily for him, the second she gets a glimpse of his fat cock, she drops to her knees to get a taste!\n\nFucking Doctors\n\nThe Surgeon General assigns Preston Parker and Kagney Linn Karter to do a little experiment for him. Kagney starts by stripping down and teasing Preston. Preston licks her pussy and tight little asshole, then he finishes the entire experiment off with a huge facial!\n\nLights, Camera, Deepthroat!\n\nAlektra Blue and Johnny Sins are just trying to record the latest scene for their hit soap opera. She comes out wearing a sexy nurse's uniform that shows off her big tits. She gets down on her knees to deepthroat that big dick all the way down to the balls, and then Johnny fucks her in every position!\n\nSki Hill Slut Emergency\n\nAlison Tyler and Johnny Sins are the medical staff at the latest Winter Games, when they hear that ski jump superstar Phoenix Marie has crashed on the course! Once they make sure she's ok, the two dirty doctors decide to see if Phoenix is interested in joining their fuck session.\n\nDoctor's Orders\n\nBrick Danger has been in the hospital with aches and pains for weeks now. Figuring he's faking it, the nurses call Dr. Brandi Love in to deal with him, but Brick just sticks to his story. To prove that he's fine, Dr. Love has her nurses strip him down so she can see if his cock responds to stimulus","torrent":{"xt":"urn:btih:df2c00b660d9d33726d1fc759fc2c505e25bbb8c","amp;dn":"Doctors+Pusscriptions+XXX+DVDRip+x264-KuKaS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df2c00b660d9d33726d1fc759fc2c505e25bbb8c","infoHashBuffer":{"type":"Buffer","data":[223,44,0,182,96,217,211,55,38,209,252,117,159,194,197,5,226,91,187,140]},"announce":[],"urlList":[]}}