{"title":"Michelle Branch - Hotel Paper","uid":6628773,"size":398188859,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:df8e1e61f3895e4c1716f4a7bdb979ddc6da93ed&amp;dn=Michelle+Branch+-+Hotel+Paper&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"cdda-flac","files":-1,"time":1314266013,"description":"\n &lt;a href=&quot;\nhttp://g-ecx.images-amazon.com/images/G/01/ciu/b2/15/6963828fd7a0495977f57110&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://g-ecx.images-amazon.com/images/G/01/ciu/b2/15/6963828fd7a0495977f57110&lt;/a&gt;\n\n\nTitle: Hotel Paper\nArtist: Michelle Branch\nAudio CD (June 24, 2003)\nOriginal Release Date: 2003\nNumber of Discs: 1\nGenre: Rock\nFormat: Free Lossless Audio Codec\n\n\nTrack Listing:\n\n01. Intro   \n02. Are You Happy Now?\n03. Find My Way Back   \n04. Empty Handed\n05. Tuesday Morning\n06. One Of These Days\n07. Love Me Like That\n08. Desperatly\n09. Breathe\n10. Where are You Now?\n11. Hotel Paper\n12. Til I Get Over You\n13. It's You\n\n\nAllmusic Review:\nPart of the appeal of Michelle Branch on her 2001 debut, The Spirit Room, was that she came across as a spirited normal girl with an enthusiasm for music. She wasn't teasingly sexy like Britney Spears, nor was she a brat like the then-unknown Avril Lavigne; she felt like a real teenager, something that was enhanced by her direct songs and earnest vocals, which were the furthest thing from flashy. Sure, The Spirit Room could be a little too polished at times, but it was tempered by her eagerness to make a record, so it turned out quite endearing. But like many second albums, her sophomore affair, Hotel Paper, finds Branch two years older and a whole lot more &quot;mature,&quot; in the sense that any remnants of that adolescent passion have been removed as she positions herself as a serious singer/songwriter in the adult alternative vein. Branch remains appealing her blend of pop and mild roots rock sounds good and she has a nice, plainspoken charm and straight-ahead voice but she's buried beneath the slick veneer of Hotel Paper's production (largely by John Shanks) and does not help herself with her compositions, which are vaguely ingratiating, but rarely rise above the generic level. All of it is too self-consciously serious, too preoccupied with turning Branch into a younger but more somber Sheryl Crow (who duets with Branch on the record's best track, &quot;Love Me Like That&quot;). Taken on the surface, Hotel Paper is fine it's big and shiny and it glides as easy as tunes on an adult alternative radio station on a summer's day but without that infectious spirit she displayed on The Spirit Room or songs as catchy as &quot;Everywhere,&quot; the album doesn't have the detail of character that made Michelle Branch so appealing the first time out. In its place is a professional, polished album that's nice to listen to, but doesn't resonate for much longer than its playing time.","torrent":{"xt":"urn:btih:df8e1e61f3895e4c1716f4a7bdb979ddc6da93ed","amp;dn":"Michelle+Branch+-+Hotel+Paper","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df8e1e61f3895e4c1716f4a7bdb979ddc6da93ed","infoHashBuffer":{"type":"Buffer","data":[223,142,30,97,243,137,94,76,23,22,244,167,189,185,121,221,198,218,147,237]},"announce":[],"urlList":[]}}