{"title":"Prisma - Collusion (2006) MP3 @ 320","uid":5822375,"size":127319914,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:dfa8a89a4d0ef3b47352125ff1e45c91a32a6d08&amp;dn=Prisma+-+Collusion+%282006%29+MP3+%40+320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"FLACtheRipper","files":-1,"time":1284107466,"description":"Dear Boss,\n\n\n*************\n\n\nThis is only my second torrent.  I hope I am getting better at this!\n\nNo bullshit!  Just the music and album cover.\n\n\n*************\n\n\nIf you like this music please support the artist and purchase it!  This is for sampling purposes only!!!\n\n\n*************\n\n\nFor fans of Tool and bass/drum driven progressive rock/metal.\n\n\n*************\n\n\nReview from Sea of Tranquility &quot;The Web Destination for Progressive Music!&quot;\n\nReference URL: &lt;a href=&quot; http://www.seaoftranquility.org/reviews.php?op=showcontent&amp;id=4973&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.seaoftranquility.org/reviews.php?op=showcontent&amp;id=4973&lt;/a&gt;\n\n    Prisma is a great young band from Switzerland, consisting of Michael Luginbuehl on vocals and percussion;\nValentin Grendelmeier on guitars, koto and monochord; Marc Muellhaupt on bass; and Andreas Wettstein on\ndrums and percussion. I felt the need to check them out because of numerous Tool references I heard about\nand was pleasantly surprised the comparisons were spot on. Prisma's sound draws heavily from that of Tool;\nthey have a similar syncopatated rhythmic awareness, lots of interesting vocal lines, atmospheric guitar effects,\namazing tribal-like drum fills, and pounding bass through and through.\n\n    For a self-released debut, Collusion is a great start for Prisma. Though some will inevitably lambast them for\nsounding too similar to Tool -- and they may have a point -- I doubt the band would deny being inspired by Tool\nor Keenan's other project A Perfect Circle. On the contrary, they might be proud that so many people actually liken\nthem to one of the greatest bands around. From the heavy album opener &quot;Paragon&quot; to the rhythmically dense\n&quot;Feeling of Guiltiness&quot;, complete with nifty acoustic guitars and shattering electric riffs; to the unexpectedly melodic\n&quot;Sield Land&quot;, this album serves its purpose. Luginbuehl's heavily processed and clean vocal pattern draped over a\nweird-sounding bass motif culminates in a perfectly timed guitar solo that drives &quot;Over Bodies and Cases&quot; to its\nclimactic finale. When he opts for the more fragile, lower register vocals, he recalls Devon Graves of Dead Soul Tribe,\nparticularly on songs like &quot;Glide in&quot; and the beautifully arranged &quot;Passion - The Highest Necessity&quot;, which boasts a\nnice folky melody alongside a raucous guitar theme with a huge dynamic range. Although Grendelmeier's guitar work\nhas a more rocky sound to it, his playing fits the songs nicely, perfectly complementing the riveting drumming and\nawesome bass playing. There are enough solos for both of the rhythm guys on the album: the drum solo on &quot;Feeling\nof Guiltiness&quot; and the bass intro of &quot;Inner Circulation&quot; are sublime and they deserve special kudos for their talent.\n\n    &quot;Head Trip&quot; may be a personal favourite because of its brooding psychedelic feel and thick guitar harmony. The\nsong bleeds atmosphere from start to finish and hints at the potential of these guys. They are also technically adept:\nthe main riff of &quot;Genius&quot; is considerably more intricate than the remainder of the album and Wettstein's drummng is\nvery complex as well. The band also uses some sitar-like Eastern instruments on &quot;Normal State&quot;, which heavily\nrecalls Lateralus and nice string elements on the final track &quot;Perseverance&quot; for added depth.\n\n    Aside from the Tool comparisons, Prisma is worth checking out if you enjoy bands like the Mars Volta, Porcupine\nTree, Dredg, Mr Bungle, and Primus. Check them out and support independent artists.\n\n    Track Listing\n\n       1. Paragon\n       2. Feeling of Guiltiness\n       3. Over Bodies and Cases\n       4. Head Trip\n       5. Maslow\n       6. Glide in\n       7. Inner Circulation\n       8. Normal State\n       9. Passion - The Highest Necessity\n      10. Sield Land\n      11. Genius\n      12. Perseverance \n\nAdded: April 10th 2007\nReviewer: Murat Batmaz\nScore: 4 stars\n\n\n*************\n\n\nI also highly recommend the bands Rishloo and Blatherskite if you like Prisma.\n\nEnjoy &amp; please seed!\n\n\n*************\n\nYours truly\n\nFLAC the Ripper\n\nDon't mind me giving the trade name\n\n*************&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;5d3b313c3e2935382f342d2d382f1d3a3025733e3230&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script data-cfhash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;data-cfhash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}t.parentNode.removeChild(t);}}catch(u){}}()/* ]]&gt; */&lt;/script&gt;*************","torrent":{"xt":"urn:btih:dfa8a89a4d0ef3b47352125ff1e45c91a32a6d08","amp;dn":"Prisma+-+Collusion+%282006%29+MP3+%40+320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dfa8a89a4d0ef3b47352125ff1e45c91a32a6d08","infoHashBuffer":{"type":"Buffer","data":[223,168,168,154,77,14,243,180,115,82,18,95,241,228,92,145,163,42,109,8]},"announce":[],"urlList":[]}}