{"title":"Angelique (Boxset DVD 5-2006)DVD9 (dutch subs) NLT-Release","uid":6021281,"size":5809571956,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:e0195af3e1a851a4221887b757bd77353d2ee593&amp;dn=Angelique+%28Boxset+DVD+5-2006%29DVD9+%28dutch+subs%29+NLT-Release&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Nlt-Release-XX-Men","files":-1,"time":1291801096,"description":"Angelique (Boxset DVD 5-2006)DVD9 (dutch subs) NLT-Release\n\n[img]http://img405.imageshack.us/img405/5084/angeliques.jpg[/img]\n\nBeleef de aangrijpende avonturen van de beeldschone AngÃƒÂ©lique (MichÃƒÂ¨le Mercier) die wordt getroffen door het noodlot. Het verhaal gaat over ontmoetingen met de rijke graaf van Toulouse Joffrey de Peyrac (Robert Hossein), haar toekomstige man en enige ware liefde. AngÃƒÂ©lique en Joffrey worden geconfronteerd met de macht van invloedrijke personen tijdens het bewind van Louis XIV, de Zonnekoning. Liefde, actie en avontuur maken van AngÃƒÂ©lique een waar kostuumdrama vol actie. Een tijdloos succes waar mensen van alle leeftijden van zullen genieten!\n\nDVD 5: And The Sultan \nOpnieuw slaat het noodlot toe en AngÃƒÂ©lique wordt ontvoerd door een piraat die haar het bed in probeert te praten. AngÃƒÂ©lique wijst hem echter af waarna de piraat haar als slaaf probeert te verkopen. Ze wordt gekocht door de sultan die haar toevoegt aan zijn harem waar ze al snel uitgroeit tot zijn 'favoriet' waardoor ze zich de woede van een rivale op de hals haalt. Ondertussen is Joffrey de Peyrac onvermoeibaar op zoek naar zijn geliefde. Zullen ze elkaar ooit nog vinden?\n\n**************************************************\n\nExperience the dramatic adventures of the beautiful Angelique (Michele Mercier) who is struck by fate. The story is about encounters with the wealthy Count of Toulouse, the Joffrey Peyrac (Robert Hossein), her future husband and one true love. Angelique and Joffrey are faced with the power of influential people during the reign of Louis XIV, the Sun. Love, action and adventure of Angel where a costume drama full of action. A timeless success where people of all ages will enjoy!\n\nDVD 5: And The Sultan\nAgain, disaster strikes and Angela is kidnapped by a pirate who's trying to talk into bed. Angela shows him, however, then the pirate's trying to sell into slavery. She bought by the sultan who adds her to his harem, where she quickly grows into his &quot;favorite&quot; so they are the wrath of a rival in the foot. Meanwhile, the Joffrey Peyrac tirelessly in search of his beloved. Will they ever find it?\n\nBron: Retail Dvd, 5 disks\nSpeelduur 485:00 min\nBeeldformaat: 2.35 :1\nKleur: Color\nTaal: Frans, Engels\nAudio: DD 2.0 / DD 1.0\nOndertitels: Nederlands\n\nSpotinformatie \nCategorie : Beeld \nFormaat : DVD9 \nBron : Retail\n \nOndertitels : Nederlands (instelbaar)\n \nGenre : Avontuur Drama Romantiek\n \nWeblink : http://www.bol.com/nl/p/dvd/angelique-the-complete-collection/1002004004499903/index.html \n\nEnjoy the movie\n\nXX-Men","torrent":{"xt":"urn:btih:e0195af3e1a851a4221887b757bd77353d2ee593","amp;dn":"Angelique+%28Boxset+DVD+5-2006%29DVD9+%28dutch+subs%29+NLT-Release","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0195af3e1a851a4221887b757bd77353d2ee593","infoHashBuffer":{"type":"Buffer","data":[224,25,90,243,225,168,81,164,34,24,135,183,87,189,119,53,61,46,229,147]},"announce":[],"urlList":[]}}