{"title":"A.Bizzaro","uid":4180646,"size":59009565,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:e18ce897902b512ae476219c46a50693e82750d9&amp;dn=A.Bizzaro&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"gilgamesh07","files":6,"time":1210380475,"description":"This Torrent am no requested in forums.\n\nThis Torrent am not contains DC Comics A.Bizarro 4 issue mini-series from 1999. \n\nA. Bizarro is the title of a four-issue comic book limited series published by DC Comics in 1999, and the name of the lead character of that series. The creators included writer Steve Gerber, penciller M.D. Bright, inker Greg Adams, colorist Tom Ziuko with separations by Digital Chameleon, letterer Steve Dutro, and editor Joey Cavalieri. It features characters from the Superman family of titles.\n\nThe main character, Al Bizarro, is a clone of a former LexCorp employee named Al Beezer. Created as a test for Dr. Happersen&amp;#039;s cloning equipment which eventually created a Post-Crisis Bizarro, he was placed in suspended animation and forgotten.\n\nWhen he is freed, he begins a search for his own identity, and his purpose in life, which eventually takes him to Apokolips (where he befriends a Female Fury named Seera), and later to South America.\n\nIn a parody of the original Bizarro code, Al Beezer tells Al Bizarro that, if he wants to be happy, he should do &quot;the exact opposite&quot; of everything the original Al did.\n\nNot thanks to the scanners and the original source.\n\nPlease no seed. Please hate.","torrent":{"xt":"urn:btih:e18ce897902b512ae476219c46a50693e82750d9","amp;dn":"A.Bizzaro","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e18ce897902b512ae476219c46a50693e82750d9","infoHashBuffer":{"type":"Buffer","data":[225,140,232,151,144,43,81,42,228,118,33,156,70,165,6,147,232,39,80,217]},"announce":[],"urlList":[]}}