{"title":"The Silent Age 2.0.5.9 full apk obb","uid":12871843,"size":122201561,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:e27de25f80bc68471ef0b298d88094553f8118d4&amp;dn=The+Silent+Age+2.0.5.9+full+apk+obb&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tiropitaki","files":2,"time":1448891413,"description":"\nThe Silent Age takes you on an adventurous journey into a dystopian future where mankind has gone extinct!\r\n\r\nTravel through time between the iconic 70's and a desolate present day haunted by silence.\r\n\r\nThe Silent Age is an atmospheric point-and-click adventure game with stylized visuals and an eerie soundtrack that will keep you in suspense as you solve mind-bending puzzles.\r\n\r\nWith an interface specifically designed for touch devices, you'll flow through the story without hiccups and frustrations. Sit back, plug in your headphones, and enjoy the adventure.\r\n\r\nBackground Story \r\nIt’s 1972. Love is free. Flipflops, English leather and bandanas are the height of fashion. Meanwhile the Cold War is more than lukewarm and a real one is going on overseas. Movements are happening. Environmentalists, the female liberties movement, and on the dance floors an entirely different kind of movement is overtaking the underground clubs. The winds of change are certainly blowing over the country.\r\n\r\nSomewhere in the big city, in a tall, faceless government building someone left a window open. All the winds of change are doing here is blowing leaves all over Joe’s newly-swept floor. He’s been there for two years now. Working a dead-end attendant job making sure the building is as spotless as the suits walking the halls. It’s been like this for years, going from one soul-devouring job to the next.\r\n\r\nOur protagonist is Joe in more than just name. He is quite literally Joe Average. Average height, average weight, average IQ. In fact, the only thing remotely remarkable about him is exactly how much he conforms to the median of the hypothetical everyman, and up until this point, Joe’s life hasn't exactly been biography material.\r\n\r\nThis is all about to change...\r\n\r\n\r\nWhat's new in this version:\r\n- Fixed &quot;Restore purchases&quot;\r\n- Fixed chapters not showing in E2\r\n- Now supports Android x86 devices\r\n- Typos\r\n\r\nBoth episodes One and Two are included\r\nInstall APK,Place data folder in SDCard/Android/Obb/ and play.\r\nRequires Android 4.0+\r\n\r\n\r\n\r\n\r\nMetacritic score: 84\r\n\r\n\r\nReviews\r\n\r\n*** &quot;You may detect a strong Twelve Monkeys influence at work in the game's storyline.&quot; -- Eurogamer\r\n\r\n*** &quot;The Silent Age is an absolutely fantastic adventure that fans of the genre should not miss&quot; -- 148Apps\r\n\r\n*** &quot;Beautiful and immersive graphics and soundtrack create an uncannily calm ambiance. Logical puzzles make sense in the context of the world&quot; -- Gamezebo\r\n\r\n*** &quot;Smart, mysterious and layered beneath a very welcome dose of otherworldly eeriness, The Silent Age will delight any adventure gamer who feels that the genre's revival, welcome though it is, is just a little too light-hearted in the 21st century&quot; -- Modojo\r\n\r\n*** &quot;The Silent Age delivers a charming experience, packed with stylish graphics and sound, simple touch controls and an intriguing story&quot; -- Multiplayer.it\r\n\r\n*** &quot;I especially recommend The Silent Age to fans of science fiction, time travel, quirky writing, inner monologues and epic mustaches&quot; -- Indie Love","torrent":{"xt":"urn:btih:e27de25f80bc68471ef0b298d88094553f8118d4","amp;dn":"The+Silent+Age+2.0.5.9+full+apk+obb","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e27de25f80bc68471ef0b298d88094553f8118d4","infoHashBuffer":{"type":"Buffer","data":[226,125,226,95,128,188,104,71,30,240,178,152,216,128,148,85,63,129,24,212]},"announce":[],"urlList":[]}}