{"title":"Radical Affairs Video Magazine 1 (1992) [DVDRip]","uid":8365225,"size":894017448,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:e29390acc3d8689acf48ea24bb12d7eba8354aca&amp;dn=Radical+Affairs+Video+Magazine+1+%281992%29+%5BDVDRip%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"chkm8te","files":3,"time":1365745202,"description":"Radical Affairs Video Magazine 1 (1992) [DVDRip]\n\nThis is as real as it gets!! No bad acting, no goofy story lines, just the reality of living life on the edge and telling the world about it. Each edition of Radical Affairs will bring you this, plus interviews and commentary about issues that affect al of us. Looking for something different? Open your eyes...\nNot Yet Rated\nGet ready, folks, because this is among the first entries in a new X-rated genre; the hardcore skin magazine on videotape. If you're looking for wall-to-wall sex, this isn't your league, but if you've been intrigued by past performances of Moonlight's resident scholar and henchman, J.B. and you want to see some truly hot sex that doesn't look staged, plus a bit of news from the sex community, this is your tape.\nJ.B. serves as the host and agent provocateur, as he talks Chanel and Jake Williams into screwing on the sales desk of The X-Man, who calls customers and lets them listen to Chanel's moans. Watch Jake cum all over a Savannah poster - which Chanel licks off! Then J.B. leads Nikki Dial and Kelly O'Dell to the &quot;Jungle Room&quot; for a long, passionate girl/girler. Finally, the beautiful P.J. Sparxx - and we can tell because we get to see her in the makeup process - gets plunged by Peter North in the back seat of a classic '56 DeSoto, while J.B. supplies some running commentary. Each sex scene is more than 20 minutes long, and worth every second of it!\nWhat makes tihs tape different is that between these hot scenes, there are news items, like a report on L.A.'s Gay Pride parade, where J.B. has a confrontation with an anti-porn &quot;slave of God.&quot; (Too bad there's no footage of the Adult Video Association's anti-censorship float.) This is an excellent opener in a series whose producers seem to know how to balance hot sex with non-sex topics of interest. The boxcover, featuring a lingerie-clad P.J., should attract customers like bees to pollen.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=90t77bnicg5u7xajpi7t.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=90t77bnicg5u7xajpi7t.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=4gxpahf05dwf30o7c8pl.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=4gxpahf05dwf30o7c8pl.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:e29390acc3d8689acf48ea24bb12d7eba8354aca","amp;dn":"Radical+Affairs+Video+Magazine+1+%281992%29+%5BDVDRip%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e29390acc3d8689acf48ea24bb12d7eba8354aca","infoHashBuffer":{"type":"Buffer","data":[226,147,144,172,195,216,104,154,207,72,234,36,187,18,215,235,168,53,74,202]},"announce":[],"urlList":[]}}