{"title":"The Age of Global Warming A History by Rupert Darwall","uid":9410721,"size":7429813,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e2d59d643f52c17fb93d5a0e68c7a06922049780&amp;dn=The+Age+of+Global+Warming+A+History+by+Rupert+Darwall&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"420weedman","files":-1,"time":1388280871,"description":" Rachel Carson's epoch-creating Silent Spring marked the beginnings of the environmental movement in the 1960s, its 'First Wave' peaking at the 1972 Stockholm Conference. The invention of sustainable development by Barbara Ward, along with Rachel Carson the founder of the environmental movement, created an alliance of convenience between First World environmentalism and a Third World set on rapid industrialisation. The First Wave crashed in 1973 with the Yom Kippur War and decade-long energy crisis. Revived by a warming economy of the 1980s, environmentalism found a new, political champion in 1988: Margaret Thatcher. Four years later at the Rio Earth Summit, politics settled the science. One hundred and ninety-two nations agreed that mankind was causing global warming and carbon dioxide emissions should be cut. Rio launched rounds of climate change meetings and summits, with developing nations refusing to countenance any agreement restraining their greenhouse gas emissions - their blanket exemption from the 1997 Kyoto Protocol leading to its rejection by the United States that year, and again twelve years later in Copenhagen. This therefore marked not just the collapse of the climate change negotiations, but something larger - an unprecedented humiliation for the West at the hands of the rising powers of the East.","torrent":{"xt":"urn:btih:e2d59d643f52c17fb93d5a0e68c7a06922049780","amp;dn":"The+Age+of+Global+Warming+A+History+by+Rupert+Darwall","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e2d59d643f52c17fb93d5a0e68c7a06922049780","infoHashBuffer":{"type":"Buffer","data":[226,213,157,100,63,82,193,127,185,61,90,14,104,199,160,105,34,4,151,128]},"announce":[],"urlList":[]}}