{"title":"Coast to Coast AM March 07 2013","uid":8234401,"size":55723026,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:e2d578dc74328950f13462840f59ec78e08491b7&amp;dn=Coast+to+Coast+AM+March+07+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"runcdfirst","files":5,"time":1362806970,"description":"#we.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t03-07-13\nHost: \tGeorge Noory\nGuests: \tNeil Slade, Paola Harris\n\nIn the first half, brain researcher Neil Slade talked about different aspects of the brain, and their relationship to imagination. In addition to the normal senses, the brain houses such advanced functions as clairvoyance, telepathy, and telekinesis. Slade's focus in the last few years has been to help people develop these senses, as well as their imagination. Creativity is tied to the imagination, as everything emerges from an idea, he remarked. &quot;For me...imagination is the most powerful ability of your brain,&quot; he commented, and &quot;without question one of the most important processes that happens in between your two ears.&quot; Relating paranormal skills to the imagination, he noted that both involve thinking of something that is not in front of you, such as during a successful 1997 experiment he did on C2C that asked listeners to imagine rain hitting a fire-ravaged Florida.\n\nHe detailed the interesting case of Phineas Gage, who got a railroad spike driven through his forehead, separating his frontal lobe from the rest of his brain. The injury caused him to lose his imagination; he could not visualize something that was not right in front of him. Yet, imagination is not limited strictly to the visual, Slade added. &quot;You can imagine a smell, you can imagine hearing a piece of music, you can imagine a solution to a problem,&quot; he continued. He also talked about his research into &quot;tickling the amygdala,&quot; or stimulating the part of the brain associated with creativity and paranormal ability. He offers mental exercises for this in his latest book Brain Magic 2.\n\n---------------------------\n\nIn the latter half, UFO journalist Paola Harris shared ufology updates, as well as new details about her investigations into anomalous cases in Italy. On the island of Sardinia, she spoke with Luigi Muscas who told her that his family had dug up many bones and human artifacts that he believes came from a race of 15-ft-tall giants who lived on the island thousands of years ago (view related images). She also received photos from Luciano Medici, which he took in January, 2009 on his property. Medici claims that the images depict a group of luminous alien beings floating above the ground.\n\nHarris recounted the strange fires that occurred in the small Italian village of Caronia in 2004. While they were associated with balls of light and electrical appliances, the fires continued even after the electricity was shut off. She also shared recollections of her conversations with such luminaries as J. Allen Hynek, Colonel Corso, Monsignor Balducci, &amp; John Mack, as well as expressed her admiration for disclosure advocate Dr. Steven Greer, who has a new documentary coming out.\n\nNews segment guests: Robert Young Pelton, Jerome Corsi\nWebsite(s):\n\n    neilslade.com\n    paolaharris.com\n\nBook(s):\n\n    Brain Magic 2\n    Tickle Your Amygdala\n    The Frontal Lobes Supercharge\n    UFOs: How Does One Speak To A Ball Of Light?\n    Exopolitics: All The Above\n    Exopolitics: Stargate to a New Reality\n\n","torrent":{"xt":"urn:btih:e2d578dc74328950f13462840f59ec78e08491b7","amp;dn":"Coast+to+Coast+AM+March+07+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e2d578dc74328950f13462840f59ec78e08491b7","infoHashBuffer":{"type":"Buffer","data":[226,213,120,220,116,50,137,80,241,52,98,132,15,89,236,120,224,132,145,183]},"announce":[],"urlList":[]}}