{"title":"Ben Dover - Royal Ass Force (1996)","uid":13753508,"size":1939195206,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:e2ea5d69e121a046ec4f1dae386ce38d33c528c6&amp;dn=Ben+Dover+-+Royal+Ass+Force+%281996%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Rantlercat","files":1,"time":1457179988,"description":"In mp4 format optimised for iTunes and AppleTV, with metadata.\r\n\r\n------\r\n\r\nIn this latest lewd installment, Ben comes together again with Mary, the eighteen-year-old Irish lass who, on this randy reunion, introduces big Ben Dover and his two buddies to mouth-watering Mandy, another eighteen-year-old temptress. Together the gorgeous girlies provide plenty of filthy fun for the lads’ entertainment, including ass-pumping galore and a dynamic double penetration! \r\n\r\nNext on Ben’s perving agenda is beautiful Brit Nici Sterling, possible Ben’s greatest discovery to date. She meets once again with big Ben and generously permits him to film her getting screwed and concludes an outrageous afternoon by sucking him off.\r\n\r\n Next is Sue, a leggy blonde who’s just won a pin-up competition. And to celebrate her good fortune, sexy Sue gives Ben’s big dick a right good sucking and takes up every last drop of his cum!\r\n\r\n And last but not least is dirty Danni, another of Ben’s carnal conquests. The twenty-year-old blue-eyed blonde adores group sex, and isn’t scared of experimenting practically everything. Of course, Ben and his three buddies give her it all, and capture every spunktastic moment for you!","torrent":{"xt":"urn:btih:e2ea5d69e121a046ec4f1dae386ce38d33c528c6","amp;dn":"Ben+Dover+-+Royal+Ass+Force+%281996%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e2ea5d69e121a046ec4f1dae386ce38d33c528c6","infoHashBuffer":{"type":"Buffer","data":[226,234,93,105,225,33,160,70,236,79,29,174,56,108,227,141,51,197,40,198]},"announce":[],"urlList":[]}}