{"title":"FS2004 - AFS Design - A250","uid":4179880,"size":5850410,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e3198095e151a3b5fa440d892efdf68de8902ce5&amp;dn=FS2004+-+AFS+Design+-+A250&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"madasahatter","files":1,"time":1210346258,"description":"AFS-design brings a excellent rendition of Airbus A350.\n\nThe A350 XWB (Xtra Wide-Body) is Airbus? response to market demand for a medium capacity long range wide-body family. Designed with airlines? priorities in mind, the A350 XWB confronts the challenges of high fuel prices, rising passenger expectations and increasing environmental concerns. \n\nAvailable from 2013, it has an entirely new, uncompromised, 21st Century design with a wider and taller fuselage for extra space and passenger comfort. A complete family of airliners sized to generate cost reductions and provide unprecedented operating flexibility for airlines; three basic passenger versions are being offered. With a range of up to 8,300nm/15,380km they include the A350-800 for 270 passengers in a spacious three-class configuration; the A350-900 for 314 passengers and the A350-1000 seating 350 passengers. An ultra long-range version, the A350?900R, will fly even further while a freighter version, the A350?900F, will complement the passenger models. \n\nAs befits the most advanced aircraft family in its segment, the A350 XWB is able to provide greater economy on long-range markets and is equally attractive as a route opener or as part of a multi-type Airbus fleet offering optimized network solutions. Thanks to the application of the latest innovations, the A350 XWB is able to offer 20 per cent lower cash operating costs per seat than competing aircraft in this size category and fuel efficiency improvements of up to 25 per cent per seat. \n\nThe fly-by-wire A350 XWB Family is a significant addition to the Airbus product range. A member of the Airbus FBW Family of aircraft, it benefits from the same operational commonality as the other members of the Family. This handling and flight deck commonality allows airlines to benefit from the unique Airbus Family concept of cross crew qualification and mixed fleet flying, and will ensure smooth introduction into service. \n\nThe AFS-design Airbus A350 product features the following:\n\nNew external model of EADS support \ncomplete animated Airbus A350 cockpit and virtual cockpit \nrealistic develop flightdynamic \ncomplete animated lighting effect in panel, virtual cockpit and external model \nlight for cockpit, strobe, navigation and landing- and taxilight \nautomatic trimming or manual trimming \ncomplete animated and full efficient autopilot with autoland \naccurate working avionik for radio navigation \nanimation like: hatch , canopy, move in gear with spring system \nall landing-, control- and spoileranimation \nengineanimation with thrust-reverser \nnew textures (1024*1024) with specular shine, night lighting and more... \nnew record sound of original Rolls Royce TREND 1000 engine in Dahlewitz (Germany) \nThe AFS-design Airbus A350 product liveries the following:\n\nAEROFLOT \nIndustrie house, \nLufthansa, \nQantas, \nEmirates \nAirlines, \nGrundlack, \nEmirates, \nAir France, \nVirgin Atlantic, \nKorean Air, \nMalaysia, \nQuatar Air, \nThai - Thailand, \nSingapore Airlines, \nQANTAS \nThe AFS-design Airbus A350 product gauges in panel and virtuall cockpit the following:\n\nnew AIRBUS multifunctionsgauge \nnew AUTOPILOT und radiosgauge \nenter of QNH und transpondercode (squawk) \noverhead panel in virtual cockpit (full in function) \nmiscellaneous swtich for engines- and funktionscontrols \nGPS in virtual cockpit built in FAB \nnew FMC (Flight Managment Computer) built in the center console \nThe AFS-design Airbus A350 product FMC (Flight Managment Computer) features the following:\n\nnew FMC for the AIRBUS - family \n15 differents menus \ngauge of miscellaneous flightparameter \nenter of flightplans \ncalculation of courses analogical wind, highlevel and aerodrome of destination \nfollow of waypoints \ncoursegauge and autopilotcontrol \n\n\nI think it works in FSX too...","torrent":{"xt":"urn:btih:e3198095e151a3b5fa440d892efdf68de8902ce5","amp;dn":"FS2004+-+AFS+Design+-+A250","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3198095e151a3b5fa440d892efdf68de8902ce5","infoHashBuffer":{"type":"Buffer","data":[227,25,128,149,225,81,163,181,250,68,13,137,46,253,246,141,232,144,44,229]},"announce":[],"urlList":[]}}