{"title":"Quantum Mechanics for Pedestrians v1+2 pdf &gt;QG","uid":9819044,"size":9880887,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e385547962ef8e8e1fc3810c83ff6f3d6a3b4d01&amp;dn=Quantum+Mechanics+for+Pedestrians+v1%2B2+pdf+%26gt%3BQG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"QGeek","files":-1,"time":1395667974,"description":"Quantum Mechanics for Pedestrians 1 - Fundamentals\nand\nQuantum Mechanics for Pedestrians 2 - Applications and Extensions\n\nAuthor: Pade, Jochen\nPublisher: Springer / Language: English / Format: PDF (full bookmarks and page links in index)\nRelease Date: 2013-12-27\nSeries: Undergraduate Lecture Notes in Physics\nFrom the original German edition Quantenmechanik zu FuÃŸ 1 and Quantenmechanik zu FuÃŸ 2, published by Springer-Verlag, 2012\n\nVolume 1, Fundamentals:\n-Provides fresh access to quantum mechanics through the combination of standard topics with new understanding\n-Gives a reasonably easy and modern introduction into quantum mechanics\n-Contains many additional explanations which are not contained in other textbooks\n-Addresses recent developments and applications of quantum mechanics\n-Discusses further leading topics and additional basic knowledge in the appendix\n-Displays in parallel the analytic and algebraic formulation of quantum mechanics\n-Supports learning with exercises and problems with solutions\n2014, XXIII, 452 p. 51 illus., 28 illus. in color.\nISBN 978-3-319-00798-4 &lt;a href=&quot;\nhttp://www.springer.com/physics/quantum+physics/book/978-3-319-00797-7&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.springer.com/physics/quantum+physics/book/978-3-319-00797-7&lt;/a&gt;\n\nVolume 2, Applications and Extensions:\n-Written by an experienced lecturer with a great insight into and understanding of quantum mechanics, and a gift for explaining it\n-Combines the standard topics with new knowledge and developments, such as quantum information and neutrino oscillation\n-Discusses further advanced topics in the appendix, including many exercises with solutions\nThe two-volume textbook Quantum Mechanics for Pedestrians provides an introduction to the basics of nonrelativistic quantum mechanics. Originally written as a course for students of science education, the book addresses all those science students and others who are looking for a reasonably simple, fresh and modern introduction to the field. The basic principles of quantum mechanics are presented in the first volume. This second volume discusses applications and extensions to more complex problems. In addition to topics traditionally dealt with in quantum mechanics texts, such as symmetries or many-body problems, here also issues of current interest such as entanglement, Bell's inequalities, decoherence and various aspects of quantum information are treated in detail. Furthermore, questions of the basis of quantum mechanics and epistemological issues are discussed explicitly; these are relevant e.g. to the realism debate. A chapter on the interpretations of quantum mechanics completes this volume. The necessary mathematical tools are introduced step by step; in the appendix, the most relevant mathematics is compiled in compact form. More advanced topics such as the Lenz vector, Hardy's experiment and Shor's algorithm are treated in more detail in the appendix. As an essential aid to learning and teaching, 130 exercises are included, most of them with their solutions.\n2014, XXI, 482 p. 81 illus., 49 illus. in color.\nISBN 978-3-319-00813-4 &lt;a href=&quot;\nhttp://www.springer.com/physics/quantum+physics/book/978-3-319-00812-7?otherVersion=978-3-319-00813-4&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.springer.com/physics/quantum+physics/book/978-3-319-00812-7?otherVersion=978-3-319-00813-4&lt;/a&gt;\n\nAll credit goes to the original releasers, Team Kyrie Eleison. - QuietGeek\n","torrent":{"xt":"urn:btih:e385547962ef8e8e1fc3810c83ff6f3d6a3b4d01","amp;dn":"Quantum+Mechanics+for+Pedestrians+v1%2B2+pdf+%26gt%3BQG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e385547962ef8e8e1fc3810c83ff6f3d6a3b4d01","infoHashBuffer":{"type":"Buffer","data":[227,133,84,121,98,239,142,142,31,195,129,12,131,255,111,61,106,59,77,1]},"announce":[],"urlList":[]}}