{"title":"Neethi (1972) Tamil - MHCe DVD5 - Eng Subs - Shivaji, Janaki [DD","uid":10103209,"size":4726827699,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:e593ad8020104207aecf3d97b912eb3444033aab&amp;dn=Neethi+%281972%29+Tamil+-+MHCe+DVD5+-+Eng+Subs+-+Shivaji%2C+Janaki+%5BDD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SaM","files":-1,"time":1399423681,"description":"Neethi (1972) Tamil - MHCe DVD5 - Eng Subs - Shivaji, Janaki [DDR]\n\nNeedhi is a 1972 Tamil film produced by Sujatha Cine Arts and directed by C.V.Rajendran. \nIt is a remake of the Hindi film, Dushman 1971 with Rajesh Khanna, Meena Kumari, Mumtaz\nThe film stars Sivaji Ganesan in the lead role. Sowcar Janaki, Jayalalithaa, Chittor V. Nagaiah, and Chandrababu are part of the cast.\n\nCAST:- Sivaji Ganesan, Sowcar Janaki, Jayalalitha, Chittor V. Nagaiah\nDirected by:  C.V.Rajendran\nMusic Director: M.S.Viswanathan\n\nSongs are included in MP3s\nNeethi (1972) Tamil 00 Title Music and Screen Credits, M.S. Viswanathan\nNeethi (1972) Tamil 01 Dance Music, M.S. Viswanathan\nNeethi (1972) Tamil 02 Mappila Pattu Kahi, T M Soundararajan, Kannadasan, M.S.Viswanathan\nNeethi (1972) Tamil 03  Naalai Muthal Kudikka Matten, T M Soundararajan, Kannadasan, M.S.Viswanathan\nNeethi (1972) Tamil 04  Oduthu Par -1, P Susheela, Kannadasan, M.S.Viswanathan\nNeethi (1972) Tamil 05  Oduthu Par - 2, P Susheela, Kannadasan, M.S.Viswanathan\nNeethi (1972) Tamil 06  Kalyanathel, P Susheela, Kannadasan, M.S.Viswanathan\nNeethi (1972) Tamil 07  Engalathu Bhoomi, J.P. Chandrababu , P Susheela, Kannadasan, M.S.Viswanathan\n\nSYNOPSIS:- Neethi (1972) Tamil\nSivaji Ganesan earns a living driving a truck. He is a rash driver and more than usually also driving while drunk. One night he stops at a prostitute's, spends the night with her, and gets up late the next morning. He rushes out and drives at breakneck speed in thick fog to make up for lost time while again drinking. He inevitably ends up running over and killing a farmer. But despite the opportunity to hit and run, he decides to stay and face the consequences. He is arrested by the police, charged, and brought before the courts.\n\nSivaji Ganesan acknowledges his guilt to the Judge who in-turn knows that he should send him to prison for two years. But moved by the plight of the farmer's family (which include his widow (Sowcar Janaki), his sister ), two young sons; a crippled father (Chittor V. Nagaiah), and his blind mother (Ganthimathi), and his inherent belief that imprisonment does not serve the good of the victim or the perpetrator, the Judge resolves to try a novel experiment of forcing Sivaji Ganesan to live with the farmer's family and looking after their financial needs. A horrified Ganesan attempts in vain to convince the Judge to change his ruling. He is transported to his new &quot;prison&quot; under police protection, where he is met by hostile villagers. The farmer's family detest his presence, and call him enemy. Sivaji Ganesan attempts to escape on the first night, but is apprehended and brought back to serve his time.\n\nHe gradually comes to terms with the twist of fate that has forced him to become a subsistence farmer and live under the ever unforgiving eyes of the farmer's family. Over time he starts sincerely working for the family and its interests. He meets Jayalalithaa, a happy-go-lucky girl who operates a small bi-scope machine to entertain the village kids. They take an instant liking to each other, which blossoms into love. He also finds friends amongst the previously hostile villagers. He works hard on the family plot while also protecting it from the clutches of a local landlord who has ill intentioned designs on the land and also on the farmer's sister.\n\nSurmounting many obstacles, Sivaji Ganesan is able to arrange the marriage of the sister with her childhood sweetheart. With the help of a benevolent police force and the Judge, he is also able to thwart the many attempts of the landlord to seize the family's land, and that of other villagers who have mortgaged their land with the same landlord. The farmer's widow however (Sowcar Janaki), is unable to forgive Sivaji Ganesan for having killed her husband.\n\nThings take a dramatic turn for the worse when Sivaji Ganesan is framed and arrested for the accidental death of Jayalalithaa's drunk grandfather. At the same time, the landlord has the lush harvest produced by Sivaji Ganesan and other villagers covertly set ablaze, and has Jayalalithaa kidnapped, primarily to punish Sivaji Ganesan. Sowcar Janaki, who has been working in one of the landlord's saw mills thinking he is an honourable man, witnesses his misdeeds, and finally realises her mistake. She is able to rescue Jayalalithaa but gets trapped by the landlord instead, who attempts to rape her. Meanwhile Sivaji Ganesan stages an escape from his holding cell and with the help of Jayalalithaa, is able to come to Sowcar Janaki's rescue in the nick of time. He confronts the landlord and violently assaults him as payback. The police show up and arrest the landlord for his role in defrauding the villagers and destroying their harvest.\n\nThe deceased farmer's family finally accept Sivaji Ganesan as one of their own, and arrange his marriage to Jayalalithaa. In a final twist though, his two years' imprisonment is complete, and the Police arrive to escort him back to town. He pleads with the Judge to let him serve a life sentence, and the Judge smiles, vindicated that his experiment has been successful.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate: 4514 kbps\nVideo Resolution: 720x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 29.970\nAudio Codec:  AC3\nAudio Bitrate: 448kb/s CBR 48000 Hz\nAudio Streams: 6\nAudio Languages: Tamil\nRunTime: 2:33:54\nSubtitles: English\nRipped by: Trinidad [DDR]   \nDuration: 2:3:54","torrent":{"xt":"urn:btih:e593ad8020104207aecf3d97b912eb3444033aab","amp;dn":"Neethi+%281972%29+Tamil+-+MHCe+DVD5+-+Eng+Subs+-+Shivaji%2C+Janaki+%5BDD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e593ad8020104207aecf3d97b912eb3444033aab","infoHashBuffer":{"type":"Buffer","data":[229,147,173,128,32,16,66,7,174,207,61,151,185,18,235,52,68,3,58,171]},"announce":[],"urlList":[]}}