{"title":"R. D. Laing- 1965 - The Divided Self - An Existential Study in S","uid":11303079,"size":1249371,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e5a3f058e21f8f62d2c014d2ee7e78d50932609a&amp;dn=R.+D.+Laing-+1965+-+The+Divided+Self+-+An+Existential+Study+in+S&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Inua1","files":1,"time":1414443392,"description":"The Divided Self: An Existential Study in Sanity and Madness - Aug 30, 1965\nby R. D. Laing\n\nDr. Laing's first purpose is to make madness and the process of going mad comprehensible. In this, with case studies of schizophrenic patients, he succeeds brilliantly, but he does more: through a vision of sanity and madness as 'degrees of conjunction and disjunction between two persons where the one is sane by common consent' he offers a rich existential analysis of personal alienation.\n\nFirst published in 1960, this watershed work aimed to make madness comprehensible, and in doing so revolutionized the way we perceive mental illness. Using case studies of patients he had worked with, psychiatrist R. D. Laing argued that psychosis is not a medical condition but an outcome of the 'divided self', or the tension between the two personas within us: one our authentic, private identity, and the other the false, 'sane' self that we present to the world.\n\nThe outsider, estranged from himself and society, cannot experience either himself or others as 'real'. He invents a false self and with it he confronts both the outside world and his own despair. The disintegration of his real self keeps pace with the growing unreality of his false self until, in the extremes of schizophrenic breakdown, the whole personality disintegrates.\n\nISBN-10: 0140135375\nISBN-13: 978-0140135374","torrent":{"xt":"urn:btih:e5a3f058e21f8f62d2c014d2ee7e78d50932609a","amp;dn":"R.+D.+Laing-+1965+-+The+Divided+Self+-+An+Existential+Study+in+S","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5a3f058e21f8f62d2c014d2ee7e78d50932609a","infoHashBuffer":{"type":"Buffer","data":[229,163,240,88,226,31,143,98,210,192,20,210,238,126,120,213,9,50,96,154]},"announce":[],"urlList":[]}}