{"title":"Henri Nouwen - The Wounded Healer: Ministry (pdf)","uid":8541093,"size":1189074,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e5b81c76f3b4a94a88ac7fdb68535c7cf1a67786&amp;dn=Henri+Nouwen+-+The+Wounded+Healer%3A+Ministry+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pharmakate","files":-1,"time":1370384203,"description":"Henri J. M. Nouwen - The Wounded Healer: Ministry in Contemporary Society (Image, 1972, 2010). 109 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\ndescription:\n\nThe Wounded Healer is a hope-filled and profoundly simple book that speaks directly to those men and women who want to be of service in their church or community, but have found the traditional ways often threatening and ineffective. In this book, Henri Nouwen combines creative case studies of ministry with stories from diverse cultures and religious traditions in preparing a new model for ministry. Weaving keen cultural analysis with his psychological and religious insights, Nouwen has come up with a balanced and creative theology of service that begins with the realization of fundamental woundedness in human nature. Emphasizing that which is in humanity common to both minister and believer, this woundedness can serve as a source of strength and healing when counseling others. Nouwen proceeds to develop his approach to ministry with an analysis of sufferings -- a suffering world, a suffering generation, a suffering person, and a suffering minister. It is his contention that ministers are called to recognize the sufferings of their time in their own hearts and make that recognition the starting point of their service. For Nouwen, ministers must be willing to go beyond their professional role and leave themselves open as fellow human beings with the same wounds and suffering -- in the image of Christ. In other words, we heal from our own wounds. Filled with examples from everyday experience, The Wounded Healer is a thoughtful and insightful guide that will be welcomed by anyone engaged in the service of others.\n\nReview\n\n&quot;I wish I could send this book to every seminary, rectory and parsonage in the country.&quot;\n\n-- The Record \n\nThe Wounded Healer is Nouwen at his best .... the ideas it implants linger long after the book is read, and re-read.  -- Best Sellers \n\n&quot;One of the world's greatest spiritual writers.&quot; --Christianity Today","torrent":{"xt":"urn:btih:e5b81c76f3b4a94a88ac7fdb68535c7cf1a67786","amp;dn":"Henri+Nouwen+-+The+Wounded+Healer%3A+Ministry+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5b81c76f3b4a94a88ac7fdb68535c7cf1a67786","infoHashBuffer":{"type":"Buffer","data":[229,184,28,118,243,180,169,74,136,172,127,219,104,83,92,124,241,166,119,134]},"announce":[],"urlList":[]}}