{"title":"Angone - 2012 - Broken Brights  [FLAC]","uid":7466144,"size":391036961,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e5da525b9b8a98b5e42e179f6ef7ab4dd688c8d3&amp;dn=Angone+-+2012+-+Broken+Brights++%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bludStain","files":-1,"time":1342999392,"description":"Angus Stone - 2012 - Broken Brights\n\nLossless Flac\n\nreview by James Christopher Monger\nAngus Stone, the gentlemanly half of sibling folk-pop duo Angus &amp; Julia Stone, was raised on a steady diet of classic rock, and his first official solo outing (he recorded a rollicking 2009 album under the moniker Lady of the Sunshine) finds the Australian singer/songwriter successfully bridging the gap between bearded Laurel Canyon rambler and bearded indie pop urbanite. Equal parts early Ryan Adams, Elliott Smith, and Rumours-era Fleetwood Mac, with more than a little pre-facial hair Bob Dylan tossed in for good measure, Broken Brights is spilling over with songs that are tailor-made for leaping off of the couch, dumping an excess of dry food into the makeshift cereal bowl on the porch for the neighborhood feral cat, and jumping into the back of a friend's car to leisurely chase down the sunset toward its inevitable conclusion. Stone's reedy, expressive voice pairs well with the clean, concise production, which utilizes the simplest of pop setups (guitar, bass, drums, handclaps) as a vehicle for his summery tales of love, loss, legends, and lore. Standout cuts like &quot;Bird on the Buffalo,&quot; the Chris Isaak-esque murder romp &quot;The Blue Door,&quot; and the smooth and laconic title track operate in the same dusty, nostalgic pop arena that contemporaries like Midlake, Fleet Foxes, and Nicolai Dunger have been perfecting over the years, and his easy phrasing, amiable nature, and simple melodies help to make him just as attractive to the Ben Harper/Dave Matthews Band crowd as he is to the bespectacled indie folk underground.\n\n","torrent":{"xt":"urn:btih:e5da525b9b8a98b5e42e179f6ef7ab4dd688c8d3","amp;dn":"Angone+-+2012+-+Broken+Brights++%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5da525b9b8a98b5e42e179f6ef7ab4dd688c8d3","infoHashBuffer":{"type":"Buffer","data":[229,218,82,91,155,138,152,181,228,46,23,159,110,247,171,77,214,136,200,211]},"announce":[],"urlList":[]}}