{"title":"The Martian x264 Dual Audio Latino  &amp; English.mkv","uid":13159590,"size":6821905640,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:e63e1dfc336c475acd6bac1161734f974a39226a&amp;dn=The+Martian+x264+Dual+Audio+Latino++%26amp%3B+English.mkv&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"latinox264","files":1,"time":1452143578,"description":"The Martian (Marte (The Martian) en España,1 Misión Rescate en Hispanoamerica) es una película estadounidense de ciencia ficción de 2015 dirigida por Ridley Scott y escrita por Drew Goddard. Sus protagonistas son Matt Damon, Jessica Chastain, Kristen Wiig, Jeff Daniels, Michael Peña, Kate Mara, Sean Bean, Sebastian Stan, Aksel Hennie, Donald Glover, Mackenzie Davis y Chiwetel Ejiofor. La película está basada en la novela de Andy Weir de 2011 El marciano (The Martian).\r\n\r\nSinopsis:\r\n\r\nCuando la tripulación del Ares 3 se ve obligada a evacuar Marte ante una peligrosa tormenta de arena, el astronauta Mark Watney (Matt Damon) queda atrapado y sus compañeros le dan por muerto. Watney, un botánico e ingeniero mecánico de la NASA, consigue sobrevivir a la tormenta, pero se ve atrapado y solo en un planeta deshabitado, en el que sólo dispone del equipo y abastecimientos que allí han quedado y que no le permitirán sobrevivir por mucho tiempo.  \r\n\r\nA pesar de las adversidades, el astronauta decide ponerse a trabajar y echar mano de sus habilidades científicas y técnicas, para encontrar la forma de subsistir, antes de que se le agoten los suministros. Watney además, mantiene su buen humor y agilidad mental gracias a un diario de abordo en que relata sus vivencias, preocupaciones y hallazgos. \r\n\r\nMientras que sus compañeros astronautas, capitaneados por la comandante Melissa Lewis (Jessica Chastain), piensan que podría estar muerto, la NASA descubre a través de un satélite que Mark sigue con vida. En ese momento, jugará un papel decisivo el responsable de la misión Ares 3, Vincent Kapoor (Chiwetel Ejiofor). Su rescate y posible regreso a la Tierra se convierten entonces en prioritarios y en toda una aventura donde serán factores indispensables la ingeniería, la minuciosidad y cada minuto de tiempo que el astronauta pasa en Marte. \r\n\r\n6.35 GB","torrent":{"xt":"urn:btih:e63e1dfc336c475acd6bac1161734f974a39226a","amp;dn":"The+Martian+x264+Dual+Audio+Latino++%26amp%3B+English.mkv","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e63e1dfc336c475acd6bac1161734f974a39226a","infoHashBuffer":{"type":"Buffer","data":[230,62,29,252,51,108,71,90,205,107,172,17,97,115,79,151,74,57,34,106]},"announce":[],"urlList":[]}}