{"title":"[DVDRip-ac3-ITA-mp3-ENG]Mirrors - Riflessi di paura rip by CR-EW","uid":4744867,"size":1566113792,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e70cbba897c2ec9db2e6b4267e9832d215e23dbe&amp;dn=%5BDVDRip-ac3-ITA-mp3-ENG%5DMirrors+-+Riflessi+di+paura+rip+by+CR-EW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"CR-Bt","files":1,"time":1235840857,"description":"In New York, the former NYPD detective Ben Carson is hired to work as night watch of the remains of the Mayflower Department Store that was partially destroyed by fire many years ago. Ben became alcoholic and was retired from the police force after killing a man in a shooting. His marriage was also destroyed and now he is living in the apartment of his younger sister Angie. However he has not been drinking for three months and sees the employment as a chance to rebuild his life. When he goes to the rounds in his first night, he finds that the mirrors are impeccably clean and his colleague explains that the former night watch was obsessed by the mirrors. After a couple of nights, Ben sees weird images in the mirrors, but due to the lack of credibility of his past, his ex-wife Amy believes he has hallucinations as a side effect of his medication. When Angie is found brutally murdered in her bathtub, Ben discovers that there is an evil force in the mirror that is chasing him and jeopardizing his family. \n\nBen Carson (Kiefer Sutherland) ha visto giorni migliori. E' passato quasi un anno da quando l'instabile agente della polizia ÃƒÂ¨ stato sospeso dal NYPD per aver sparato e ucciso un altro membro sotto copertura, un incidente che non soltanto gli ÃƒÂ¨ costato il posto, ma che lo ha spinto verso l'alcoolismo e a nutrire un rancore che ha allontanato sua moglie e i ragazzi, portandolo a trasferirsi sul divano di sua sorella al Queens. Desiderando con tutte le sue forze rimettere a posto la sua vita e ritrovare una sintonia con la sua famiglia, Carson accetta di lavorare come guardiano notturno alle rovine dei grandi magazzini Mayflower devastati dal fuoco. Quello che un tempo era un simbolo di prosperitÃƒÂ  e grandeur ora ÃƒÂ¨ scivolato nell'oscuritÃƒÂ  come una nave fantasma in rovina, distrutta da un incendio imponente che ha divorato anche numerose vite innocenti. Quando Carson fa un giro tra gli inquietanti resti carbonizzati dell'edificio, inizia a notare qualcosa di sinistro negli elaborati specchi che adornano le pareti della Mayflower. Infatti, riflessi nei giganteschi specchi ci sono delle immagini orribili che lo sconvolgono. Oltre a proiettare delle sconvolgenti immagini del passato, gli specchi sembrano anche manipolare la realtÃƒÂ . Quando Carson vede la sua immagine torturata, soffre degli effetti fisici legati alle sue visioni da ubriaco. Improvvisamente, il problematico ex poliziotto si ritrova a dover combattere i suoi demoni personali e quelli che hanno rapito la sua immagine, tormentandolo con delle convulsioni, delle sanguinose ferite spontanee e delle esperienze di apparente soffocamento. Sua sorella Angela (Amy Smart) gli vuole bene, ma ÃƒÂ¨ scettica e considera questi bizzarri 'incubi' come una conseguenza dello stress e del senso di colpa legati alla sparatoria casuale. Invece la moglie separata di Carson, Amy (Paula Patton), un razionale patologo del NYPD, ÃƒÂ¨ meno comprensiva. Il comportamento sempre piÃƒÂ¹ strano del marito la spaventa, portando la sua famiglia ad allontanarsi, anche perchÃƒÂ© il timore ÃƒÂ¨ che lui metta i figli in pericolo. Ma c'ÃƒÂ¨ una minaccia decisamente piÃƒÂ¹ mortale che incombe, intrappolata negli specchi e nelle superfici riflettenti di cui ÃƒÂ¨ piena la nostra vita quotidiana. Mentre Carson indaga sulla misteriosa sparizione di una guardia di sicurezza della Mayflower e i suoi possibili legami con le spaventose visioni di cui soffre, capisce che una forza malvagia ed ultraterrena sta utilizzando i riflessi come un portale per terrorizzare lui e la sua famiglia. Per avere qualche speranza di salvare sua moglie e i figli da una morte orribile, Carson deve in qualche modo scoprire la veritÃƒÂ  dietro agli specchi e convincere Amy ad aiutarlo a combattere il male peggiore che lui abbia mai affrontato. Riflessi di paura ÃƒÂ¨ il secondo film &quot;americano&quot; del francese Alexandre Aja, considerato uno dei nomi di punta del cinema horror contemporaneo, ed ÃƒÂ¨ il remake di un film dell'orrore coreano noto con il titolo di Into the Mirror.","torrent":{"xt":"urn:btih:e70cbba897c2ec9db2e6b4267e9832d215e23dbe","amp;dn":"%5BDVDRip-ac3-ITA-mp3-ENG%5DMirrors+-+Riflessi+di+paura+rip+by+CR-EW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e70cbba897c2ec9db2e6b4267e9832d215e23dbe","infoHashBuffer":{"type":"Buffer","data":[231,12,187,168,151,194,236,157,178,230,180,38,126,152,50,210,21,226,61,190]},"announce":[],"urlList":[]}}