{"title":"Rootical Vibrations  Various Artists ( flac )","uid":5472165,"size":359379350,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e75bf2b95fddd898049ea4499cf5138ebd2481e8&amp;dn=Rootical+Vibrations++Various+Artists+%28+flac+%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jokersmoker","files":16,"time":1269949588,"description":"Track listing \n1. Cruising - Trinity\n2. Weeping &amp; Wailing - Rod Taylor\n3. Impostor - Afrikan Simba\n4. Stop Your Crying - Prince Alla\n5. No Wicked Can't Reign - U-Brown\n6. Evolution - Earl 16\n7. Can't Take the Pressure - Hughie Izachaar\n8. No Racial War - Dillinger\n9. Ease Off - Tony Roots\n10. Here I Stay - Alton Ellis\n11. Be Joyful - Tena Stelin\n12. I Put My Trust in Jah - Peter Broggs\n13. Africa - Anthony Johnson\n14. Wash That Woman - Horace Andy\n\n\n\n\nThis excellent compilation of modern roots reggae comes from a likely source by way of an unlikely one. The material is all licensed from Britain's fine Jah Warrior label, so far the closest thing to an heir to the throne once occupied by Adrian Sherwood's mighty On-U Sound (which has gone essentially dormant since the late '90s). The unlikely conduit for these recordings is the Victory label, much better known as home to some of the U.S.'s best hardcore punk bands. What's most exciting about this compilation, though, is the surprising mix of established names and relatively unknown artists it presents. Usually a collection like this one will be heavy on big names, and while there are quite a few of those in evidence here -- notably the legendary DJs Trinity and Dillinger along with veteran singers like Prince Alla, Alton Ellis, and Horace Andy -- there are also a number of artists who will likely be unfamiliar to all but the hippest American reggae fans, including Hughie Izachar, Tena Stellin, and Rod Taylor. And it's the unknowns who contribute some of the album's finest moments: Taylor's &quot;Weeping &amp; Wailing&quot; is suitably dread in tone and very nicely sung, while Izachar's &quot;Can't Take the Pressure&quot; is a classic sufferer's anthem, delivered in a delicate tenor wail. Other highlights include Dillinger's stentorian &quot;No Racial War&quot; and, not surprisingly, the ever-brilliant Prince Alla's exquisite &quot;Stop Your Crying.&quot; Highly recommended both as a useful introduction to the Jah Warrior label and as a pleasurable reggae experience in its own right. ~ Rick Anderson\n\n\n\n\nEnjoyyy and Seed .\n\n \n","torrent":{"xt":"urn:btih:e75bf2b95fddd898049ea4499cf5138ebd2481e8","amp;dn":"Rootical+Vibrations++Various+Artists+%28+flac+%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e75bf2b95fddd898049ea4499cf5138ebd2481e8","infoHashBuffer":{"type":"Buffer","data":[231,91,242,185,95,221,216,152,4,158,164,73,156,245,19,142,189,36,129,232]},"announce":[],"urlList":[]}}