{"title":"Precious Bane - Mary Webb [ePub] - Traitor","uid":9513385,"size":246340,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e783026788e7b19028669b105f232c62ffce1b3b&amp;dn=Precious+Bane+-+Mary+Webb+%5BePub%5D+-+Traitor&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Xetron","files":-1,"time":1390462416,"description":"Description\nNarrated by the central character Prue Sarn, whose life is blighted by having a harelip. Only the weaver, Kester Woodseaves, perceives her inner beauty but Prue cannot believe herself worthy of him. Prue is wrongly accused of murder and only one man can save her and take her away to the happiness she believes she can never possess because of her harelip. A forgotten classic set in rural Shropshire at the turn of the 19th century blends a simple, rustic love story with a profound sense of nature's mystic truth. Prue Sarn is an original and appealing heroine of English literature as she triumphs over a physical handicap to win her heart's desire. Skillfully woven through this story is the aura of the English countryside, its flora and fauna anticipating every turn of the plot.\n\nExcerpt\nIt was at a love-spinning that I saw Kester first. And if, in these new-fangled days, when strange inventions crowd upon us, when I hear tell there is even a machine coming into use in some parts of the country for reaping and mowing, if those that mayhappen will read this don't know what a love-spinning was, they shall hear in good time. But though it was Jancis Beguildy's love-spinning, she being three-and-twenty at that time and I being two years less, yet that is not the beginning of the story I have set out to tell. Kester says that all tales, true tales or romancings, go farther back than the days of the child; aye, farther even than the little babe in its cot of rushes. Maybe you never slept in a cot of rushes; but all of us did at Sarn. There is such a plenty of rushes at Sarn, and old Beguildy's missus was a great one for plaiting them on rounded barrel-hoops. Then they'd be set on rockers, and a nice clean cradle they made, soft and green, so that the babe could feel as big-sorted as a little caterpillar (painted butterflies-as-is-to-be, Kester calls them) sleeping in its cocoon. Kester's very set about such things. Never will he say caterpillars. He'll say, 'There's a lot of butter-flies-as-is-to-be on our cabbages, Prue.' He won't say 'It's winter.' He'll say, 'Summer's sleeping.' And there's no bud little enough nor sad-coloured enough for Kester not to callen it the beginnings of the blow.","torrent":{"xt":"urn:btih:e783026788e7b19028669b105f232c62ffce1b3b","amp;dn":"Precious+Bane+-+Mary+Webb+%5BePub%5D+-+Traitor","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e783026788e7b19028669b105f232c62ffce1b3b","infoHashBuffer":{"type":"Buffer","data":[231,131,2,103,136,231,177,144,40,102,155,16,95,35,44,98,255,206,27,59]},"announce":[],"urlList":[]}}