{"title":"Oingo Boingo (Danny Elfman) Farewell Concert - Halloween- Univer","uid":5712810,"size":7009909783,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:e85996a92bd521488a10eb4a6c5eaeeef315ca0e&amp;dn=Oingo+Boingo+%28Danny+Elfman%29+Farewell+Concert+-+Halloween-+Univer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"MASK.13","files":11,"time":1279929962,"description":"Amazon.com\n\n&quot;This is like one big orgasm!&quot; says singer-frontman Danny Elfman toward the end of Oingo Boingo's final concert on Halloween night, 1995. That's an apt comparison, since this two-hour, 45-minute performance plays like an extended climax, with Elfman and his bandmates putting out enough energy to light a small city and turn their costumed devotees into a pulsing mass of mutual love. Elfman's like a supernova onstage, maintaining a miraculous pace through 32 songs, any one of which qualifies as definitive Boingo (though we're partial to &quot;Insanity,&quot; &quot;Dead Man's Party,&quot; and the Dr. Moreau-inspired &quot;No Spill Blood&quot;). In retrospect it's clear that Oingo Boingo wanted to cap 17 years of success with their finest concert, and this one arguably meets that goal. Thorough but inconspicuous camera coverage captures the whole show from start to finish, and the Dolby 2-channel stereo is crisp and clear. Watch it all at once--we guarantee you'll be euphorically exhausted. --Jeff Shannon\n\nDVD features\n\nDisc Two in this set includes a playful, sideshow-like history of Oingo Boingo, in addition to backstage featurettes shot before and after the &quot;Farewell&quot; concert that comprises Disc One. Band members, crew members, and fans are given equal time to spread Boingo cheer, and two vintage Oingo Boingo videos (for &quot;Little Girls&quot; and &quot;Insanity&quot;) are hidden on the disc for tenacious viewers. (Hint: use your DVD remote's &quot;back&quot; button on the disc's main menu.) --Jeff Shannon","torrent":{"xt":"urn:btih:e85996a92bd521488a10eb4a6c5eaeeef315ca0e","amp;dn":"Oingo+Boingo+%28Danny+Elfman%29+Farewell+Concert+-+Halloween-+Univer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e85996a92bd521488a10eb4a6c5eaeeef315ca0e","infoHashBuffer":{"type":"Buffer","data":[232,89,150,169,43,213,33,72,138,16,235,74,108,94,174,238,243,21,202,14]},"announce":[],"urlList":[]}}