{"title":"Korvac:  (The Korvac Saga; The Korvac Quest; and Appearances)","uid":7669668,"size":375802689,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:ea8959f2858ad918ccb2d07a6310a14ab6252007&amp;dn=Korvac%3A++%28The+Korvac+Saga%3B+The+Korvac+Quest%3B+and+Appearances%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SplhcbPrime","files":-1,"time":1348532606,"description":"Michael Korvac (often called Korvac, or The Enemy) is a fictional character that appears in comic books published by Marvel Comics.  Korvac debuted in Giant-Size Defenders 3 (in 1975,) and according to creator Steve Gerber, &quot;The character really was a throwaway, created for one story.  And I never intended to bring him back, because, among other things, I hated the name!  I still think it sounds more like a vacuum cleaner than a villain.&quot; \n\nKorvac was originally a normal man until the Badoon amputated the lower half of his body, and grafted his upper body and nervous system onto a specialized computer module capable of siphoning energy from virtually any source.  The computer module could also tap and synthesize any form of energy, and concealed advanced weaponry.  Michael Korvac is also a brilliant computer scientist; a master strategist and formidable hand-to-hand combatant.\n\nKorvac flees across time and space to the Earth-616 universe.  Upon arrival, Korvac discovers the space station of the entity, Galactus.  While attempting to download the knowledge of Galactus from the station into his own system, Korvac is imbued with the Power Cosmic, becomes god-like, and is capable of energy projection; matter alteration; teleportation and manipulation of time and space, too.  In his perfect human form, Korvac retained all his cosmic abilities and could use these to achieve virtually any effect.\n\nKorvac then recreates himself as a perfect humanoid form, and posing as a human called, &quot;Michael,&quot; travels to Earth with the intent of reshaping it into a utopia.  However, Korvac is pursued by the Guardians of the Galaxy, who join forces with the superhero team, The Avengers, in a bid to stop the villain.\n\n\nThis torrent includes all the appearances of Korvac I could find; The Korvac Saga; and The Korvac Quest.\n","torrent":{"xt":"urn:btih:ea8959f2858ad918ccb2d07a6310a14ab6252007","amp;dn":"Korvac%3A++%28The+Korvac+Saga%3B+The+Korvac+Quest%3B+and+Appearances%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea8959f2858ad918ccb2d07a6310a14ab6252007","infoHashBuffer":{"type":"Buffer","data":[234,137,89,242,133,138,217,24,204,178,208,122,99,16,161,74,182,37,32,7]},"announce":[],"urlList":[]}}