{"title":"Poser Utilities AIO","uid":4144548,"size":131528666,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:eae57f5c66a291e73531d043309b324e28282b90&amp;dn=Poser+Utilities+AIO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"angelicaberu","files":4,"time":1208655652,"description":"Poser Utilities AIO\n\nDescription:\nMorph Master is a program that can help you with the creation of morph targets for Poser. You can import the *.obj files of the geometries, modify them in the program and export the changes as morph targets.\n\nMimic Pro provides an advanced environment for easily creating and editing facial animation sequences. Take existing WAV audio files of any language and let Mimic animate your figure for you. Or, record your own speech file within Mimic&amp;#039;s simple recording studio via a microphone connected to your computer. With the ability to add in expressions such as winks, nods, and smiles, your figures can easily become as expressive as your imagination allows.\n\nZBrush is an integrated modeling, texturing and illustration environment. It is used in production as a modeling and designing tool for film, games and illustration. ZBrush has an extensive set of real-time sculpting, texturing, and deformation tools.\n\nUVMapper Professional is a stand-alone texture mapping utility for the creation and modification of UV coordinates for n-sided polygonal 3D models. UVMapper Professional offers multiple, fully configurable viewports with completely interactive 2D and 3D views.\n\nObjaction Mover is a Windows tool which allows the transfer of .obj files based on other copyright figures, for example the individual figures sold by Zygote. Mover extracts the differences between the original file and new modified file and it is only the differences that get sent.\n\nDial Magic lets you focus on only the dials you need at any single time. Many people find it hard to locate the dials they need because there are just SO many. A massive bank of dials exactly like the picture on the product page doesn&amp;#039;t appear, the dials merely get customized so that only particular ones appear.\n\nDAZ Material Manager not only simplfies changing the maps for your favorite models, but also makes setting all material properties a breeze. Launch this Python script and you&amp;#039;ll never want to open an old Material Editor again.\n\nThe Universal Texture Convertor is a fully automatic texture convertor. By simply selecting the input and output model types, a new texture map can be made up in a matter of minutes! Plugins for all of the popular DAZ characters are included.\n","torrent":{"xt":"urn:btih:eae57f5c66a291e73531d043309b324e28282b90","amp;dn":"Poser+Utilities+AIO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eae57f5c66a291e73531d043309b324e28282b90","infoHashBuffer":{"type":"Buffer","data":[234,229,127,92,102,162,145,231,53,49,208,67,48,155,50,78,40,40,43,144]},"announce":[],"urlList":[]}}