{"title":"Poles, Jews, and the Politics of Nationality: The Bund and the P","uid":11760290,"size":10920114,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:eb26d9614c886b1c3f2ac424da38f65b20446fe2&amp;dn=Poles%2C+Jews%2C+and+the+Politics+of+Nationality%3A+The+Bund+and+the+P&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1426563353,"description":"The Jewish experience on Polish lands is often viewed backwards through the lens of the Holocaust and the ethnic rivalries that escalated in the period between the two world wars. Critical to the history of Polish-Jewish relations, however, is the period prior to World War I when the emergence of mass electoral politics in Czarist Russia led to the consolidation of modern political parties. Using sources published in Polish, Yiddish, Hebrew, and Russian, Joshua D. Zimmerman has compiled a full-length English-language study of the relations between the two dominant progressive movements in Russian Poland. He examines the Polish Socialist Party (PPS), which sought social emancipation and equal civil rights for minority nationalities, including Jews, under a democratic Polish republic, and the Jewish Labor Bund, which declared that Jews were a nation distinct from Poles and Russians and advocated cultural autonomy. By 1905, the PPS abandoned its call for Jewish assimilation, and recognized Jews as a separate nationality. Zimmerman demonstrates persuasively that Polish history in Czarist Russia cannot be fully understood without studying the Jewish influence and that Jewish history was equally infused with the Polish influence","torrent":{"xt":"urn:btih:eb26d9614c886b1c3f2ac424da38f65b20446fe2","amp;dn":"Poles%2C+Jews%2C+and+the+Politics+of+Nationality%3A+The+Bund+and+the+P","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb26d9614c886b1c3f2ac424da38f65b20446fe2","infoHashBuffer":{"type":"Buffer","data":[235,38,217,97,76,136,107,28,63,42,196,36,218,56,246,91,32,68,111,226]},"announce":[],"urlList":[]}}