{"title":"The Red Princess Mysteries - Lisa See.epub","uid":9567401,"size":2168335,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ec9a50062ed6f7338e1ee5ae231a4ba7bae1c473&amp;dn=The+Red+Princess+Mysteries+-+Lisa+See.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1391547045,"description":"\n[IMG]http://s20.postimg.org/4geepb9b1/cover.jpg[/IMG]\n\nThe bestselling Red Princess thrillers aren't just riveting crime stories; they're novels of emotional depth and savvy insight into modern China. At the heart of Lisa See's dynamic, suspenseful trilogy is the relationship between detective Liu Hulan and American attorney David Stark, two characters caught in the crush of international affairs. Now the entire series is available in one handy eBook bundle:\n\nFLOWER NET\n\n&quot;See brings a cool, knowing eye to Chinese-American relations while crafting a nifty tale of suspense.&quot;--&quot;Chicago Tribune&quot;\nIn the waning days of Deng Xiaoping's reign, the U.S. ambassador's son is found entombed in a frozen lake. Off the coast of California, Assistant U.S. Attorney David Stark discovers the corpse of a Red Prince, a scion of China's political elite. With the Chinese and American governments joining forces to see justice done, David teams up with unorthodox police detective Liu Hulan in Beijing. As their investigation sparks an intense connection, David and Hulan uncover a web linking human trafficking to the drug trade and to governmental treachery--a web reaching from the Forbidden City to Los Angeles and, like the wide flower net used by Chinese fishermen, threatening to ensnare all within its reach.\n\nTHE INTERIOR\n\n&quot;Immediate, haunting and exquisitely rendered.&quot;--&quot;San Francisco Chronicle&quot;\nAs David Stark opens a law office in Beijing, Liu Hulan receives an urgent message imploring her to investigate the death of an old friend's daughter, who worked for a toy company about to be sold to a new client of David's. Despite his protests, Hulan goes undercover at the toy factory in a rural village deep in the heart of China, a place that forces her to face a past she has long been running from. Suddenly Hulan and David find themselves on opposing sides: one trying to expose a rogue company, the other bound to protect his client. As pressures mount, they uncover universal truths about good and evil, right and wrong--and the sometimes subtle lines that distinguish them.\n\nDRAGON BONES\n\n&quot;Stays with you long after the conventional thriller is forgotten.&quot;--&quot;The Washington Post Book World&quot;\nLiu Hulan and David Stark are traveling to one of the most beautiful places on earth: the Three Gorges, where China's biggest engineering project since the Great Wall is taking place. Hulan is there to investigate the death of an American archaeologist found in the Yangzi River; David is trying to figure out who's stealing artifacts and selling them on the international art market. Haunting the investigation is the possibility that an artifact has been found that could very well alter the history of civilization. Together, David and Hulan unearth more scandals and revive tragic memories as they struggle to solve a mystery as big, unruly, and complex as China itself.\n\nPraise for Lisa See and her Red Princess mysteries\n\n&quot;One of the classier practitioners of . . . the international thriller . . . She draws her characters . . . with convincing depth, and offers up documentary social detail that reeks of freshly raked muck. See's China is as vivid as Upton Sinclair's Chicago.&quot;--&quot;The New York Times Book Review&quot;","torrent":{"xt":"urn:btih:ec9a50062ed6f7338e1ee5ae231a4ba7bae1c473","amp;dn":"The+Red+Princess+Mysteries+-+Lisa+See.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec9a50062ed6f7338e1ee5ae231a4ba7bae1c473","infoHashBuffer":{"type":"Buffer","data":[236,154,80,6,46,214,247,51,142,30,229,174,35,26,75,167,186,225,196,115]},"announce":[],"urlList":[]}}