{"title":"Thomas A. Dorsey - Precious Lord","uid":7323300,"size":183277993,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ed28f048a8326b9a46554e79621cf736c1fb51c3&amp;dn=Thomas+A.+Dorsey+-+Precious+Lord&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"mudmashers","files":20,"time":1338681404,"description":"Precious Lord: Recordings of the Great Gospel Songs of Thomas A. Dorsey [Sony] (CD320kb)\n\n01.  Take My Hand, Precious Lord - Thomas A. Dorsey with Marion Williams\t \t \n02.  It's A Highway To Heaven - Thomas A. Dorsey with Alex Bradford\t\t\t \n03.  Hide Me In Thy Bosom - Thomas A. Dorsey with The Dixie Hummingbirds\t\t \n04.  I'm Going To Live The Life I Sing About In My Song - Thomas A. Dorsey with Marion Williams\t \t \n05.  (There'll Be) Peace In The Valley - Thomas A. Dorsey with R.H. Harris\t \t \n06.  What Could I Do If It Wasn't For The Lord - Thomas A. Dorsey with Marion Williams\t \t \n07.  I'm Waiting For Jesus - Thomas A. Dorsey with The Dixie Hummingbirds\t\t \n08.  I Don't Know Why - Thomas A. Dorsey with Bessie Griffin\t \t \n09.  If You See My Savior - Thomas A. Dorsey with Alex Bradford\t\t \n10.  If We Never Needed The Lord Before - Thomas A. Dorsey with Marion Williams\t \t \n11.  Thy Servant's Prayer Amen - Thomas A. Dorsey with R.H. Harris\t \n12.  Search Me Lord - Thomas A. Dorsey with Bessie Griffin\t \t \n13.  When The Gates Swing Open - Thomas A. Dorsey with The Dixie Hummingbirds\t \t \n14.  My Desire - Thomas A. Dorsey with Delois Barrett Campbell\t \n15.  Old Ship Of Zion - Thomas A. Dorsey with Bessie Griffin\t  \n16.  How Many Times - Thomas A. Dorsey with Alex Bradford\t  \n17.  I'll Tell It Wherever I Go - Thomas A. Dorsey with Sallie Martin\t \t \n18.  Never Turn Back - Thomas A. Dorsey with R.H. Harris\t \n19.  The Lord Will Make A Way Somehow - Thomas A. Dorsey with Marion Williams","torrent":{"xt":"urn:btih:ed28f048a8326b9a46554e79621cf736c1fb51c3","amp;dn":"Thomas+A.+Dorsey+-+Precious+Lord","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed28f048a8326b9a46554e79621cf736c1fb51c3","infoHashBuffer":{"type":"Buffer","data":[237,40,240,72,168,50,107,154,70,85,78,121,98,28,247,54,193,251,81,195]},"announce":[],"urlList":[]}}