{"title":"Nuclear Back-end and Transmutation Technology for Waste Disposal","uid":14620839,"size":14201491,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ed8595d9ec845e773384367f9bc4944fc8d44a0e&amp;dn=Nuclear+Back-end+and+Transmutation+Technology+for+Waste+Disposal&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1463268781,"description":"Nuclear Back-end and Transmutation Technology for Waste Disposal - Ken Nakajima (Springer, 2015).pdf\r\n\r\nISBN 978-4-431-55110-2\r\n\r\nThis book covers essential aspects of transmutation technologies, highlighting especially the advances in Japan. The accident at the Fukushima Daiichi Nuclear Power Plant (NPP) has caused us to focus attention on a large amount of spent nuclear fuels stored in NPPs. In addition, public anxiety regarding the treatment and disposal of high-level radioactive wastes that require long-term control is growing. The Japanese policy on the back-end of the nuclear fuel cycle is still unpredictable in the aftermath of the accident. Therefore, research and development for enhancing the safety of various processes involved in nuclear energy production are being actively pursued worldwide. In particular, nuclear transmutation technology has been drawing significant attention after the accident.\r\n\r\nThis publication is timely with the following highlights: 1) Development of accelerator-driven systems (ADSs), which is a brand-new reactor concept for transmutation of highly radioactive wastes; 2) Nuclear reactor systems from the point of view of the nuclear fuel cycle. How to reduce nuclear wastes or how to treat them including the debris from TEPCO’s Fukushima nuclear power stations is discussed; and 3) Environmental radioactivity, radioactive waste treatment, and geological disposal policy.\r\n\r\nState-of-the-art technologies for overall back-end issues of the nuclear fuel cycle as well as the technologies of transmutation are presented here. The chapter authors are actively involved in the development of ADSs and transmutation-related technologies. The future of the back-end issues in Japan is very uncertain after the accident at the Fukushima Daiichi NPP, and this book provides an opportunity for readers to consider the future direction of those issues","torrent":{"xt":"urn:btih:ed8595d9ec845e773384367f9bc4944fc8d44a0e","amp;dn":"Nuclear+Back-end+and+Transmutation+Technology+for+Waste+Disposal","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed8595d9ec845e773384367f9bc4944fc8d44a0e","infoHashBuffer":{"type":"Buffer","data":[237,133,149,217,236,132,94,119,51,132,54,127,155,196,148,79,200,212,74,14]},"announce":[],"urlList":[]}}