{"title":"Naxal (2015)-DVD.Rip-HEVC-x265.AAC (5.1 Ch).Esubs-1CD-[DDR]","uid":12747682,"size":733105785,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:eda665357347635f7f4e5668eb8abf4926dcf148&amp;dn=Naxal+%282015%29-DVD.Rip-HEVC-x265.AAC+%285.1+Ch%29.Esubs-1CD-%5BDDR%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SaM","files":1,"time":1447336301,"description":"\nDDR Presents\r\n\r\n\r\nNaxal(2015)\r\n(A film by Debaditya Bandyopadhyay)\r\n\r\nBengali - DVD rip - 720x304p (2.35:1)- 699 MB - x.265.AAC (5.1 Ch).Esubs - 1 Hr:39 Min\r\n\r\nHIGH EFFICIENCY VIDEO ENCODING (HEVC)\r\n \nhttp://extraimago.com/image/ZIi \nhttp://extraimago.com/image/ZIm \nhttp://extraimago.com/image/ZIR \nhttp://extraimago.com/image/ZIQ \nhttp://extraimago.com/image/ZIL \nhttp://extraimago.com/image/ZIy \nhttp://extraimago.com/image/ZIq \nhttp://extraimago.com/image/ZIS \nhttp://extraimago.com/image/ZIO \nhttp://extraimago.com/image/ZIE \nhttp://extraimago.com/image/ZI1\r\n\r\niNFO\r\n \nhttp://extraimago.com/image/ZbM\r\n\r\nSynopsis:\r\nFlash back to 21 May 1971. It is at the height of the Naxal movement in Bengal. As more and more students and intelligetsia join in, the authorities supress the movement with a heavy hand. Shankar-da, a team leader is captured, and in order to save his own skin, gives out information on his mates. In the encounter that follows, one person is killed, but Anirban Sen, the firebrand, escapes. Shankar goes abroad, as he is given safe passage by the police in return for his treachery.\r\n\r\nWinding forward to 2013, Anirban is now a clerk in a government office. He is married to Rina and has a thalassemic son Dodo. Like all lower middle class families, they dream of a house of their own and take a loan to buy one, only to find that they can't keep up with the instalments. They are dispossessed, and in the meantime Dodo's disease becomes much worse. In desperation, the once idealistic Anirban statrs taking bribes but his caught and loses his job. Rina is forced into prostitution and after a quarrel with her husband, commits suicide. Anirban is left alone with Dodo, until one day he can't stand the pain his son is undergoing and smothers Dodo to death.\r\n\r\nLeft with nothing, the old idealistic flame burns again in Anirban. He threatens to commit suicide by jumping before the last train of the Kolkata Metro unless his demands of justice are met. His cause is taken up by Siddhartha a media mogul, who wants to use this occasion to increase his viewership. As mass hysteria bulids up, it turns out that Siddhartha is really Shankar, the traitor. The old comrades meet face to face on the tracks of the Kolkata Metro for a final showdown..\r\n\r\n\r\nComments:\r\nIf there is something that you realise early on in this film, it is this - Debaditya Bandyopadhyay has no idea what he wants to convey to his audience. The screenplay is a mishmash of half a dozen little plots, most of which are completely meaningless and adds little to the main narrative. The main narrative - and there are two - one about Anirban's slow descent to destitution and the other about his showdown with his treacherous comrade - is depressingly predictable. At the start I knew how the film was likely to pan out and disappointingly, it panned out just the way I feared it would do. The two main narratives do not really meet at any point and both are weak, to the point of being ridiculous. Why should, for example, Anirban want to plant a bomb in the house from which he has been dispossessed? To kill the next owner? Or why should he want to take revenge on his erstwhile comrade after all of 42 years? Why not earlier? And if he was 16-17 in 1971, in 2013 he would have been close to 60. his wife would have been around 50 too. Can you imagine a 50 year old woman taking to prostitutution and earning a lakh of rupees in a couple of sessions per week? And of course, the villain would be a debauch and be blackmailed for it, although what was the relevance of his scenes with his would be employee is something that I at least was not able to fathom..\r\n\r\nThe whole film rests on Mithun and to a lesser extent Dhritiman. They do an adequate job, although neither impresses too much. Others have bit roles and often meaningless roles and perform accordingly. Music is pedestrian and editing left a lot to be desired. Photography by Bijoy Anand is excellent, perhaps the only redeeming feature.\r\n\r\nOverall a very mediocre film. Watch it if you a diehard Mithun fan, or if you love to spend an hour an a half without having to excercise your grey cells.\r\n\r\n\r\nUploader's Notes:\r\nThe DVD was reasonably good and so the rip has turned out well. We have brought out details quite a bit, reduced the ugly yellow tint of the DVD and improved luminance a bit.\r\n\r\nCheck the screenshots which are evenly spaced across the film and the sample, which is from the exact center of the movie to get an idea of the quality of this rip.\r\n\r\nPlease note that this rip (and all HEVC rips) will not play on any stand-alone device. You can only watch this on a computer. Be sure that you have the latest versions of VLC (2.1.5 or higher) or Media Player Classic (Ver 1.7.9) or SMPlayer (14.9.0). Earlier versions may not work\r\n\r\nIMDB Link: \nhttp://www.imdb.com/title/tt4796654/","torrent":{"xt":"urn:btih:eda665357347635f7f4e5668eb8abf4926dcf148","amp;dn":"Naxal+%282015%29-DVD.Rip-HEVC-x265.AAC+%285.1+Ch%29.Esubs-1CD-%5BDDR%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eda665357347635f7f4e5668eb8abf4926dcf148","infoHashBuffer":{"type":"Buffer","data":[237,166,101,53,115,71,99,95,127,78,86,104,235,138,191,73,38,220,241,72]},"announce":[],"urlList":[]}}