{"title":"Grant Green Grantstand(jazz)(mp3@320)[rogercc]","uid":6644136,"size":101753424,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:efc11eb65a854d6dccbf08b3655993922d162939&amp;dn=Grant+Green+Grantstand%28jazz%29%28mp3%40320%29%5Brogercc%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rogercc1","files":5,"time":1314836957,"description":"GRANT GREEN GRANTSTAND\nLabel Blue Note \nOriginal Year 1961\nFormat: Mp3@320\n\n\nGrant Green's third album to be released, Grantstand teams the clear-toned guitarist with an unlikely backing group of musicians who rarely appeared with Blue Note otherwise: tenor saxophonist Yusef Lateef (who doubles on flute), organist Brother Jack McDuff, and drummer Al Harewood. Although Lateef was beginning to delve deeply into Eastern tonalities and instruments around the same time, his playing here is pretty straightforward and swinging, fitting the relaxed, bop-tinged soul-jazz that makes up most of the session. For his part, McDuff is mellower than his usual ferocious self, laying back and swinging with a blissful ease. Green contributes two bluesy originals, the nine-minute title track and the 15-minute &quot;Blues in Maude's Flat,&quot; which are turned into loose, loping jams that rank as some of the best examples of Green's ability to work an extended groove. (The CD bonus track, &quot;Green's Greenery,&quot; is in much the same vein, though not as long.) Elsewhere, Green leads a delicate, sensitive exploration of &quot;My Funny Valentine&quot; that ended up as his greatest standard performance to date, setting the stage for a great deal more work in this vein that was soon to be forthcoming (including his brilliant sessions with Sonny Clark). Still, the groove is what reigns supreme for most of the album; if you're looking for Green the soul-jazz groovemaster, Grantstand is an excellent place to find him. ~ Steve Huey[\n\n\nTracklist\n1 Grantstand 9:00 \n2 My Funny Valentine 9:03 \n3 Blues in Maude's Flat 15:00 \n4 Old Folks 4:10 \n5 Green's Greenery 5:08\n\nRecorded at the Van Gelder Studio, Englewood Cliffs, New Jersey on August 1, 1961. Originally released on Blue Note (4086)\n\nPersonnel:[/b][/color] Grant Green (guitar); Yusef Lateef (tenor saxophone, flute); Jack McDuff (organ); Al Harewood (drums).\n","torrent":{"xt":"urn:btih:efc11eb65a854d6dccbf08b3655993922d162939","amp;dn":"Grant+Green+Grantstand%28jazz%29%28mp3%40320%29%5Brogercc%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"efc11eb65a854d6dccbf08b3655993922d162939","infoHashBuffer":{"type":"Buffer","data":[239,193,30,182,90,133,77,109,204,191,8,179,101,89,147,146,45,22,41,57]},"announce":[],"urlList":[]}}