{"title":"Alva Noto &amp; Opiate - Opto Files","uid":4290725,"size":205406205,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f0c6c0771d91a9bda8f95774b38e2eae6f85385c&amp;dn=Alva+Noto+%26+Opiate+-+Opto+Files&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"amlux00r","files":4,"time":1215888044,"description":"Both Alva Noto and Thomas Knak have well-documented predilections toward breathable, open-aired soundscapes, so it comes as no surprise that Opto Files -- their joint collaboration -- is a meditative, vapourous swirl. With only a few elements ever occupying the stereo stage at one time, it&amp;#039;s not difficult to traceroute their individual contributions -- Noto&amp;#039;s are the emery paper skiffles and velcroed rhythms, Knak&amp;#039;s are the single-motif organ melodies and translucent hums. Each of the four tracks on Opto Files remains faithful to this blueprint while conjuring a distinct mood of its own. &quot;Opto File 1&quot; is a warm midevening balm of gently unravelling synth pads and agitated static, &quot;Opto File 2&quot; an industrial phone line interference piece played on a broken switchboard, &quot;Opto File 3&quot; a glitch-tickled lullaby with a slumberous organ, and &quot;Opto File 4&quot; is a motionless, barely there drone piece that empties itself out to a close. Those in search of either more immersive glitch or more melodic electronic might ultimately be better off consulting Noto&amp;#039;s and Knak&amp;#039;s solo discographies respectively, but as a passive ambient excursion, Opto Files does its duty. -- Allmusic","torrent":{"xt":"urn:btih:f0c6c0771d91a9bda8f95774b38e2eae6f85385c","amp;dn":"Alva+Noto+%26+Opiate+-+Opto+Files","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0c6c0771d91a9bda8f95774b38e2eae6f85385c","infoHashBuffer":{"type":"Buffer","data":[240,198,192,119,29,145,169,189,168,249,87,116,179,142,46,174,111,133,56,92]},"announce":[],"urlList":[]}}