{"title":"The Big Book of Painting Nature in Watercolor (1990).pdf Gooner","uid":12084902,"size":57986190,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f1125dcaa1f8fd178ee42441fb89a672760d77c7&amp;dn=The+Big+Book+of+Painting+Nature+in+Watercolor+%281990%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1435873186,"description":"Scanned Pdf, Perfectly readable\nPublisher: Watson-Guptill; First edition (May 1, 1990)\nLanguage: English\nISBN-10: 0823004996\nISBN-13: 978-0823004997\n\nDepict the play of light on spring foliage silhouetted against a dark sky. Paint a vivid sunset over a lake. Capture the drama of waves surging toward the shore. The Big Book of Painting Nature in Watercolor provides 135 stimulating demonstrations in painting trees, skies, and water from beautiful photographs by one of the world's leading nature photographers. \n\nThis book will be invaluable to landscape artists. The 600 magnificent illustrations and engaging text cover the entire range of watercolor techniques and give the artist in-depth instruction in painting beautiful images of the natural world in all seasons, weather, geographical variety, and at every time of day. Many of the lessons are followed by assignments designed to help you apply what you have just learned to new situations. \n\nThe Big Book of Painting Nature in Watercolor is a must for everyone who wants to master the techniques for becoming a first-rate landscape painter.\n\nAbout the Author\n\nFerdinand Petrie has been the recipient of awards from art associations throughout the United States. His paintings appear in numerous museums, galleries, and private collections. He is the author of Drawing Landscapes in Pencil. \n\nJohn Shaw is one of the world's leading nature photographers. His work has appeared in such magazines as Audubon and National Wildlife, and in numerous books","torrent":{"xt":"urn:btih:f1125dcaa1f8fd178ee42441fb89a672760d77c7","amp;dn":"The+Big+Book+of+Painting+Nature+in+Watercolor+%281990%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1125dcaa1f8fd178ee42441fb89a672760d77c7","infoHashBuffer":{"type":"Buffer","data":[241,18,93,202,161,248,253,23,142,228,36,65,251,137,166,114,118,13,119,199]},"announce":[],"urlList":[]}}