{"title":"Alexander's Surgical Procedures [PDF][tahir99] VRG.pdf","uid":10564006,"size":256030417,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f160e2bfafb90a8f805ca14282d2324cb43c8c6f&amp;dn=Alexander%27s+Surgical+Procedures+%5BPDF%5D%5Btahir99%5D+VRG.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tahir99","files":-1,"time":1405496209,"description":"Alexander's Surgical Procedures, 1e\n\nJane C. Rothrock PhD RN CNOR FAAN (Author), Sherri Alexander CST (Author)\n\nTRUE PDF, BOOKMARKED and INDEXED\n\nPublication Date: September 26, 2011 | ISBN-10: 032307555X | ISBN-13: 978-0323075558 | Edition: 1\n\nDeveloped specifically for surgical technologists, Alexander's Surgical Procedures provides proven, step-by-step coverage of essential surgical procedures from one of the most trusted sources in surgical technology. Building on the renowned content of Alexander's Care of the Surgical Patient, 14th Edition, respected authorities Jane Rothrock and Sherri Alexander (AST president 2007 - 2011) guide you through the pre-op set up, procedure pathology/steps, and post-op considerations for all required procedures. This approachable, easy-to-use resource complements the fundamental coverage in your other surgical technology textbooks, and detailed procedure videos on a companion Evolve website help you ensure success from the classroom to the OR.\n\nContent adapted from Alexander's Care of the Surgical Patient, 14th Edition provides comprehensive procedural coverage optimized for your specific needs as a surgical technologist.\n\nSurgical Technologist Considerations boxes detail practical strategies for applying chapter content to specialty procedures.\n\nComplete pre-op set up, draping, and other instructions for each procedure equip you to confidently perform all of the duties of surgical technologist in the OR setting.\n\nChapter Outlines, Learning Objectives, and Chapter Summaries help you study chapter content more effectively.\n\nReview questions in the text and case studies on Evolve reinforce key concepts and encourage critical thinking.\n\nOR Live links on Evolve direct you to step-by-step procedure videos for commonly performed procedures.\n\nMore than 700 full-color illustrations clarify surgical anatomy, instrumentation, procedures, and methods.\n\nSurgical Pharmacology tables provide quick, convenient access to generic/trade names, purpose/description, and pharmacokinetics for drugs most commonly associated with each specific surgical procedure.\n\nCutting-edge content reflects the latest interventions and patient care techniques in surgical practice.\n\nGeriatric Consideration boxes help you manage surgical challenges unique to geriatric patients.\n\nPatient Safety boxes alert you to recent Joint Commission safety initiatives to ensure safe performance of key tasks.\n\nHistory boxes present chapter content in a broader context to enhance your understanding and retention.\n\nAmbulatory Surgical Considerations boxes highlight important changes to patient care within appropriate procedures.\nRisk Reduction Strategies boxes provide specific steps you can take to improve patient safety.","torrent":{"xt":"urn:btih:f160e2bfafb90a8f805ca14282d2324cb43c8c6f","amp;dn":"Alexander%27s+Surgical+Procedures+%5BPDF%5D%5Btahir99%5D+VRG.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f160e2bfafb90a8f805ca14282d2324cb43c8c6f","infoHashBuffer":{"type":"Buffer","data":[241,96,226,191,175,185,10,143,128,92,161,66,130,210,50,76,180,60,140,111]},"announce":[],"urlList":[]}}