{"title":"Hidden Secrets - Part 24 - Spiritual Warfare, Witches and Demons","uid":12182694,"size":6918101503,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f2d1edce1405b7ba7979a4f0f70d729e4c0b0ebf&amp;dn=Hidden+Secrets+-+Part+24+-+Spiritual+Warfare%2C+Witches+and+Demons&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"POtHS11","files":61,"time":1438483588,"description":" National Geographic's Salem Witch Trial Conspiracy:\nIn Salem Witch Trial Conspiracy, join author Katherine Howe as she embarks on a historical journey to bring you the truth behind the world's most famous witch-hunt.\n\nOf the over one hundred people charged with witchcraft, five died in jail, 19 died on the gallows and one was crushed to death.  Each of these deaths was the result of an overwhelming religious hysteria, and even to this date historians are uncovering more about what really occurred.\n\nOne of the first victims was a British born ancestor of Katherine, who revisits the site of the trials to examine fascinating new research and delve into Salem's horrific past.  By studying the sermons of the village's Puritan minister Samuel Parris, historians have deduced that a chilling plot could have been the cause of the frenzy that followed.\n\nParris was at the very heart of Salem's terror, and it was the supposed possession of his own niece and daughter that led to the first arrest.  From studying his hand-written notes, which have been preserved to this day, it seems he believed his ministry was under attack. But was his true enemy the devil, or his own employers?  Find out in the Salem Witch Trial Conspiracy.\n\n\nThe Ancient world of Demons Reptilians Gods and the Djinn:\nThe Ancient world of Demons, Reptilians, Gods and the Djinn includes Reptilians, Demons and the Djinn in ancient mythology Full Documentary reptilian demon ghost 2011 Documentaries ars goetia mayan eygptian sumerian greek indian gods and demon list WOLVOMAN80 king solomon gargoyle sinbad chinese dragon all seeing eye of horus ancient aliens and ufo ufos jesus saves sinners the holy bible adam and eve lilith snake people angels and demons 300 spatans jinn aztec gods evil demons sprits real witch witches illuminati alien mark beast conspiracy angels world armageddon secret ufo new demons mind control prophecy fallen goddess pagan ancient mythology genie aladdin wizards black magic magick slidehow and commentary sources include holy bible the quran sumerian writings and many more illuminati gods new world order demonic scene from movie scary music 2011","torrent":{"xt":"urn:btih:f2d1edce1405b7ba7979a4f0f70d729e4c0b0ebf","amp;dn":"Hidden+Secrets+-+Part+24+-+Spiritual+Warfare%2C+Witches+and+Demons","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2d1edce1405b7ba7979a4f0f70d729e4c0b0ebf","infoHashBuffer":{"type":"Buffer","data":[242,209,237,206,20,5,183,186,121,121,164,240,247,13,114,158,76,11,14,191]},"announce":[],"urlList":[]}}