{"title":"The Politically Incorrect Guide To The Founding Fathers","uid":9303458,"size":650707725,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f320121f74897f827655c7d2c380f9a9de0fad8a&amp;dn=The+Politically+Incorrect+Guide+To+The+Founding+Fathers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Hiecpo","files":-1,"time":1386278978,"description":"Brion McClanahan - The Politically Incorrect Guide To The Founding Fathers\n\n(2009) 178 files, 620MB, 128kbps, 9:29:19\n\nUnabridged, Read by Tom Weiner\n\nThe truth revealed--and PC myths shattered--about the Founding Fathers\n\nTom Brokaw labeled the World War II generation the &quot;Greatest Generation,&quot; but he was wrong. That honor belongs to the Founders--the men who pledged their lives, fortunes, and sacred honor for the cause of liberty and independence, and who established the United States. This was a generation without equal, and it deserves to be rescued from the politically correct textbooks, teachers, and professors who want to dismiss the Founders as a cadre of dead, white, sexist, slave-holding males.\n\nNow, a clear-sighted conservative historian, Dr. Brion McClanahan, does just that. In The Politically Incorrect Guide to the Founding Fathers, he profiles Washington, Adams, Jefferson, Madison, Franklin, and other important Founders; traces the key issues of the day and shows how they dealt with them; and in the process details the Founders' deep faith, commitment to the cause of independence, impeccable character, and visionary political ideals.\n\nEven better, The Politically Incorrect Guide to the Founding Fathers proves that the Founders had a better understanding of the problems we face today than do our own hopelessly liberal and painfully self-serving members of Congress. McClanahan shows that if you want real and relevant insights into the issues of banking, war powers, executive authority, freedom of the press, freedom of speech, freedom of religion, states' rights, gun control, judicial activism, trade, and taxes, you'd be better served reading the Founders than you would be watching congressional debates on C-SPAN or reading the New York Times.\n\nThat makes The Politically Incorrect Guide to the Founding Fathers much more than simply a restoration of a bit of our patrimony, reconnecting us with the greatest political thinkers in our history--as urgently needed as that is. McClanahan shows that it was from their debates--and their bedrock conservative principles--that we secured our liberty. He argues that only by understanding their principles will we be able to keep the freedom that Americans have cherished for generations. That makes this a vital guide to restoring a sane, sober, Constitutional sense of responsibility to today's public debates.\n","torrent":{"xt":"urn:btih:f320121f74897f827655c7d2c380f9a9de0fad8a","amp;dn":"The+Politically+Incorrect+Guide+To+The+Founding+Fathers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f320121f74897f827655c7d2c380f9a9de0fad8a","infoHashBuffer":{"type":"Buffer","data":[243,32,18,31,116,137,127,130,118,85,199,210,195,128,249,169,222,15,173,138]},"announce":[],"urlList":[]}}