{"title":"The Myth of Monogamy","uid":5222054,"size":24764714,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f41e622ea4c87e4311b3dafde3f4c7f3af536d97&amp;dn=The+Myth+of+Monogamy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SupaFant","files":-1,"time":1260970783,"description":"Amazon.com Review\n\nShattering deeply held beliefs about sexual relationships in humans and other animals, The Myth of Monogamy is a much needed treatment of a sensitive issue. Written by the husband and wife team of behavioral scientist David P. Barash and psychiatrist Judith Eve Lipton, it glows with wit and warmth even as it explores decades of research undermining traditional precepts of mating rituals. Evidence from genetic testing has been devastating to those seeking monogamy in the animal kingdom; even many birds, long prized as examples of fidelity, turn out to have a high incidence of extra-pair couplings. Furthermore, now that researchers have turned their attention to female sexual behavior, they are finding more and more examples of aggressive adultery-seeking in &quot;the fairer sex.&quot; Writing about humans in the context of parental involvement, the authors find complexity and humor:\n\n    Baby people are more like baby birds than baby mammals. To be sure, newborn cats and dogs are helpless, but this helplessness doesn't last for long. By contrast, infant Homo sapiens remain helpless for months ... and then they become helpless toddlers! Who in turn graduate to being virtually helpless youngsters. (And then? Clueless adolescents.) So there may be some payoff to women in being mated to a monogamous man, after all. \n\nCareful to separate scientific description from moral prescription, Barash and Lipton still poke a little fun at our conceptions of monogamy and other kinds of relationships as &quot;natural&quot; or &quot;unnatural.&quot; Shoring themselves up against the inevitable charges that their reporting will weaken the institution of marriage, they make sure to note that monogamy works well for most of those who desire it and that one of our uniquely human traits is our ability to overcome biology in some instances. If, as some claim, monogamy has been a tool used by men to assert property rights over women, then perhaps one day The Myth of Monogamy will be seen as a milestone for women's liberation. --Rob Lightner","torrent":{"xt":"urn:btih:f41e622ea4c87e4311b3dafde3f4c7f3af536d97","amp;dn":"The+Myth+of+Monogamy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f41e622ea4c87e4311b3dafde3f4c7f3af536d97","infoHashBuffer":{"type":"Buffer","data":[244,30,98,46,164,200,126,67,17,179,218,253,227,244,199,243,175,83,109,151]},"announce":[],"urlList":[]}}