{"title":"08.12.04.Chessmaster 10th Edition-VENGEANCE","uid":3231139,"size":1865186175,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f431a47dbf33f572dc41c2412603feabf2ae1dee&amp;dn=08.12.04.Chessmaster+10th+Edition-VENGEANCE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ABZeta99","files":134,"time":1092384994,"description":"PC-Spel: Chessmaster 10th Edition (c) UBI Soft By VENGEANCE\n\nRelease Notes:\n\nMore than ever, Chessmater 10th Edition delivers on its promise to make \nyou a better chess player. The program will improve your game regardless \nof your level of experience. This landmark edition provides the largest \nupgrade ever to the features and graphics of the franchise. Whether you \nare new to Chess or a tournament-level player, Chessmaster 10th Edition \nallows you to master history's greatest game. \n* The new Chessmaster Academy. \nAt the Academy, International Master Josh Waitzkin will personally walk \nplayers through the basics of chess, plus introduce a variety of simple \nstrategies for dominating your opponent. The Academy also features the \nbest attacking moves as taught by noted chess champion, Larry \nChristiansen. \n   \n* A totally revised interface. \nClean, clear and easy-to-navigate, this all new interface represents the \nbiggest upgrade to the look and feel of Chessmaster in over seven years. \n   \n* Full-featured online chess module. \nMore than just a place to play chess live with other players, \nChessmaster online allows players to establish rankings, create \ntournaments, utilize teaching tools, and join a thriving chess \ncommunity. \n   \n* More fun for the whole family. \nFeatures such as, animated chess sets, a variety of whimsical 3D sets, \nand simple and efficient learning tools, makes chess more fun than ever. \nYounger players and chess beginners will appreciate the specialized \nsection just for them. As players improve, the game suggests an \nappropriate AI opponent. \n   \n* A comprehensive chess engine. \nWise enough to teach an absolute beginner and powerful enough to defeat \na grandmaster, experience the all-new edition of the King engine - the \nbrains behind the best-selling brand in chess. \n   \n* Intermediate and advanced player options. \nSeasoned chess players can test their skills against ranked AI \nopponents, set up tournaments and simultaneous exhibitions, and survey \ntheir performances using the new statistics system. \n\nHemsida: http://chessmaster10.ubi.com/us/","torrent":{"xt":"urn:btih:f431a47dbf33f572dc41c2412603feabf2ae1dee","amp;dn":"08.12.04.Chessmaster+10th+Edition-VENGEANCE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f431a47dbf33f572dc41c2412603feabf2ae1dee","infoHashBuffer":{"type":"Buffer","data":[244,49,164,125,191,51,245,114,220,65,194,65,38,3,254,171,242,174,29,238]},"announce":[],"urlList":[]}}