{"title":"Bandwidth Monitor","uid":7685282,"size":1325037,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f4a9b32cd1692807178a9b456192fcfb3f51719e&amp;dn=Bandwidth+Monitor&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sab3awi","files":1,"time":1348930346,"description":"Bandwidth Monitor monitors bandwidth usages through computer it's installed on. The software displays real-time download and upload speeds in graphical and numerical forms (refer to screen shot below), logs bandwidth usages, and provides daily, weekly and monthly bandwidth usage reports. Bandwidth Monitor monitors all network connections on a computer, such as LAN network connection, Internet network connection, and VPN connection.\n\nBandwidth Monitor also offers useful built-in utilities: speeds stopwatch, transfer rates recorder, and bandwidth usage notification. And, the software supports running as a system service that monitors bandwidth usages and generate traffic reports automatically without log on.\n\nBandwidth Monitor works with the majority network connections including modem, ISDN, DSL, ADSL, cable modem, Ethernet cards, wireless, VPN, and more. It's full compatible with Windows 98, Windows Me, Windows NT 4.0, Windows 2000, Windows XP, Windows 2003, Windows Vista, and Windows 7.\n\n\n\n*Bandwidth Monitor detects network connections on computer it's installed on and monitors bandwidth through the connections\n\n*Display real-time download and upload speeds, and logs to history\n    \n*You can view bandwidth usages reports by daily, weekly, monthly, and total in the software\n    \n*The software notifies you to avoid going over bandwidth caps.\n\n","torrent":{"xt":"urn:btih:f4a9b32cd1692807178a9b456192fcfb3f51719e","amp;dn":"Bandwidth+Monitor","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f4a9b32cd1692807178a9b456192fcfb3f51719e","infoHashBuffer":{"type":"Buffer","data":[244,169,179,44,209,105,40,7,23,138,155,69,97,146,252,251,63,81,113,158]},"announce":[],"urlList":[]}}