{"title":"Alexis Burgess - Truth [2011][A]","uid":10426277,"size":2634268,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f4f4534f001e5f86f431ce282117346ef32fc14a&amp;dn=Alexis+Burgess+-+Truth+%5B2011%5D%5BA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anette14","files":-1,"time":1403709988,"description":"Description\nProduct Details\nBook Title: Truth (Princeton Foundations of Contemporary Philosophy)\t\nBook Author: Alexis G. Burgess (Author), John P. Burgess (Author)\nSeries: Princeton Foundations of Contemporary Philosophy\nHardcover: 176 pages\nPublisher: Princeton University Press; 1ST edition (March 20, 2011)\nLanguage: English\nISBN-10: 069114401X\nISBN-13: 978-0691144016\n\n===================================================================================\nBook Description\nPublication Date: March 20, 2011\nThis is a concise introduction to current philosophical debates about truth. Combining philosophical and technical material, the book is organized around, but not limited to, the view known as deflationism. In clear language, Burgess and Burgess cover a wide range of issues, including the nature of truth, the status of truth-value gaps, the relationship between truth and meaning, relativism and pluralism about truth, and semantic paradoxes from Alfred Tarski to Saul Kripke and beyond. The book provides a rich picture of contemporary philosophical theorizing about truth, one that will be essential reading for philosophy students as well as philosophers specializing in other areas.\n\n===================================================================================\nReviews\n&quot;Truth is remarkably succinct. . . . Yet it covers a great amount of ground with accessible discussions of a variety of topics. . . . Intelligent and provocative.&quot;--Michael P. Lynch, Notre Dame Philosophical Reviews\n\n&quot;Burgess and Burgess's book will be widely praised for wielding together the current approaches to truth and to paradoxes, without ceasing to be essentially introductory. Surely, this is an important achievement.&quot;--Andreas Karitzis, Metascience\n\n===================================================================================\nFrom the Back Cover\n&quot;Surveying an important and much-discussed field, and balancing the nature and logic-and-paradox sides of truth in an easy-to-grasp fashion, this book is a major achievement. It is easily the best first step into truth studies available, but also an excellent short review for experts. It is difficult to write clearly and convey serious ideas about truth to nonspecialists, but the authors have somehow pulled it off.&quot;--JC Beall, University of Connecticut\n\n&quot;This is a lively and well-written book by authors who know the field well and explain difficult ideas clearly and efficiently.&quot;--Matti Eklund, Cornell University\n\n===================================================================================\nAbout the Author\nAlexis G. Burgess is assistant professor of philosophy at Stanford University. John P. Burgess is the John N. Woodhull Professor of Philosophy at Princeton University. His books include &quot;Philosophical Logic&quot; and &quot;Fixing Frege&quot; (both Princeton).\n===================================================================================","torrent":{"xt":"urn:btih:f4f4534f001e5f86f431ce282117346ef32fc14a","amp;dn":"Alexis+Burgess+-+Truth+%5B2011%5D%5BA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f4f4534f001e5f86f431ce282117346ef32fc14a","infoHashBuffer":{"type":"Buffer","data":[244,244,83,79,0,30,95,134,244,49,206,40,33,23,52,110,243,47,193,74]},"announce":[],"urlList":[]}}