{"title":"Havok - Point Of No Return (EP)  MP3   320k   ak6103","uid":10666408,"size":49706396,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f511ebff5bad791fdc21c32efe4ab7572d847f04&amp;dn=Havok+-+Point+Of+No+Return+%28EP%29++MP3+++320k+++ak6103&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"analogkid6103","files":4,"time":1406807533,"description":"Havok - Point Of No Return (EP)  MP3   320k   ak6103 What we got Havok  I keep posting these guys cause I like the noise they make so heres the words...Havok is an American thrash metal band from Denver, Colorado. Formed in 2004, their members currently consist of David Sanchez (Vocals/guitars), Mike Leon (Bass), Pete Webber (Drums), and Reece Scruggs (Lead guitar). Since signing with England's Candlelight Records, Havok have released three studio albums: 2009's Burn, 2011's critically acclaimed Time Is Up, and 2013's Unnatural Selection.\nHistory\n\nDavid Sanchez's love of thrash metal greats, like Metallica, Megadeth, Sepultura and Slayer, led him to form Havok with classmate and drummer, Haakon Sjoegren. The duo searched for a lead guitarist by putting up fliers around the Denver area, and local guitarist Shawn Chavez joined the band. Eventually, they rounded out their first lineup with Marcus Corich on bass, and in 2004, Havok recorded their first demo, &quot;Thrash Can&quot;. In 2005, they self released another EP, &quot;Murder by Metal&quot;. By 2007 Tyler Cantrell had taken up the role as bassist, and Rich Tice on drums. On September 19, with this new line-up in place, Havok released their first self-released EP, &quot;Pwn 'Em All&quot;. Tyler's brother Justin Cantrell, also a bassist, replaced him for several tours in support of the EP.\n\nIn December 2007, Havok, having just hired drummer Ryan Bloom that fall, sent a copy of their EP and a press kit to any metal label they could find. The EP had caught the ear of English extreme metal label, Candlelight Records, and soon after the band agreed to join them. Havok hired new bassist Jesse De Los Santos in the fall of 2008. On June 2, 2009 Havok released their full length debut, Burn.However, Ryan Bloom left the band in April, before the release of &quot;Burn&quot;. To replace him, they briefly went on the road with Scott Fuller but they eventually hired Pete Webber as the full-time drummer. Burn was received quite well in the metal community, but it did not yet break them into the global metal scene. The band was set to begin touring with Primal Fear on May 20, 2010 at New York's Gramercy Theater, but guitarist Shawn Chavez quit the band the same day. Instead of jumping ship, Sanchez took up learning all the solos, and Havok toured as a trio. In September 2010, Winchester, VA shredder Reece Scruggs joined the band as their new lead guitarist. Havok returned to the studio to record their sophomore effort. On March 29, 2011 Havok released &quot;Time Is Up&quot;. &quot;Time Is Up&quot; spread through the metal community, receiving strong reviews from critics and fans alike. It became a defining album in what has come to be known as the New Wave of Thrash Metal scene. The success of &quot;Time Is Up&quot; has led the band to major tours opening for bands like Thrash Metal veterans Forbidden, alongside Revocation and White Wizzard; as well as tours opening for Sepultura, Death Angel, Anthrax, The English Dogs, The Casualties, Goatwhore, 3 Inches of Blood, Skeletonwitch, and Exhumed. 2012 was wrapped up for the band by playing the first Barge to Hell cruise featuring bands At the Gates, Behemoth, Mayhem, Possessed, Exodus, and Sacred Reich to name a few.\n\nAfter over a year of heavy touring, Havok returned home to Denver with plans to record their next album. Havok was invited to open for Testament's 'Dark Roots of Thrash' tour at their Denver show after Overkill was forced to drop from the tour due to singer Bobby &quot;Blitz&quot; Ellsworth falling ill. Fans were introduced to Havok's new bassist, Mike Leon(previously of Tampa, FL metallers The Absence), after Jesse left the band to spend time with family. Havok began recording their newest album in the spring of 2013. &quot;Unnatural Selection&quot; was released on June 25, 2013. Shortly after the release, the band went to Bogota, Colombia to play the Rock Al Parque festival, playing to an estimated 45,000 people. The festival also included Cannibal Corpse and Symphony X. The band is to set out on a 50 plus day headline tour to support &quot;Unnatural Selection&quot; with dates that lead up to the Montreal, Canada festival Heavy MTL on August 11.\n\nThe band's third album Unnatural Selection was released 25 June and in its first week charted on the Billboard top 200 at #154 selling over 2,500 copies compared to there last release Time Is Up that just sold over 700 copies .Also charting on the Billboard independent album chart at 44# and 3# on the Billboard Heatseeker album chart. According to an interview with Singer/Guitarist David Sanchez Unnatural Selection will be the band's last release on Candlelight Records. The band is moving on from Candlelight Records in order to broaden their horizons with a larger label. On July 11, the band announced that they have signed with Century Media Records.\nThese guys are good and so.....","torrent":{"xt":"urn:btih:f511ebff5bad791fdc21c32efe4ab7572d847f04","amp;dn":"Havok+-+Point+Of+No+Return+%28EP%29++MP3+++320k+++ak6103","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f511ebff5bad791fdc21c32efe4ab7572d847f04","infoHashBuffer":{"type":"Buffer","data":[245,17,235,255,91,173,121,31,220,33,195,46,254,74,183,87,45,132,127,4]},"announce":[],"urlList":[]}}