{"title":"Andrew Hill - 2006 - Solo - Mosaic Select 23 FLAC","uid":8867493,"size":757570878,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f52c473b13346b67b123a2e4573a09aa3d63f787&amp;dn=Andrew+Hill+-+2006+-+Solo+-+Mosaic+Select+23+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eika256","files":-1,"time":1377961183,"description":"Andrew Hill - 2006 - Solo - Mosaic Select 23\n\nMosaic Select presents a limited edition containing all of the solo piano recordings made by Andrew Hill at the Fantasy studios in Berkeley, CA during August and October 1978. Only a fraction of this material -- the first two titles on the third disc -- had ever seen the light of day prior to this collection's release in the spring of 2007. Having operated throughout the '60s as an innovative composer, pianist and bandleader, Hill spent the first half of the following decade exercising his creativity by composing and instructing at Colgate University in Hamilton, NY, performing internationally, and making records for Freedom, East Wind and Steeplechase. In 1976 he moved to San Francisco with his wife, composer and organist Laverne Hill. The move was motivated by the fact that Laverne had recently learned that she was afflicted with an incurable ailment that would eventually deprive her of her life. Needing more peace and quiet than San Francisco offered, the Hills settled in Pittsburg, a small town east of Oakland. The music on this compilation is very personal, peaceful, ruminative and intimate. It was recorded during a time when Andrew Hill was performing regularly not too far from home, usually as a soloist in spaces better suited for the presentation of chamber music rather than in night clubs. &quot;From California with Love&quot; and &quot;Reverend Du Bop&quot; appeared on Artists House LP AH9, &quot;From California with Love&quot; was released in 1979. All of the rest of this music -- more than two hours of additional solo piano improvisations -- languished in Hawaii until the people behind Mosaic unearthed it and Michael Cuscuna produced this beautiful three-disc set. Readied for release during the summer of 2006, it was made available to the public in a limited edition only weeks after the passing of Andrew Hill in April 2007. (AllMusic)\n\nTrakc list:\nCD 1\n01 - Moonlit Monterey\n02 - 17 Mile Drive\n03 - Gone With The Wind\n04 - I Remember Clifford\n05 - Moonlit Monterey (Alt Take)\nCD 2\n01 - California Tinge\n02 - Napa Valley Twilight\n03 - Above Big Sur\n04 - An Afternoon In Berkeley\n05 - California Tinge (First Version)\nCD 3\n01 - From California With Love\n02 - Reverend Du Bop\n03 - Pastoral Pittsburg\n04 - Pittsburg Impasse\n\nSplit with Medieval.\nEnjoy and share!","torrent":{"xt":"urn:btih:f52c473b13346b67b123a2e4573a09aa3d63f787","amp;dn":"Andrew+Hill+-+2006+-+Solo+-+Mosaic+Select+23+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f52c473b13346b67b123a2e4573a09aa3d63f787","infoHashBuffer":{"type":"Buffer","data":[245,44,71,59,19,52,107,103,177,35,162,228,87,58,9,170,61,99,247,135]},"announce":[],"urlList":[]}}