{"title":"Joyce Carol Oates - You Must Remember This (pdf)","uid":11225254,"size":3471965,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f5a92b94884f332eb0103bdfadf7f373b1d82949&amp;dn=Joyce+Carol+Oates+-+You+Must+Remember+This+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pharmakate","files":-1,"time":1413428950,"description":"Joyce Carol Oates - You Must Remember This (Dutton, 1987). 436 pp.\n\nImproved version of an older scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc. Many thanks to the original scanner.\n\n\ndescription:\n\nJoyce Carol Oates's epic novel of an American family in the 1950's probes the tender division between the permissible and the forbidden, between ordinary life and the secret places of the heart.\n\nSet in an industrial, working-class town in upstate New York, this book chronicles the frustrating marriage of parents Lyle and Hannah; the idealistic political journey of son Warren, and the passionate, obsessive relationship that develops between 15-year-old Enid Maria and her uncle Felix, a professional boxer twice her age.\n\nWhile brilliantly re-creating a decade that worshiped conformity, &quot;You Must Remember This&quot; presents the lives of family members that break every convention in the search for meaning and fulfillment.\n\n\nreviews: \n\nProlific writer Oates demonstrates awesome talent in her new novel, a family saga, set against the backdrop of conservatism that marked America in the 1950s. Through the actions of Lyle Stevick and his family, Oates creates a vivid portrait of bewildered, inarticulate people pushed against the narrow boundaries of their era by their emotions. Lyle is a man of small failures and smaller successes, a dealer in used furniture whose marriage is a continual reminder of one moment's misspent passion. He regards his brother Felix, a boxer, with cynicism born of envy. Lyle loves his children, but clearly does not know them. He is blind to his daughter Enid's affair with the virile Felix. Oates is not easy on her characters. She moves them through McCarthyism, backyard fallout shelters and illegal abortions, slapping them with harsh reflections of their weaknesses. Fully developed, they are described in language that is both elegant and gritty. The scenes between Enid and Felix add a pulsing, sensate eroticism. Infused with narrative energy, this is one of Oates's strongest books in many seasons.--Publisher's Weekly\n\n&quot;An American masterpiece . . . Oates' sprawling novel is the definitive history of an era.&quot;--James Atlas, Vanity Fair\n\n&quot;A fierce vision of America during the 1950s . . . in powerful, meticulous prose.&quot;--New York Times\n\n-----\n\nMuch more Oates from workerbee here: &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/11157110&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/11157110&lt;/a&gt;","torrent":{"xt":"urn:btih:f5a92b94884f332eb0103bdfadf7f373b1d82949","amp;dn":"Joyce+Carol+Oates+-+You+Must+Remember+This+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5a92b94884f332eb0103bdfadf7f373b1d82949","infoHashBuffer":{"type":"Buffer","data":[245,169,43,148,136,79,51,46,176,16,59,223,173,247,243,115,177,216,41,73]},"announce":[],"urlList":[]}}