{"title":"James Wood - The Fun Stuff and Other Essays (2012)","uid":8453798,"size":474531,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f5c94cd41840a774b2e42fb3137e43a65641db88&amp;dn=James+Wood+-+The+Fun+Stuff+and+Other+Essays+%282012%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"workerbee","files":-1,"time":1368062661,"description":"James Wood - The Fun Stuff and Other Essays (Farrar, Straus and Giroux, 2012).\n\nISBN: 9780374159566 | 352 pages | EPUB\n\n\nFollowing &quot;The Broken Estate&quot;, &quot;The Irresponsible Self&quot;, and &quot;How Fiction Works&quot; -- books that established James Wood as a leading critic of his generation -- &quot;The Fun Stuff&quot; confirms Wood's preeminence, not only as a discerning judge but also as an appreciator of the contemporary novel. In twenty-three passionate, sparkling dispatches -- that range over such crucial writers as Thomas Hardy, Leon Tolstoy, Edmund Wilson, and Mikhail Lermontov -- Wood offers a panoramic look at the modern novel. He effortlessly connects his encyclopedic, passionate understanding of the literary canon with an equally in-depth analysis of the most important authors writing today, including Cormac McCarthy, Lydia Davis, Aleksandar Hemon, and Michel Houellebecq.\n\nIncluded in &quot;The Fun Stuff&quot; are the title essay on Keith Moon and the lost joys of drumming -- which was a finalist for last year's National Magazine Awards -- as well as Wood's essay on George Orwell, which Christopher Hitchens selected for the Best American Essays 2010. &quot;The Fun Stuff&quot; is indispensable reading for anyone who cares about contemporary literature.\n\nJames Wood is a staff writer at &quot;The New Yorker&quot; and a visiting lecturer at Harvard University.\n\n\nReviews\n\n&quot;Wood is one of the best readers writing today. Devouring these pieces back to back feels like having a long conversation about books with your most erudite, articulate, and excitable friend. To read his essays on the works of Norman Rush, Aleksandar Hemon, Leo Tolstoy, or Lydia Davis is to relive the specific brand of joy created by a particular work of genius. Wood's reviews are never just evaluations; more often they are passionate, sensitive discourses on the variations of authorial voice, the nature of memory, or the burden of biography... Wood's veneration of virtuosity reminds why we're reading at all--because we still believe that it's possible to find transcendence in great art. Isn't it fun to think so?&quot; -- Publishers Weekly\n\n&quot;Wood is now unquestionably one of the most influential voices in contemporary literary criticism.&quot; -- The Millions\n\n&quot;Literary criticism sometimes takes itself too seriously, so it's a pleasure to see that preeminent literary critic Wood's very title reminds us what literature is really about: fun. Here he offers his heartfelt views on writers ranging from Thomas Hardy, Leo Tolstoy, and Mikhail Lermontov to Cormac McCarthy, Lydia Davis, and Michel Houellebecq... Get ready for some bracing delights.&quot; -- Barbara Hoffert, Library Journal\n","torrent":{"xt":"urn:btih:f5c94cd41840a774b2e42fb3137e43a65641db88","amp;dn":"James+Wood+-+The+Fun+Stuff+and+Other+Essays+%282012%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5c94cd41840a774b2e42fb3137e43a65641db88","infoHashBuffer":{"type":"Buffer","data":[245,201,76,212,24,64,167,116,178,228,47,179,19,126,67,166,86,65,219,136]},"announce":[],"urlList":[]}}