{"title":"Bashar - Saturn's Day, The Council of Nine","uid":8655529,"size":2161474852,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:f5d02c193ccd45d3da9783d43ce3d771289ea908&amp;dn=Bashar+-+Saturn%27s+Day%2C+The+Council+of+Nine&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Rus099","files":2,"time":1373209029,"description":"&quot;Saturn's Day, The Council of Nine&quot;\nJune 14, 2013 - Los Angeles, CA\n\n\nSaturn's energetic relationship to Earth and what the Council of Nine symbolizes in our spiritual journey of enlightenment. Q&amp;A includes: Will we lose our uniqueness when we evolve into hybrid races? I am finding a lot of pain involved in letting go of old concepts. How do I get to the bottom of how the struggle is benefiting me? How can I enhance my career and/or my mission on this planet? When I shift through parallel realities, does it have another streaming individuated consciousness in it? Is there a message from the Council of Nine for me? What is the reason behind my recurring ankle injuries? Could you explain more about the contraction crystal spiral? Why am I not excited about my new career? Will I miss something if I chose the wrong thing in following my excitement? Will I miss something if I chose the wrong thing in following my excitement? Could you tell us more about the concept of vectors and the symbology of 90 degree angles? Am I doing the right thing raising my three year old boy? Can the Council of Nine lower their vibration to a quasi physical state?","torrent":{"xt":"urn:btih:f5d02c193ccd45d3da9783d43ce3d771289ea908","amp;dn":"Bashar+-+Saturn%27s+Day%2C+The+Council+of+Nine","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5d02c193ccd45d3da9783d43ce3d771289ea908","infoHashBuffer":{"type":"Buffer","data":[245,208,44,25,60,205,69,211,218,151,131,212,60,227,215,113,40,158,169,8]},"announce":[],"urlList":[]}}