{"title":"Osho_The Last Testament_Vol.3-11_world-press -about Sheela","uid":13903527,"size":674366815,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:f69af9de2cb3968d0ec7eb3c337527143a0449c6&amp;dn=Osho_The+Last+Testament_Vol.3-11_world-press+-about+Sheela&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"drugarica","files":1,"time":1458265751,"description":"\n1 October 1985 pm in Sanai Grove, Oregon\r\nOsho_The Last Testament vol3-11\r\n\r\nVery interesting interview with 2 journalists\r\n\r\nPETER WEISSBACH, CJOR RADIO, VANCOUVER;(part1) \r\n AND\r\nMIKE ZIELENZINGER, KNIGHT RIDDER, NEWSPAPERS (part2)\r\n\r\n\r\n........................................\r\nQ:* SO THOSE TWENTY PEOPLE ARE THE ONLY ONES THAT WERE INVOLVED IN THIS MASSIVE PLOT OF WIRETAPPING AND...\r\n\r\nA:* Yes. Only small things other people have done, which are absolutely innocent, because they know nothing about it. If they were told to dig a ditch in which they were going to bug a house... these people had no idea what they are going to do. They don't know anything about wires and electricity, and which wire is electricity wire and which wire is just a bugging device, so they simply dig the ditch. So they have supported in a way, but they are absolutely innocent. The people who knew what they are doing, the people who invented the whole bugging system -- and they invented a bugging system, even FBI has accepted that it was far more sophisticated than used by Nixon.\r\nSo all those people have gone with Sheela. Only one person had the courage to come back from the middle journey.\r\n\r\nQ:* WHO WAS THAT?\r\n\r\nA:* One sannyasin, Ava. And she is going to reveal everything about the whole group, because she was the most intimate in the group, and she knows about everything that has happened.\r\n\r\nQ:* IS SHE THE ONE THAT TOLD YOU OF THE MURDER PLOTS?\r\n\r\nA:* No.\r\n\r\nQ:* HAVE YOU BEEN INTERVIEWED YET, BHAGWAN, BY THE FBI OR THE OREGON STATE POLICE?\r\n\r\nA:* They seem to be afraid of me. Four times they have, on my request -- they have not requested me for an interview, I have requested on the contrary. Four times they made the arrangement and cancelled at the last moment.\r\n\r\nQ:* ISN'T THAT ONE OF YOUR CONDITIONS THAT THE PRESS BE PRESENT DURING THAT INTERVIEW?\r\n\r\nA:* That was only at the last time. When on the fourth time they cancelled, I said, &quot;Now, this is too much. I am requesting you, in spite you requesting me, and you go on cancelling, so what is cooking behind it? Why are you afraid of me?&quot;\r\nSo I had told them, that &quot;Now, a fourth time you cancel it, then I am going to call a press conference and tell everything to the press conference. You are trying to hide something. It seems there is a conspiracy against the commune, by the governor and the attorney general both, to protect the criminals who have escaped and somehow involve the innocent people. They are trying to arrest one thousand sannyasins who has nothing to do with all those crimes, but just to disrupt the whole community.\r\n\r\nQ:* THERE'S A RUMOR AROUND THAT THE NATIONAL GUARD IS BEING MOBILIZED IN MADRAS.\r\n\r\nA:* Yes, they are keeping National Guard on alert, and mobilizing it in Madras.\r\n\r\nQ:* HOW DO YOU KNOW THAT?\r\n\r\nA:* Yes, I know it. I have heard about it. The governor is thinking of declaring a state of emergency in Rajneeshpuram where everything is peaceful and no emergency is needed. Our sannyasins are going to the police on their own accord and revealing whatsoever they know about.\r\n\r\nQ:* THERE'S ALSO RUMOR THAT YOU'RE TO BE ARRESTED TOMORROW.\r\n\r\nA:* Yes. That I have heard.\r\n\r\nQ:* HOW WOULD YOU HANDLE THAT? WOULD YOU....\r\n\r\nA:* I would enjoy it.\r\n\r\nQ:* WHY WOULD YOU ENJOY IT?\r\n\r\nA:* Because that is the only experience in my life which is missing and this is my last life! I'm not going back again. I will not be having another life again. So I would like to have that experience too....\r\n&quot;\r\nRead all here","torrent":{"xt":"urn:btih:f69af9de2cb3968d0ec7eb3c337527143a0449c6","amp;dn":"Osho_The+Last+Testament_Vol.3-11_world-press+-about+Sheela","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f69af9de2cb3968d0ec7eb3c337527143a0449c6","infoHashBuffer":{"type":"Buffer","data":[246,154,249,222,44,179,150,141,14,199,235,60,51,117,39,20,58,4,73,198]},"announce":[],"urlList":[]}}