{"title":"THE AMERICAN (1987-1992) (Dark Horse) needs some fills","uid":9489825,"size":274376756,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:f72b3a8ec85e88ae159474c8c503fc704c92d076&amp;dn=THE+AMERICAN+%281987-1992%29+%28Dark+Horse%29+needs+some+fills&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"STFmaryville","files":-1,"time":1389976282,"description":"By request.\n\nI've looked around off-and-on for well over a week, but I'll be damned if anyone ever scanned The American, a critically-acclaimed Dark Horse comic that ran 8 issues from 1987-1988 or so. Here in this torrent you'll find the trade of the first story arc of that series, the follow-up The American Special and The American: Lost in America miniseries from 1992, and a couple of short stories from anthologies.\n\nThe whole series was collected several years ago by Dark Horse in a trade paperback. Scan groups who read this, please consider giving it the special treatment!\n\nPlease seed &amp; share these.  --STF\n\n-------\n\nA review of the omnibus-style trade, from Amazon:\n\n&quot;The American: &quot;They needed a hero for America to rally around. They needed a killer to handle their dirty work. They created me.&quot;\n\nHe's been around since the 1950s, has the American - a supersoldier who puts out fires for the government and who walks around in a costume celebrating the Old Glory. The American has superstrength, never seems to age, is always resolute, and, for many generations now, has been a patriotic inspiration for our country, the embodiment of the American ideals.\n\nBut cut to the present: In Beirut, the American is riddled with bullets as he attempts to save hostages, one of whom is a little boy.\n\nSurprisingly, a day later, the American, alive and well, puts in a rare public appearance, this shocking the same boy so much he suffers a fatal heart attack. Not too long after, the American is the guest at a school dedication when he's promptly blown up by a terrorist. The day after that, the American holds another press conference, once again dispelling rumors of his demise.\n\nSo what's his secret? Is it invincibility? Immortality? Or is there something else going on? Dogged and boozy newspaper reporter Dennis Hough, on the verge of being fired, sets his eyes on accomplishing what no one's yet been able to do: uncover the real story behind the American. But the American's secrets won't be easily disclosed.\n\nSPOILERS next.\n\nThe weight of a powerful government agency falls on Hough like a ton of bricks even as his journalistic probes begin to unearth some very disturbing truths, truths involving a decades-long cover-up, an expert special effects crew who can fake super powers, and hundreds of specially-trained suicide commandos who undergo surgical reconstruction and voice alteration (you see where this is going?). Hough gets unexpected help from a rogue American, who tires of the party line, and from Kid America, a former sidekick now grown grizzled and grumpy but still walking around partly in superhero gear. Even more startling, an ex-president joins the fray. But is that enough to out the truth? And if the truth comes out, how will the public react? Maybe some lies are better off kept in the dark. But Hough is a newspaperman, and a story is a story.\n\nSPOILERS end.\n\nSome fun facts on this guy, Mark Verheiden: Nowadays Verheiden is doing it big as a Hollywood muck-a-muck. He's the co-executive producer/writer for SMALLVILLE and the Sci-Fi Channel's BATTLESTAR GALACTICA. He's been a screenwriter for THE MASK and TIMECOP (the TV series). But fans of independent comic books might know him best as the creator/writer of THE AMERICAN, a title which came out in 1987 under the Dark Horse Comics banner. THE AMERICAN was well thought of during its sporadically released run, but then it quietly went off into obscurity. Except I never quite forgot it.\n\nTHE AMERICAN, coming in the wake of Alan Moore's dark and gritty WATCHMEN, offers its own deconstruction of the superhero as it takes and upends the venerable Captain America mythos. Verheiden has admitted that THE AMERICAN was inspired in large part by the shady actions of the Reagan administration, specifically the Iran/Contra scandal. And, in fact, the federal government has much to do with being at the root of the web of lies surrounding the American. Verheiden's plotting, hard-boiled and laced with cynicism at our governing institution, has relevance even today as his characters play out their morally ambiguous roles. Verheiden uses Hough and the American to explore the steady fracturing of our belief system. In Verheiden's story, the superhero is a lie, and the superhero ideals, a travesty. Residing in a reality closely mirroring ours, the American, when finally shed of his illusions, comes off as a bizarre and exotic creature. C'mon, who walks around casually dressed in tights? Verheiden dictates that, in this world, comic books featuring the American have long perpetuated his mystique and kept him firmly imbedded in society's consciousness (there's also a film out there, with Stallone as the American). But society might be distressed to learn that its longtime living symbol is a walking charade trotted out by the government, irregardless of collateral damages, and that this &quot;superhero&quot; is very much consumed with earning product endorsements and merchandizing contracts.\n\nThere are two central characters here, and one supporting character who deserves mention. Verheiden's story is told mainly thru the eyes of reporter Dennis Hough. Hough happens to be a recovering alcoholic who, after the murder of a close friend, falls off the wagon. He's definitely a hard-to-like dude, but I have to admit that his sardonic musings fall in perfect with the comic book's skeptical sensibilities. Then there's the American himself (or, rather, a rogue American), who finally rails against the ongoing deception. This American is a pretty straightforward and idealistic character, Steve Rogers as fleshed out by Verheiden. Kinda boring. But necessary to the series. Meanwhile, the embittered, now middle-aged Kid America pops in and out of the picture, but leaves an impression. And it's pretty funny that he drives the Americar, which is a shabby Pinto. Kid America gets a spotlight look in the story &quot;Dead Wrong&quot; which has him attempting to solve a murder in his tiny hometown against the wishes of the belligerent locals.\n\nThis trade paperback, collecting all the stories featuring the American, comes in at a humongous 368 pages and is broken up into three parts. First there's the entire 8 issue run of THE AMERICAN monthly series. Then we get the short stories from DARK HORSE PRESENTS #32, A1 #3, THE AMERICAN SPECIAL, and DARK HORSE PRESENTS 5TH ANNIVERSARY SPECIAL. Finally, the third segment presents THE AMERICAN: LOST IN AMERICA, comprising of 4 issues. As per the original publications, these reprints are in black and white. Also included is the whimsical essay &quot;The American Before Dark Horse: The Making of a Modern Myth&quot; which chronicles the entire &quot;history&quot; of Watchfob Comics. This is followed by excerpts from The American comic books as published down the years by Watchfob Comics.\n\nThe regular series's first five issues make up the best and most electrifying story arc, as Dennis Hough first sniffs out the fishiness behind the American's razzle dazzle and proceeds to blow the lid off a decades-long sham. The stories which follow range from controversial and thought-provoking to downright bleak and depressing, but they aren't near as fun as the first five issues. Issue #6 is the aforementioned &quot;Dead Wrong.&quot; Verheiden also strives to show the repercussions of the actions taken by the American and Hough. In the 2-part &quot;The Reality&quot; (the final two issues of THE AMERICAN monthly series), the American applies fatal force in preventing a convenience store robbery and comes to regret it. Meanwhile, Hough's alcoholism has him hitting rock bottom even as a sleazy film producer tries to attain the rights to the rogue American's story.\n\nHough and the American, having been thru their respective hells, try to pick up the pieces of their lives. In THE AMERICAN: LOST IN AMERICA, Hough's bout with alcoholism had cost him his self-respect, his job, and his girlfriend. The American is a wreck, bereft of ideals and desperately craving for something to believe in. Hough is offered a gig in the California governor's bid for re-election, but the American is part and parcel of the offer. But the American has vanished, having stumbled onto and brainwashed by a New Age cult, then whisked away to the Oregonian hinterlands. Hough goes after him, and gets caught up in a war between rednecks and the cult. Oh, and he and the American also confront the evil nature of donuts (no, seriously).\n\nSome on the artwork: The first half of THE AMERICAN regular series is illustrated by Chris Warner, who's very good and brings a polished look to these pages. But, then, Grant Miehm takes over and his cruder style lowers the standard. Thankfully, the more dynamic Doug Braithwaite and then Chris Marrinan supplant him in later stories. I wish, though, that Warner had been able to handle all the pencils.\n\nThere's some humor here, mostly dark and delivered by the surly and acerbic Dennis Hough. Bit of a heads up: there's quite a bit of outdated pop culture references dropped in these pages (Boy George, seriously?). But it's not enough to take away from the storytelling.\n\nNo, this isn't your normal comic book. Things aren't etched in black and white. The protagonists may end up doing the right thing, but they're just as flawed as anyone. Hough is a disagreeable and miserable guy, and the American (who can't even remember his real name) totes some serious psychological baggage. Reading their story was an unpleasant thing at times, and even depressing. The writer doesn't at all pull his punches, putting these two thru the wringer. Verheiden meant to craft a dark comic book set in the real world, and, damn if he didn't do just that. It's like that innocuous rock recently overturned, which then exposes the worms and maggots squirming underneath. Yeah, that's kinda like THE AMERICAN.\n\nLastly, Cyber-Ike rocks.&quot;","torrent":{"xt":"urn:btih:f72b3a8ec85e88ae159474c8c503fc704c92d076","amp;dn":"THE+AMERICAN+%281987-1992%29+%28Dark+Horse%29+needs+some+fills","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f72b3a8ec85e88ae159474c8c503fc704c92d076","infoHashBuffer":{"type":"Buffer","data":[247,43,58,142,200,94,136,174,21,148,116,200,197,3,252,112,76,146,208,118]},"announce":[],"urlList":[]}}