{"title":"Live Linux  CDs","uid":8090786,"size":11546132,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f7d37aba3c40c1d14e0603c005f58b48ed7f09f3&amp;dn=Live+Linux++CDs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"d347hBy73","files":-1,"time":1359714407,"description":"Live Linux(R) CDs: Building and Customizing Bootables\n\nPublication Date: November 24, 2006 | Format: PDF \n \nDream the perfect computer system, then build it to run on a Linux live CD!\n \nA Linux live CD is more than just a Linux system you carry around. Start with a live CD that has all your favorite applications. Include and play photo slideshows, presentations, Web content, and music collections. Incorporate your own designs, colors, and images to appear everywhere from the boot prompt to the desktop.\n \nWhen you are done, you have a perfectly customized CD or DVD that can run on almost any PC that you can reboot. In Live Linux CDs, bestselling Linux author Christopher Negus guides you through the free software tools and toys you need to try out and create specialized Linux live CDs for security, presentations, gaming, multimedia, firewalls, and clustering. It is the first start-to-finish guide to using, creating, building, and remastering your own live Linux distributions.\n \nWorking from live CD technology on the accompanying DVD, you can:\n\nBoot and run live Linux versions of KNOPPIX, SLAX, Gentoo, Damn Small Linux, and other live CDs\nBurn and boot Linux live CD ISO images of Ubuntu, KNOPPIX, SLAX, MoviX, BackTrack, and more\nBuild your own live CDs from instructions based on KNOPPIX (Debian), Fedora, Gentoo, Damn Small Linux, and SLAX\nCreate multimedia players that are customized to include your own video or music\nCustomize live CD rescue toolkits to analyze and repair data on compromised networks, Windows PCs, and Linux systems\nConfigure personal firewalls to protect from Internet intruders\nControl the processing power of a group of computers, using live CD clusters\nWhether you want to customize the perfect live Linux for your own use or distribute it to the world, Live LinuxÂ® CDs gives you all the knowledge, tools, and software you need.\n\n ","torrent":{"xt":"urn:btih:f7d37aba3c40c1d14e0603c005f58b48ed7f09f3","amp;dn":"Live+Linux++CDs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7d37aba3c40c1d14e0603c005f58b48ed7f09f3","infoHashBuffer":{"type":"Buffer","data":[247,211,122,186,60,64,193,209,78,6,3,192,5,245,139,72,237,127,9,243]},"announce":[],"urlList":[]}}