{"title":"The Merrymakers - Bubblegun (1997)","uid":6885026,"size":378360348,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f8da92c8b5c15d5d698f7d1613bd3f952fa7258d&amp;dn=The+Merrymakers+-+Bubblegun+%281997%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GenXRock","files":-1,"time":1323795241,"description":"By this point in their career, it seems as if the duo of Anders Hellgren and David Myhr should have four or five acclaimed releases under their belts and be household names in the world of pop music. Bubblegun, however, is only the Merrymakers' second full-length album (and their first in the U.S.), though they have been making unabashedly joyous and pretty pop since 1991. Their first album, No Sleep 'til Famous, brought the comparatively innocent and clear-eyed pop of the '60s into the '90s via a sophisticated and clean production. The band does the same on Bubblegun, crafting a set of songs that sound as if they could all be singles. Undoubtedly, many of them would have been hits in the era from which they glean their influences, but the Merrymakers are not a retro act; they simply write gorgeous, catchy pop songs that are universal, transcending both time and place. Very rarely anymore do choruses explode out of speakers and simply envelop the listener with pure pleasure as do songs such as &quot;Saltwater Drinks,&quot; &quot;Troubled Times&quot; and &quot;Superstar.&quot; The songs, though they are incredibly melodic and crisply produced, are not in the least vapid. There is an edginess to many of the tracks, and lyrically, the Merrymakers do not shy away from difficult themes: &quot;Monkey in the Middle&quot; and &quot;Superstar&quot; deal with fading fame while the theme of lost love is all over the album (&quot;April's Fool,&quot; &quot;Sad,&quot; &quot;Ms. Demeanour&quot;). Never, though, does this cause the music or listening experience to drag or grate. Former Jellyfish frontman Andy Sturmer helps out on production on a few songs (and co-wrote a couple cuts), and he is a perfect match for the band. Since this is the band's first American release, Big Deal has added a bonus to the package: a second CD containing five songs from their first album. Those songs have a slightly more trippy feel to them but shine just as brightly as the songs on the first CD. It makes for a virtually flawless pop album: in a perfect world, Bubblegun would make the Merrymakers a household name.","torrent":{"xt":"urn:btih:f8da92c8b5c15d5d698f7d1613bd3f952fa7258d","amp;dn":"The+Merrymakers+-+Bubblegun+%281997%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8da92c8b5c15d5d698f7d1613bd3f952fa7258d","infoHashBuffer":{"type":"Buffer","data":[248,218,146,200,181,193,93,93,105,143,125,22,19,189,63,149,47,167,37,141]},"announce":[],"urlList":[]}}