{"title":"The Shepherd of the Hills (1941) - Seven Sinners (1940) DVD9 - J","uid":10545065,"size":8386295808,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:f9d7bd0908c9e11fdf4bcb065ceccb8252dfb54e&amp;dn=The+Shepherd+of+the+Hills+%281941%29+-+Seven+Sinners+%281940%29+DVD9+-+J&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"SaM","files":-1,"time":1405276003,"description":"The Shepherd of the Hills (1941) - Seven Sinners (1940) DVD9 - John Wayne Collection [DDR]\n\n\nThe Shepherd of the Hills is a 1941 American drama film starring John Wayne, Betty Field and Harry Carey. The supporting cast includes Beulah Bondi, Ward Bond, Marjorie Main and John Qualen. The picture was Wayne's first film in Technicolor and was based on the novel of the same name by Harold Bell Wright. The director was Henry Hathaway, who directed several other Wayne films including True Grit almost three decades later.\n\n    CAST:-\n    John Wayne as Young Matt\n    Betty Field as Sammy Lane\n    Harry Carey as Daniel Howitt\n    Beulah Bondi as Aunt Mollie\n    James Barton as Old Matt\n    Samuel S. Hinds as Andy Beeler\n    Marjorie Main as Granny Becky\n    Ward Bond as Wash Gibbs\n    Marc Lawrence as Pete\n    John Qualen as Coot Royal\n    Fuzzy Knight as Mr. Palestrom\n    Tom Fadden as Jim Lane\n    Olin Howland as Corky\n    Dorothy Adams as Elvy\n    Virita Campbell as Baby\n    Selmer Jackson as Doctor (uncredited)\n\nDirected by Henry Hathaway\nProduced by Jack Moss\nMusic by Gerard Carbonara\nRunning time 98 minutes\n\nYoung Matt Matthews, an Ozark Mountains moonshiner, hates the father he has never seen, who apparently deserted Matt's mother and left her to die. His obsession contributes to the hatred rampant in the mountains. However, the arrival of a stranger, Daniel Howitt, begins to positively affect the mountain people, who learn to shed their hatred under his gentle influence. Still, Matt does not quite trust Howitt.....\n\nDifferences from the novel\nWhile the novel interposed fiction with portrayals of actual persons residing in the Missouri Ozarks, in the early Branson area, the film departed markedly from the book's presentations. Old Matt, a patriarch, mill owner and influential person within the community, is presented in the film as a doddering fool, henpecked by his wife, Aunt Mollie. In the novel she's a nurturing, kindly, loyal wife and friend, but in this film she is a shrill, nasty moonshiner. The &quot;Shepherd&quot; of the title, a cultured, sympathetic visitor from Chicago who contributes positively to the society he's visiting, in this film is an aging gunfighter with a guarded past and, in total odds with the book, is here Young Matt's (John Wayne's) father, with a shootout perpetrated by &quot;Big John.&quot; Other characters differ as markedly from Wright's novel. Although a good representation of the Ozarks area several decades ago, a decent story in its own right, and good nostalgia, it probably represents as great a departure by a film, versus the novel it is based on, in all motion picture history.\n===========================================================================================================\nSeven Sinners (1940)\n\nSeven Sinners (UK title Cafe of the Seven Sinners) is a 1940 American adventure film starring Marlene Dietrich and John Wayne in the first of three films they made together. \n\n    CAST:-\n    Marlene Dietrich as Bijou Blanche\n    John Wayne as Lt. Dan Brent\n    Albert Dekker as Dr. Martin\n    Broderick Crawford as Edward Patrick 'Little Ned' Finnegan\n    Anna Lee as Dorothy Henderson\n    Mischa Auer as Sasha Mencken\n    Billy Gilbert as Tony\n    Richard Carle as District Officer\n    Samuel S. Hinds as Gov. Harvey Henderson\n    Oskar Homolka as Antro\n    Reginald Denny as Capt. Church\n    Vince Barnett as Bartender\n    Herbert Rawlinson as First Mate\n    James Craig as Ensign\n    William Bakewell as Ens. Judson\n\nDirected by Tay Garnett\nProduced by Joe Pasternak\nRunning time 87 minutes\n\nSYNOPSIS:- Seven Sinners (1940)\nThe film spotlights the controversial life of torch singer Bijou Blanche (Dietrich), who has been kicked off one South Seas island after another. She is accompanied by naval deserter Edward Patrick 'Little Ned' Finnegan (Broderick Crawford) and magician/pickpocket Sasha Mencken (Mischa Auer). Eventually, she meets a handsome, young naval officer, Lt. Dan Brent (Wayne), and the two fall in love. When Brent vows to marry Bijou, his commander and others plead with him to leave her.\n\nBijou, a saloon singer with a reputation for inciting brouhahas, is one of several deportees from a south Pacific island to arrive at another U.S. protectorate, Boni Komba. She becomes very popular with U.S. navy men by performing at the 'Seven Sinners'. A navy Lieutenant is attracted to Bijou despite the Governor's machinations to keep them apart, and the competing affections of local mobster, Antro.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate: 4999 kbps\nVideo Resolution: 720x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec:  AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages: English\nRunTime 185 mins\nSubtitles: None\nRipped by: Trinidad [DDR]\nDuration: 185 mins","torrent":{"xt":"urn:btih:f9d7bd0908c9e11fdf4bcb065ceccb8252dfb54e","amp;dn":"The+Shepherd+of+the+Hills+%281941%29+-+Seven+Sinners+%281940%29+DVD9+-+J","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9d7bd0908c9e11fdf4bcb065ceccb8252dfb54e","infoHashBuffer":{"type":"Buffer","data":[249,215,189,9,8,201,225,31,223,75,203,6,92,236,203,130,82,223,181,78]},"announce":[],"urlList":[]}}