{"title":"[Kung Fu] Wing Chun aka Yong Chun (Nicholas Tse, Sammo Hung,  Yu","uid":3880097,"size":6223839933,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:fa3ff225bb77dabad62a74503e300f5535033ac2&amp;dn=%5BKung+Fu%5D+Wing+Chun+aka+Yong+Chun+%28Nicholas+Tse%2C+Sammo+Hung%2C++Yu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":7,"uploader":"JamesKees","files":48,"time":1194624196,"description":"Wing Chun aka Yong Chun (Nicholas Tse, Sammo Hung,  Yuen Biao, 2007) - Rmvb, Episodes 01-40\n\nAdapted from the 1982 kung fu classic The Prodigal Son, 2007 period drama Wing Chun teams legendary martial arts stars Sammo Hung and Yuen Biao with Hong Kong heartthrob Nicholas Tse. Twenty-five years after they starred in The Prodigal Son, Hung and Yuen now step into the senior roles, passing the baton to Tse, who is quickly emerging as one of the great action stars of his generation. The young actor has already displayed his fighting in films Dragon Tiger Gate and Invisible Target and dramas Big Shot and Proud of Twins, and to prepare for the shooting of this action-packed series, he especially trained with Wing Chun master Guy Lai. Yuen Biao and Sammo Hung unite for their first on-screen collaboration in years, and with the two veterans pillaring the series, Wing Chun is a welcome return to flying kicks and fisticuffs. \nYuen Biao is martial arts master Liang Zan, the same role he played in the The Prodigal Son, but he who was once young and rash is now a respected master and physician, not to mention the father of two sons. Liang Zan must pass on his kung fu skills to the next generation, but his son Liang Bi (Nicholas Tse) is reckless, aimless, and irresponsible, much like him in his youth. Growing up in the chaos of early 1900s China, Liang Bi encounters countless troubles and trials, romance (with Hong Kong actress Rain Li), and a certain playful white-haired kung fu master (Sammo Hung) who teaches him the art of Wing Chun.\n &lt;a href=&quot;\nhttp://global.yesasia.com/en/PrdDept.aspx/code-c/section-videos/pid-1005082335/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://global.yesasia.com/en/PrdDept.aspx/code-c/section-videos/pid-1005082335/&lt;/a&gt;\n\n_________________\nTo Share is to Care! So it seems. Do not break the share chain! Once you have completed download, seed for the next person in the chain as you possibly can. If this torrent link is dead or not well seeded, PM me for a re-seed!\n","torrent":{"xt":"urn:btih:fa3ff225bb77dabad62a74503e300f5535033ac2","amp;dn":"%5BKung+Fu%5D+Wing+Chun+aka+Yong+Chun+%28Nicholas+Tse%2C+Sammo+Hung%2C++Yu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa3ff225bb77dabad62a74503e300f5535033ac2","infoHashBuffer":{"type":"Buffer","data":[250,63,242,37,187,119,218,186,214,42,116,80,62,48,15,85,53,3,58,194]},"announce":[],"urlList":[]}}