{"title":"Indie Classic!: The Jesus and Mary Chain - Honey's Dead [","uid":3974048,"size":81241542,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:fa85e8e30a6a0723ae0c3a94456653535c57436b&amp;dn=Indie+Classic%21%3A+The+Jesus+and+Mary+Chain+-+Honey%5C%27s+Dead+%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tigerduck","files":1,"time":1200160238,"description":"Again working with Alan Moulder but now also using a live drummer on most tracks -- namely Monti from Curve, one of the Mary Chain&amp;#039;s many descendants -- the Reids came back strong with Honey&amp;#039;s Dead, on balance a more consistent and satisfying record than Automatic. There&amp;#039;s a sense of greater creativity with the arrangements, while the balance between blasting static rampage and precise, almost clinical delivery is the finest yet, making the album as a whole the best straight-through listen since Psychocandy. Monti&amp;#039;s drumming finally replaces Bobby Gillespie&amp;#039;s properly; he&amp;#039;s a much more talented musician than the Primal Scream overlord, using the warped funk hits familiar from Curve&amp;#039;s work to the Mary Chain&amp;#039;s advantage. Even the drum machine-driven cuts work better than before, especially the brilliant, coruscating opener, &quot;Reverence.&quot; Burning with some of the best nails-on-chalkboard feedback the band had yet recorded, combined with a whipsmart sharp breakbeat, all it took was the finishing touch of Jim Reid&amp;#039;s sneering lines like &quot;I wanna die like Jesus Christ&quot; to make it another stone-cold classic single from the band. Other winners include &quot;Sugar Ray,&quot; with beats and melody so immediate and addictive the track was actually used for a beer commercial, of all things, and the steady slap and crunch of &quot;Good for My Soul.&quot; If there&amp;#039;s a danger in Honey&amp;#039;s Dead, it&amp;#039;s that the near bottomless pit of reworked melodies and lyrics had almost reached its end -- even the final track, &quot;Frequency,&quot; combines both &quot;Reverence&quot; itself with the Modern Lovers&amp;#039; &quot;Roadrunner&quot; -- which made the stylistic shift on Stoned &amp; Dethroned a logical follow-up. William and Jim Reid split all the vocals almost evenly, the former especially shining on the nearly gentle &quot;Almost Gold,&quot; the closest the record comes to a sweet ballad. -AMG\n\nTracklist:\n1.\tReverence\n2.\tTeenage Lust\n3.\tFar Gone And Out\n4.\tAlmost Gold\n5.\tSugar Ray\n6.\tTumbledown\n7.\tCatchfire\n8.\tGood For My Soul\n9.\tRollercoaster\n10.\tI Can&amp;#039;t Get Enough\n11.\tSundown\n12.\tFrequency\n\nGood music NEVER gets old!\nEnjoy!\n/Duck\t","torrent":{"xt":"urn:btih:fa85e8e30a6a0723ae0c3a94456653535c57436b","amp;dn":"Indie+Classic%21%3A+The+Jesus+and+Mary+Chain+-+Honey%5C%27s+Dead+%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa85e8e30a6a0723ae0c3a94456653535c57436b","infoHashBuffer":{"type":"Buffer","data":[250,133,232,227,10,106,7,35,174,12,58,148,69,102,83,83,92,87,67,107]},"announce":[],"urlList":[]}}