{"title":"The Crowfield Mysteries  -  Pat Walsh   (2 Audiobooks)","uid":6818469,"size":338545797,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:faf9918e347048b03a14d0c2273e095dc0742aa0&amp;dn=The+Crowfield+Mysteries++-++Pat+Walsh+++%282+Audiobooks%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"neil1966hardy","files":15,"time":1321307711,"description":"Unabridged and read by Ric Jerrom. ( 48kbps / 44 kHz Mono CBR Fraunhofer MP3)\n\n\n\n#1. The Crowfield Curse (2010, 7 hours 6 mins) CD.\nSet in England in the winter of 1347. Fourteen-year-old William, whose family perished in a fire 18 months earlier, works as a servant at the local monastery in exchange for his room and board, meager as it is. While gathering firewood, he discovers a creature caught in a trap and saves its life. The hobgoblin tells him that he can only be seen by those with the Sight, a gift the boy did not know he possessed. As the hob recovers from his wounds, Will encounters a mystery that shakes him to his core. There is an angel secretly buried in the nearby woodlands, and a visitor to the abbey, a leper, is determined to find it. For reasons unclear to the boy, Mr. Bone insists that Will help accomplish this goal....\n\n#2 The Crowfield Demon (2011, 8 hours 33 mins) ODCD.\nIt is now March 1348 and a year has passed since the events involving the fallen angel in the woods and the subsequent battle between good and evil. Surely, peace will now reign in this cloistered domain but alas, there is no rest for the wicked given the evil aura which seems to be settling over the church at Crowfield, tainting the inhabitants' thoughts be they awake or asleep. William, Brother Walter, Shadlock and Brother Snail join forces to track down the source of this malevolence and hopefully conquer it. However they cannot do this without drawing on pagan powers such as alchemy - where will it all end? As usual, the rest of the monks look down on William and don't take his warnings seriously - yes, they will regret it! (LT)\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:faf9918e347048b03a14d0c2273e095dc0742aa0","amp;dn":"The+Crowfield+Mysteries++-++Pat+Walsh+++%282+Audiobooks%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"faf9918e347048b03a14d0c2273e095dc0742aa0","infoHashBuffer":{"type":"Buffer","data":[250,249,145,142,52,112,72,176,58,20,208,194,39,62,9,93,192,116,42,160]},"announce":[],"urlList":[]}}