{"title":"ESTECO modeFRONTIER v2014.1-SSQ (x86x64)-=TEAM OS=-","uid":12533155,"size":3094082607,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:fb75a0ef48ccda71f356ceed0b828f930167fb80&amp;dn=ESTECO+modeFRONTIER+v2014.1-SSQ+%28x86x64%29-%3DTEAM+OS%3D-&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"OnlyByTheRain","files":16,"time":1444295904,"description":"[b]ESTECO modeFRONTIER v2014.1-SSQ[/b]\r\n\r\n[img]https://dump.bz/storage-1/1015/StSh3MhaYn3Znm6FTXl0krkT4rbFtR7l.jpg[/img]\r\n\r\n[b]modeFRONTIER - a framework for problem solving and multi-criteria optimization criterion, working with various CAD, CAE, CFD and other software systems. The medium is possible to work in an automatic optimization of the design and manufacturing. Implemented processing and analyzing data using various methods\r\n\r\nMain specifications:\r\nDesign of Experiments (DOE), the population distribution of the input variables, evaluation of forecast accuracy\r\nUser DOE; Random; Sobol; Full factorial; Cubic-face-centered; Taguchi; Box-Benken; Montecarlo; Reduced Factorial; Latin Square; Latin Hypercube;\r\n\r\nD-Optimal; The method of cross-validation (cross validation); Constraint satisfaction problems (constraint satisfaction problem).\r\nDecision making during the multi-criteria optimization (MCDM):\r\nHurwitz criterion (Hurwicz criterion);\r\n\r\nLinear algorithm;\r\nGA algoriphm;\r\nMinimax, savage mimimax regret criterion;\r\nAlgorithms optimization techniques:\r\nDOE Sequence - direct search parameters;\r\nMOGA II - genetic algorithm for multi-criteria optimization;\r\nARMOGA - genetic algorithm based on MOGA;\r\nNSGA II - non-dominated sorting genetic algorithm for multi-criteria optimization;\r\nNASH - algorithm based on the theory of noncooperative games Nash (Nash), for multi-criteria optimization;\r\nB-BFGS - gradient algorithm;\r\nSIMPLEX - search for a solution without the use of derivatives on the Nelder-Mead method;\r\nLevenberg-Marquardt (Levenberg-Marquardt);\r\nSimulated Annealing- hardening modeling algorithm (simulated annealing method);\r\n1P1-ES - evolutionary strategy;\r\nDES - an evolutionary strategy for criterion optimization with continuous variables;\r\nMMES - evolutionary strategy for multi-criteria optimization with discrete and continuous variables;\r\nFMOGA II - version of the algorithm MOGA with improved convergence;\r\nFSIMPLEX - Simplex version with better convergence and the possibility of making multicriteria problems;\r\nMOSA - version of simulated annealing with the possibility of making multicriteria problems;\r\nMACK - an algorithm for approximating the response surfaces;\r\nNLPQLP - algorithm of sequential quadratic programming (SQP);\r\nNLPQLP-NBI - Normal Boundary Intersection method + NLPQLP (algorithm with the ability to solve multiobjective nonlinear problems);\r\n\r\nMulti-Objective Particle Swarm.\r\nMetamodel (response surface approximation, RSM, approximate mathematical models), methods of construction:\r\nK-Nearest (method Shepard-a);\r\nSVD (singular value decomposition);\r\nKriging (Kriging), a technique of regression analysis based on the work Daniel Krige;\r\nParametric surfaces, polynomial regression;\r\nGaussian Processes - approach to solving problems of regression analysis based on the work of Beziers (Bayesian);\r\nArtificial neural networks, radial basis neural networks (radial basis function),\r\nMeans validation meta - models.\r\n6 Sigma Quality Management, Design for Six Sigma (DFSS):\r\n\r\nQuality Sigma (six sigma quality);\r\nFailure modes and effects analysis of their (discards analysis);\r\nIshikawa diagram.\r\nVisual data analysis, evaluation of the statistical significance of the data:\r\nThe probability density function (probability density function);\r\nInvestigation of the relationship between variables, scatterplot, line, bubble chart, trend lines;\r\nThe distribution data, histogram, &quot;pie», cumilative plot;\r\nLinear correlation analysis, correlation matrix (correlation matrix), matrix dispersion (scatter matrix), matrix effects\r\n(effects matrix);\r\nDetermination of the main characteristics of the sample, &quot;a box with a mustache» (box-whiskers), a graph quantile (Quantile-Quantile plot);\r\nCalculation of the closeness of interaction parameters;\r\nWorking with data samples of large dimension, Student's t test, analysis of variance (test Bon-Ferroni, ANOVA);\r\nTest samples (distribution fitting);\r\nMethods for cluster analysis:\r\n- Partitive clustering\r\n- Methods of hierarchical cluster analysis (hierarchical clustering) - average-linkage, centroid-linkaga, complete-linkaga, single-linkage,\r\nward approach,\r\n- K-means algorithm (K-Means Clustering), Forgy approach, Kaufman approach, Macqueen approach, random\r\n- The algorithm self-organizing maps (SOMs),\r\n- Dendrogram\r\nPrevious use in various areas:\r\n- Optimization of the form inlets\r\n- Optimization of the cooling system\r\n- Optimization of the flow of air in the engine compartment\r\n- Reduction of vibrations\r\n- Aerospace\r\n- Optimizing the form of a centrifugal compressor\r\n- The task of optimizing the shape of the axial turbine and axial compressor\r\n- General Engineering\r\n- Optimization of injection molding process\r\n- Optimization of the casting of metals\r\n- Optimization of technology of hot stamping\r\n- Marine Construction\r\n- Optimizing the ship hull, reduced drag\r\n- Optimal design of steering\r\n- Financial markets\r\n- The problem of optimizing the investment portfolio shares\r\n- Decision-making in the financial market","torrent":{"xt":"urn:btih:fb75a0ef48ccda71f356ceed0b828f930167fb80","amp;dn":"ESTECO+modeFRONTIER+v2014.1-SSQ+%28x86x64%29-%3DTEAM+OS%3D-","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb75a0ef48ccda71f356ceed0b828f930167fb80","infoHashBuffer":{"type":"Buffer","data":[251,117,160,239,72,204,218,113,243,86,206,237,11,130,143,147,1,103,251,128]},"announce":[],"urlList":[]}}