{"title":"Alex Christopher - Pandora's Box 2 II Denver Airport Story","uid":4436905,"size":50209846,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fd27f58d723dbcbd727411f0c8753d47a6505e85&amp;dn=Alex+Christopher+-+Pandora%5C%27s+Box+2+II+Denver+Airport+Story&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eastern876","files":1,"time":1223605556,"description":"Alex Christopher - Pandora&amp;#039;s Box 2 II - The Denver International Airport Story\n\nThis book is dedicated to the memory of Phil Shneider, who in the year of 1995, found out that the government was planning on putting American citizens into deep underground concentration camps that have been being built in the form of deep underground bases for many years. Phil left his job of many years in the construction of these underground bases for the government and started spreading the word to people around the world. He was killed in Jan. 1996.\n\nThe Table of Contents should pretty well serve as a summary of this book. The Denver International Airport, The May 1995 lecture by Phil Shneider, The Genesis and History of the Cosmic Conflict, The Descendants of Mu and Atlantis, British Israel : Steps Toward A British Union and a World State, What is Fasces and Fascism, Masonic Enslavement, Did AT&amp;T Have a Baby Devil ?, Ancient Mysteries, Central Banking &amp; The Money System, Inside the Shadow CIA, Tunnel Boring Patent, High Velocity Aircraft Patent, FEMA 41-10, Biological Diversity, The Hollow Earth, Denver Airport Mural Study, Land Dealing, Denver International Airport Capstone (Masonic Compass and Square), Underground Tour of DIA, Private Conversation With Phil Shneider, Contact With A Being From Andromeda (Well, we might as well hear what he or she has to say). There is some very Extremely Important Information in this book. Color photos of Denver Airport Wall Murals, including of a Nazi Stormtrooper and another of a letter written from a child who died in a concentration camp. This does not seem right. Nazis in the CIA &amp; look what happens. ","torrent":{"xt":"urn:btih:fd27f58d723dbcbd727411f0c8753d47a6505e85","amp;dn":"Alex+Christopher+-+Pandora%5C%27s+Box+2+II+Denver+Airport+Story","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd27f58d723dbcbd727411f0c8753d47a6505e85","infoHashBuffer":{"type":"Buffer","data":[253,39,245,141,114,61,188,189,114,116,17,240,200,117,61,71,166,80,94,133]},"announce":[],"urlList":[]}}