{"title":"The Butterfly Sister A Novel by Amy Gail Hansen","uid":8827305,"size":1767967,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fd70c634fbcd17500487129a9bc0ff5d9142060c&amp;dn=The+Butterfly+Sister+A+Novel+by+Amy+Gail+Hansen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"420weedman","files":2,"time":1376877555,"description":"&quot;My past was never more than one thought, one breath, one heartbeat away. And then, on that particular October evening, it literally arrived at my doorstep.&quot;\n\nEight months after dropping out of Tarble, an all-women's college, twenty-two-year-old Ruby Rousseau is still haunted by the memories of her senior year-a year marred by an affair with her English professor and a deep depression that not only caused her to question her own sanity but prompted a failed suicide attempt.\n\nAnd then a mysterious paisley print suitcase arrives, bearing Ruby's name and address on the tag. When Ruby tries to return the luggage to its rightful owner, Beth Richards, her dorm mate at Tarble, she learns that Beth disappeared two days earlier, and the suitcase is the only tangible evidence as to her whereabouts.\n\nConsumed by the mystery of the missing girl and the contents of the luggage-a tattered copy of Virginia Woolf's A Room of One's Own, the book on which Ruby based her senior thesis, and which she believes instigated her madness-she sets out to uncover the truth, not only about Beth Richards's past but also her own. In doing so, Ruby is forced to reexamine the people from her past: the professor who whisked her away to New Orleans and then shattered her heart and the ghosts of dead women writers who beckoned her to join their illustrious group. And when Ruby's storyline converges with Beth's in a way she never imagined, she returns to the one place she swore she never would: her alma mater.","torrent":{"xt":"urn:btih:fd70c634fbcd17500487129a9bc0ff5d9142060c","amp;dn":"The+Butterfly+Sister+A+Novel+by+Amy+Gail+Hansen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd70c634fbcd17500487129a9bc0ff5d9142060c","infoHashBuffer":{"type":"Buffer","data":[253,112,198,52,251,205,23,80,4,135,18,154,155,192,255,93,145,66,6,12]},"announce":[],"urlList":[]}}