{"title":"Gratuitous Tank Battles - TANK","uid":9097636,"size":83689888,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:fe70eaf372f6af7475d259d35b25285dd99ea0ea&amp;dn=Gratuitous+Tank+Battles+-+TANK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dupetank","files":1,"time":1382723666,"description":"Gratuitous Tank Battles (GTB) is a unique hybrid of tower-defense, strategy, simulation and RTS. Set in an alternate history timeline where World War I never ends, you are the commander of allied forces fighting right up to the year 2114, where Mechs and lasers are used alongside tanks and rifles. The war continues across Europe, with the allied commanders still locked into the optimistic patriotism of the 1900s.\n\n\n\nA tower-defense game where you can play as the attacker has been done before, but GTB lets you play the same maps as attacker OR defender, and even lets you save out your attack as a recording to defend against. An online-challenge system lets you upload your custom maps and custom units and attacks for other players to fight against. Speaking of custom units, GTB doesn't have simple pre-built units, but allows you to build them from individual components, and even design the appearance and colors of every single unit. An unlocks system gradually reveals more modules, abilities and unit 'hulls' to experiment with.\n\n\n\nGTB also features an integrated map editor that lets you trivially change and tweak existing maps, or create entirely new ones, and the process of sharing these custom maps with friends is built right into the game. Combine it with Steam achievements, community, cloud support and more, and you should be kept busy fighting over Europe for another two hundred years.\n\n\nKey Features\n\n    Alternate History Tower Defense: Fight a 200 year war to save Europe\n\n    Play as attacker or defender on any map, even custom ones\n \n    Fight with Infantry, Tanks, Turrets and Mechs\n \n    Optional Adaptive AI adjusts to your play style and tactics for endless variety\n \n    Customizable units allow you to design your own personal army\n \n    Built-in level editor makes creating a new map a breeze\n \n    Save out your attack and play against it as the defender\n \n    Online map and challenge-sharing system allows you to fight your friends armies \n\nPC System Requirements\n\n        OS: Windows XP\n        Processor: 1.5 GHz processor\n        Memory: 2 GB RAM\n        Graphics: 3D card with 128MB video memory\n        DirectXÂ®: 9.0c\n        Hard Drive: 500 MB HD space \n\n\n\n-----------------------------------------------------------------------------------\n\nInstructions:\n\n-Install\n-Play\n-No serial or key needed\n\nThis is the DRM-free version from the Humble Bundle.","torrent":{"xt":"urn:btih:fe70eaf372f6af7475d259d35b25285dd99ea0ea","amp;dn":"Gratuitous+Tank+Battles+-+TANK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe70eaf372f6af7475d259d35b25285dd99ea0ea","infoHashBuffer":{"type":"Buffer","data":[254,112,234,243,114,246,175,116,117,210,89,211,91,37,40,93,217,158,160,234]},"announce":[],"urlList":[]}}