{"title":"Lameco Knife Fighting DVD Rip","uid":4897959,"size":488270212,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:fe8c1147763c56eab8414a1143295b13c307dfff&amp;dn=Lameco+Knife+Fighting+DVD+Rip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"x_DontTreadOnMe_x","files":-1,"time":1242447189,"description":"&quot;If you're ready, you can now learn the most advanced (but still easy and simple) knife-fighting techniques in the world. And you can learn them faster, and easier, and with less BS than anyone else. We found Felix Valencia - the most respected &quot;streetfighting blade man&quot; on the planet - and convinced him to let us videotape his ultimate lessons. These are the EXACT SAME SKILLS he teaches the elite soldiers, cops and agents who come to him begging for his knowledge. (Including Green Berets, the CIA, SEALS, etc.) Here's what you're about to learn: There are two video training sessions in this package. \n\nIncluded are:\n-How to aggressively defend against a knife attack when you are bare-handed.\n-How to disarm a knife-wielding attacker in the blink of an eye.\n-How to use a blade during close-quarters groundfighting.\n-The secrets of street knife-fighting.\n-How to use your own knife super-effectively in a fight, including the most tender and easiest to reach targets on his body.&quot;\n\n~~~\n\nI am always adding new things, so check this account often.\n\nVisit roguesci (dot) org (slash) theforum, and register, for the world's longest running largest explosives and weapons forum on the web!","torrent":{"xt":"urn:btih:fe8c1147763c56eab8414a1143295b13c307dfff","amp;dn":"Lameco+Knife+Fighting+DVD+Rip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe8c1147763c56eab8414a1143295b13c307dfff","infoHashBuffer":{"type":"Buffer","data":[254,140,17,71,118,60,86,234,184,65,74,17,67,41,91,19,195,7,223,255]},"announce":[],"urlList":[]}}