{"title":"Cirque du Soleil - Lovesick (2006) [DVD-Rip]","uid":4786598,"size":733865984,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:feb8c782f0b9b7c021816c4c2a0726cd8811b261&amp;dn=Cirque+du+Soleil+-+Lovesick+%282006%29+%5BDVD-Rip%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1237572560,"description":"From the creators of the reality series Fire Within comes another look at the creation of a Cirque du Soleil production--in this case, the controversial and erotic Zumanity, which performs exclusively in Las Vegas. Lovesick follows four performers--drag MC Joey Arias (also seen in Mondo New York); an alarmingly muscular Cuban named Alex, who discovers his girlfriend is pregnant as he's in the midst of the show's development; British Laetitia, who keeps imagining her father's unhappy response to the show; and Canadian Jonel, who's soon to be married--if her fiance can make it across the border. As the documentary chronicles the bumpy and often abrasive process of Zumanity's creation, it delves into the strain the show puts on the performers' relationships, both because of the show's sexual content and the enormous commitment it requires. Viewers seeking titillation will probably be disappointed, as Lovesick only provides glimpses of Zumanity itself. But anyone interested in the interplay between on-stage and off in the lives of performers will find this documentary fascinating and wish it had only gone further into the dancers' psyches.\n\nProduct Description\nDare to enter the sensual world of LOVESICK, an adult-themed, reality-based drama that explores the eccentric lives lead by Sin City's most provocative performers.\n\nFilmed over two years and set in Las Vegas during the creation of the cabaret-style production\nZUMANITY, ANOTHER SIDE OF CIRQUE DU SOLEIL', LOVESICK discloses the disturbing reality of the talented and entrancing artists who put their flesh and audacity centre stage to create this edgy new show.\n\nMeet Alex, the flirtatious Cuban stripper; Joey, the sassy but endearing New York City drag queen; Laetitia, the elegant and ambitious British dancer; Jonel, the audacious debutant; Andrew, the Director of Creation; and Spymonkey, the spontaneous clown quartet'all of whom will challenge their own limits and be forced to redefine their identities.\n\nSexy, poetic and intensely erotic, LOVESICK slips inside a startling universe where men dress up as women, brides perform in staged orgies, and love affairs are exposed under the show's glaring spotlights.\n\nLength: 99min\nCodec: XVID\nResolution: 624 * 352\nAudio: MP3 128kbit VBR","torrent":{"xt":"urn:btih:feb8c782f0b9b7c021816c4c2a0726cd8811b261","amp;dn":"Cirque+du+Soleil+-+Lovesick+%282006%29+%5BDVD-Rip%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"feb8c782f0b9b7c021816c4c2a0726cd8811b261","infoHashBuffer":{"type":"Buffer","data":[254,184,199,130,240,185,183,192,33,129,108,76,42,7,38,205,136,17,178,97]},"announce":[],"urlList":[]}}