{"title":"TightVNC 1.3.10 - Unix source code (Tar + Bzip2)","uid":4754345,"size":1780510,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:fed4fbe6ad329225d36c964accaee3c9de015671&amp;dn=TightVNC+1.3.10+-+Unix+source+code+%28Tar+%2B+Bzip2%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"olofolleola4","files":-1,"time":1236369360,"description":"Copied from TightVNC Homepage:\n\n\nTightVNC is a free remote control software package derived from the popular VNC software. With TightVNC, you can see the desktop of a remote machine and control it with your local mouse and keyboard, just like you would do it sitting in the front of that computer.\n\nTightVNC is:\n\n* free, GPL-licensed, with full source code available;\n\n* useful in remote administration, remote customer support, education, and for many other purposes;\n\n* cross-platform, available for Windows and Unix, compatible with other VNC software.\n\n\n\nWhat Is TightVNC?\n\nVNC (an abbreviation for Virtual Network Computing) is a great client/server software package allowing remote network access to graphical desktops.\nWith VNC, you can access your machine from everywhere provided that your machine is connected to the Internet. VNC is free (released under the GNU General Public License) and it's available on most platforms.\n\nHere you can find an enhanced version of VNC, called TightVNC, which includes a lot of new features, improvements, optimizations and bugfixes over the original VNC version. Note that TightVNC is still free, cross-platform and compatible with the standard VNC.\nMany users agree that TightVNC is the most advanced free remote desktop package.\nAnd it's being actively developed so you can expect that TightVNC will become even better.\n\nTightVNC can be used to perform remote control and administration tasks in Windows, Unix and mixed network environments. It can be very helpful in distance learning and remote customer support. Finally, you can find a number of additional VNC-compatible utilities and packages that can extend the areas where TightVNC can be helpful.\n\n\nTightVNC is a project maintained by Constantin Kaplinsky.\nMany other individuals and companies participate in development, testing and support.\n\n\nHow TightVNC Differs from Other VNC Products?\n\nIn short (more information is likely to appear here soon):\n\n* We are trying to gather all the useful features, while keeping TightVNC free, stable and protocol-compatible with other RFB-compliant VNC software. \n\n\nCompatibility and Interoperability\n\nTightVNC is fully compatible with the standard RFB protocol used in VNC, so you can use TightVNC viewer with the standard VNC server and vice versa.\nBut note that protocol enhancements implemented in TightVNC will work only if these enhancements are supported on both sides of the connection.\n\n\nTightVNC Features\n\nHere is a brief list of TightVNC features absent in the standard VNC.\n\n\n* Efficient &quot;Tight&quot; encoding with optional JPEG compression.\nNew Tight encoding is optimized for slow and medium-speed connections and thus generates much less traffic as compared to traditional VNC encodings.\nUnlike other encodings, Tight encoding is configurable via compression levels and JPEG image quality setting.\n\n* Enhanced Web browser access. TightVNC includes a greatly improved Java viewer with full support for Tight encoding, 24-bit color mode, and more.\nThe Java viewer applet can be accessed via built-in HTTP server like in the standard VNC.\n\n* Support for two passwords, full-control and read-only.\nThe server allows or disallows remote keyboard and mouse events depending on which password was used for authentication.\n\n* Automatic SSH tunneling on Unix. The Unix version of TightVNC Viewer can tunnel connections via SSH automatically using local SSH/OpenSSH client installation.\n\n* And more. TightVNC includes a number of other improvements, performance optimizations and bugfixes, see change logs for more information.","torrent":{"xt":"urn:btih:fed4fbe6ad329225d36c964accaee3c9de015671","amp;dn":"TightVNC+1.3.10+-+Unix+source+code+%28Tar+%2B+Bzip2%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fed4fbe6ad329225d36c964accaee3c9de015671","infoHashBuffer":{"type":"Buffer","data":[254,212,251,230,173,50,146,37,211,108,150,74,204,174,227,201,222,1,86,113]},"announce":[],"urlList":[]}}