{"title":"O.Asimvivastos.1979.Greek movie","uid":7424424,"size":890222085,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ffa09264484bf92a2f64f51c730a8fba70878fbd&amp;dn=O.Asimvivastos.1979.Greek+movie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gregath","files":5,"time":1341764163,"description":"Paul is a romantic young man who after an encounter with a doctor and professor father decides to abandon his studies and devote himself to music. At the same time leaves him and his girlfriend, while he starts to live his guitar playing and singing in the streets. His life among ordinary people are carefree and happy companionship and friendship of another errant singer and &quot;philosopher,&quot; the Apostle Flou, while connected with Anastasia. The meeting with the director of a record company proves fruitless. He is disappointed. Anastasia is leaving the turn because he considered immature. The Flou suicide poetry and Paul falls in love with Irene, a journalist whom he had met at the turn of a television broadcast. After the death of his father somewhat reconciled to life and returns to school. Irene married, two children acquire, get his degree and starts working as a physician. His struggle, however, seems to have teleiosei.O he has not fully reconciled, since the alienation does not touch the depths of his soul.","torrent":{"xt":"urn:btih:ffa09264484bf92a2f64f51c730a8fba70878fbd","amp;dn":"O.Asimvivastos.1979.Greek+movie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ffa09264484bf92a2f64f51c730a8fba70878fbd","infoHashBuffer":{"type":"Buffer","data":[255,160,146,100,72,75,249,42,47,100,245,28,115,10,143,186,112,135,143,189]},"announce":[],"urlList":[]}}